<?php

namespace Faker\Provider\fa_AF;

class Person extends \Faker\Provider\Person
{
    /**
     * @example 'عبدالرحمن شیرزاد'
     * @example 'مهندس عبدالرحمن شیرزاد'
     * @example 'انجنیر عبدالرحمن شیرزاد'
     * @example 'داکتر عبدالرحمن شیرزاد'
     * @example 'آقای عبدالرحمن شیرزاد'
    */
    protected static $maleNameFormats = array(
        '{{firstNameMale}} {{lastName}}',
        '{{titleMale}} {{firstNameMale}} {{lastName}}',
    );

    /**
     * @example 'فرشته احمدی'
     * @example 'خانم فرشته احمدی'
     * @example 'مهندس فرشته احمدی'
     * @example 'داکترس فرشته احمدی'
    */
    protected static $femaleNameFormats = array(
        '{{firstNameFemale}} {{lastName}}',
        '{{titleFemale}} {{firstNameFemale}} {{lastName}}',
    );

    /**
     * @source Afghanistan Kankor (University Entrance Exam) 2003-2017 data.
     * The data collected, preprocessed and prepared by Abdul Rahman Sherzad (absherzad@gmail.com).
     * @license: Creative Commons Attribution-ShareAlike License
    */
    protected static $firstNameMale = array("ذبیح الله", "نجیب الله", "عبدالله", "سمیع الله", "حمیدالله", "روح الله", "احسان الله", "نقیب الله", "رحمت الله", "اسدالله", "حبیب الله", "نعمت الله", "عصمت الله", "حسیب الله", "وحیدالله", "صفی الله", "مصطفی", "محمد", "عبیدالله", "جاوید", "حکمت الله", "میرویس", 
    "نصیراحمد", "فرهاد", "عزت الله", "عتیق الله", "نورالله", "شفیق الله", "عبدالرحمن", "حشمت الله", "نصرت الله", "عبدالبصیر", "امید", "عزیزالله", "اجمل", "حامد", "خالد", "محب الله", "قدرت الله", "هدایت الله", "نثاراحمد", "امان الله", "محمدعارف", "رفیع الله", "مطیع 
    الله", "مسعود", "مرتضی", "عنایت الله", "امین الله", "جمشید", "رحیم الله", "حفیظ الله", "عبدالصبور", "حیات الله", "محمدحسین", "شفیع الله", "صبغت الله", "احمدشاه", "فریدون", "عبدالحمید", "صدیق الله", "همایون", "صفت الله", "محمد هارون", "بشیر احمد", "محمدعلی", 
    "محمدالله", "بسم الله", "ایمل", "نوید", "محمدیوسف", "مجتبی", "محمدامین", "محمدنعیم", "عبدالواحد", "محمدناصر", "جواد", "شریف الله", "محمدابراهیم", "محمدنسیم", "حبیب الرحمن", "محمدرضا", "احمدالله", "فریداحمد", "عبدالمتین", "رامین", "محمدجاوید", "شکرالله", 
    "عبدالقدیر", "پرویز", "عبدالرحیم", "نصرالله", "عبدالهادی", "محمدفهیم", "احمد", "محمدشریف", "عبدالباسط", "محمدآصف", "محمدداود", "نوراحمد", "محمدیاسین", "فریدالله", "سیف الله", "محمدرفیع", "بریالی", "محمدحسن", "عبدالبشیر", "سلیمان", "احمدجاوید", "مهدی", 
    "احمدضیا", "فواد", "مجیب الرحمن", "محمدصابر", "محمود", "محمدخالد", "محمدادریس", "عبدالوهاب", "عبدالخالق", "هارون", "نورمحمد", "ابراهیم", "عبدالحکیم", "لطف الله", "ادریس", "محمدحامد", "محمدسلیم", "محمدیونس", "ذکرالله", "عبدالکریم", "منصور", "محمدجواد", 
    "علی رضا", "عبدالقادر", "کریم الله", "محمدصادق", "فیصل", "عمران", "عبدالمجید", "محمدعمر", "فهیم", "عبدالقیوم", "مسیح الله", "فیض الله", "محمدطاهر", "علی احمد", "عبدالعزیز", "احمدرشاد", "عبدالستار", "اسلام الدین", "عبدالولی", "سهراب", "خیرالله", "محیب الله", 
    "رضا", "عبدالغفار", "شمس الرحمن", "عبدالصمد", "حسین", "سیف الرحمن", "سیداحمد", "زلمی", "عبدالروف", "عبدالطیف", "محمداسماعیل", "قیس", "غلام سخی", "شمس الله", "فضل الرحمن", "مجیب الله", "محمدقاسم", "عبدالحق", "فرید", "محمدحنیف", "محمدنبی", 
    "محمداصف", "زاهدالله", "ذکریا", "سیدمحمد", "عبدالاحد", "عبدالرشید", "عبدالواسع", "علی", "نذیراحمد", "احمدفواد", "نویدالله", "محمدشعیب", "نصیب الله", "محبوب الله", "عبدالسمیع", "عبدالغفور", "محمدرحیم", "ضیاالحق", "جمعه خان", "گل احمد", "عبدالمالک", "شمس 
    الدین", "بصیراحمد", "محمد اکبر", "محمدظاهر", "عبدالشکور", "احمد سیر", "صلاح الدین", "عبدالناصر", "صمیم", "احمدفرید", "عبدالجمیل", "جمال الدین", "فضل احمد", "عبدالجلیل", "زمری", "عبدالوارث", "گل محمد", "جلال الدین", "شیرمحمد", "توریالی", "برهان الدین", 
    "محمدعیسی", "احمدخالد", "عبدالخلیل", "خان محمد", "میوند", "عبدالجبار", "حزب الله", "عزیزالرحمن", "فردین", "اسماعیل", "امیدالله", "محمدهاشم", "عبدالرازق", "محمدشفیع", "سراج الدین", "جان محمد", "فیض محمد", "هجرت الله", "احمدنوید", "عبدالوکیل", "نیک محمد", 
    "محمدظریف", "بلال", "فیروز", "عبدالباری", "محمدانور", "محمدشفیق", "خلیل الله", "احمدفهیم", "عبدالمنیر", "محمداشرف", "عبدالمنان", "شبیراحمد", "عاشق الله", "محمد اسحق", "محمدبشیر", "محمدمصطفی", "عبدالقهار", "نظام الدین", "نورالدین", "عرفان الله", "نورالحق", 
    "عزیزاحمد", "رازمحمد", "علی محمد", "عبدالفتاح", "تمیم", "شیراحمد", "ضیاالرحمن", "عبادالله", "امرالله", "محمدعالم", "احمد شکیب", "عبدالمبین", "فدامحمد", "محمد عظیم", "محمد نادر", "نبی الله", "محمد صمیم", "نجم الدین", "محمدمهدی", "ننگیالی", "خیبر", "تاج محمد", "شاه 
    محمد", "نورالرحمن", "دین محمد", "واحد الله", "عباس", "عبدالوحید", "محمد طارق", "شعیب", "محمد ولی", "شهاب الدین", "معراج الدین", "حسن", "امیرمحمد", "خیرمحمد", "محمدعثمان", "محمد قسیم", "میلاد", "احمد شعیب", "دوست محمد", "عطاالله", "محمد ایوب", "انعام 
    الله", 
    "محمد موسی", "عبدالقدوس", "لعل محمد", "محمدیعقوب", "محمدزمان", "یار محمد", "محمدنذیر", "نظیف الله", "محمد ضیا", "یما", "کفایت الله", "خلیل احمد", "احمدجواد", "رمضان", "عبدالرزاق", "رومل", "محمدنصیر", "محمدفرید", "برکت الله", "ویس الدین", "غلام محمد", 
    "قیام 
    الدین", "عبدالمصور", "ضیاالدین", "محمد الیاس", "ذاکرالله", "عبدالودود", "رامش", "غلام نبی", "محمد سالم", "محمد صدیق", "فضل الحق", "عبدالسلام", "محمداحسان", "محمدکریم", "محمدتمیم", "اکرام الله", "زین الله", "سبحان الله", "نورآغا", "رحمن الله", "عبدالحی", 
    "محمداسمعیل", "سیف الدین", "غلام رسول", "احمد ولی", "حمید", "غلام علی", "محمد اجمل", "عبدالمعروف", "اخترمحمد", "بازمحمد", "زبیر", "منیراحمد", "ولی الله", "میر احمد", "محمدکاظم", "محمد نوید", "ولی محمد", "فضل الله", "حمدالله", "محمداقبال", "عبدالاحمد", "شمس 
    الحق", "محمد زبیر", "نیاز محمد", "محمد منصور", "حضرت الله", "غلام رضا", "محمدرسول", "اکرام الدین", "حسین علی", "نظر محمد", "امام الدین", "سید مصطفی", "عبدالحسیب", "عبدالغنی", "عبدالحلیم", "مختار", "خداداد", "خوشحال خان", "عبدالرقیب", "عظیم الله", "سردار 
    ولی", "الله محمد", "صالح محمد", "غلام مصطفی", "احمد صمیم", "ناصر", "علی جان", "خلیل الرحمن", "فرزاد", "کمال الدین", "شجاع الدین", "غلام فاروق", "عبدالعلی", "عیدمحمد", "محمدهادی", "محمدامان", "جلیل احمد", "عبدالباقی", "فردوس", "الیاس", "شاهدالله", 
    "محمدکبیر", 
    "عبدالنصیر", "امرالدین", "احمد زبیر", "داود", "غلام حضرت", "طارق", "عارف", "حکیم الله", "عبدالعظیم", "عبدالکبیر", "حسام الدین", "سیدالرحمن", "عبدالمطلب", "محمدشاکر", "وحید", "عبدالحفیظ", "احمدفرهاد", "خال محمد", "فیض الرحمن", "عین الدین", "محمدحکیم", "زبیح 
    الله", "غلام حیدر", "ضیاالله", "محمد منیر", "غلام عباس", "علی خان", "موسی", "خیرالدین", "نویداحمد", "شاکرالله", "محمدرفیق", "صدرالدین", "محمد امید", "غلام حسین", "محمدفواد", "جمعه گل", "ثناءالله", "حاجی محمد", "گلبدین", "بختیار", "عابدالله", "رضوان الله", "محمد 
    ذاکر", "شاه ولی", "محمدباقر", "محمدگل", "محمد عمران", "اسمعیل", "فضل الدین", "محراب الدین", "عین الله", "محمد بلال", "علی سینا", "محمدخان", "شیرشاه", "بلال احمد", "احمد ذکی", "امیرخان", "محمد سرور", "جعفر", "سلطان محمد", "فخرالدین", "وحید احمد", 
    "عبدالظاهر", "محمدرامین", "سیدعلی", "مزمل", "نور آغا", "محمداسلم", "وکیل احمد", "عبدالحنان", "محمدعابد", "محمد تقی", "یاسین", "شاه محمود", "جاوید احمد", "عارف الله", "مجاهد", "عبدالتواب", "علاوالدین", "علی اکبر", "احمدزی", "احمد ولید", "سباوون", "صادق", "خیال 
    محمد", "سعیدالله", "محمداکرم", "سیدمرتضی", "عبدالملک", "فیروزاحمد", "محسن", "حنیف الله", "محمدضمیر", "عبدالخبیر", "غلام ربانی", "محمد همایون", "محمد وسیم", "حجت الله", "محمد سلیمان", "تیمور شاه", "خسرو", "فهیم الله", "عبدالفهیم", "عبدالعلیم", "محمدافضل", "محمد 
    بصیر", "نعمان", "احمد بلال", "سمسور", "محمد یاسر", "رحم الدین", "امین", "محمدحلیم", "حمیدالله", "محمد محسن", "ولید", "دلاور", "ابوبکر", "محمد جان", "گلاب الدین", "محمدایمل", "اقبال", "ویس", "عبدالحبیب", "محمد مسعود", "سیدحسین", "اعجازالحق", "احمدتمیم", 
    "سیدحامد", "قاسم", "سید مهدی", "فیاض", "شیرعلی", "احمد راشد", "سردار", "وحید الله", "سید روح الله", "سیدعبدالله", "احمدفیصل", "راشد", "محمدآغا", "احمدخان", "شکیب", "عطامحمد", "محمدفیصل", "محمدفاروق", "سمیر", "عطاوالله", "مهرالله", "بشیر", "محمدعزیز", 
    "شیرآغا", "مختاراحمد", "زیارمل", "محمدشاه", "جمیل الرحمن", "خلیل", "محمد سمیع", "یاسر", "سیدحسن", "محمدذکی", "جان آغا", "کامران", "عزیز", "فتح الله", "تاج الدین", "یوسف", "هیواد", "بهرام", "رستم", "سلیم", "شریف", "قربان", "سمیع الحق", "عمران الله", "فرمان 
    الله", "محمدفرهاد", "صدام حسین", "غوث الدین", "الهام الدین", "عبدالواجد", "محمد اسحاق", "محمدحارث", "مسلم", "بکتاش", "عابد", "گل الرحمن", "صدام", "سیدمجتبی", "شاداب", "غلام سرور", "نسیم", "عبدالمقیم", "فضل الربی", "گل آغا", "زین الدین", "فیض احمد", 
    "محمداعظم", "محمدجمعه", "احمدجان", "وفی الله", "عبدالرسول", "احمد میلاد", "عبدالخالد", "قندآغا", "ذین الله", "شیرزی", "هادی", "عبدالظهور", "محمدنور", "مقصود", "همت الله", "احمد سمیر", "احمد مسعود", "سید رضا", "رفیق الله", "مبارز", "معروف", "احمد سهیل", "سردار 
    محمد", "سیدالله", "نورعلی", "سنگر", "محمد جعفر", "نصرالدین", "نوروز", "محمد طیب", "محمد امیر", "نصیرالله", "پیمان", "سمع الله", "سید جاوید", "ضیاوالدین", "سید مسعود", "شیرخان", "عبدالحامد", "دادمحمد", "عبدالحسین", "غلام یحیی", "کلیم الله", "علی داد", "سید 
    منصور", "شیرالله", "عبدالمحمد", "محمدجمیل", "عبدالسلیم", "عبدالمنصور", "جمیل", "سیدآغا", "عزیز الله", "اکمل", "مول الدین", "طوفان", "محمد اسلام", "محمد سمیر", "ذاکر حسین", "ذاهدالله", "عبدالمجیب", "لطف الرحمن", "محفوظ الله", "ممتاز", "عبدالرب", "خان آغا", 
    "محمد معروف", "امیرالله", "سکندر", "محمد عارف", "سهیل", "محمد قیس", "سید عمر", "شراف الدین", "ارشاد", "سجاد", "حضرت بلال", "شمشاد", "عبدالواسیع", "اسد الله", "سید ولی", "محبت الله", "نجیب الرحمن", "صابر", "آصف", "محمد نعیم", "احمد جاوید", "اسحق", 
    "سیدجواد", "صداقت", "رومان", "مدثر", "احمد منیر", "گلبدالدین", "احمدعلی", "غلام مجتبی", "محمد حسیب", "محمد مختار", "احمد شاه", "توفیق", "ذکی الله", "سید ذبیح الله", "احمد ظاهر", "جمعه الدین", "شوکت الله", "جهان زیب", "محمد اغا", "میثم", "بخت الله", "حسین داد", 
    "ظاهر", "محمد سعید", "محمد عوض", "جمال ناصر", "سیدرحیم", "طاهر", "نصیر احمد", "نعیم الله", "شاپور", "عبدالفرید", "محمد فیروز", "عبدالصمیم", "فرشاد", "احمد شاکر", "عوض علی", "محی الدین", "غلام صدیق", "فرشید", "لیاقت", "محمدالدین", "عبدالغیور", 
    "انصارالله", "علی حسین", "فرید احمد", "امان الدین", "عیسی خان", "آغامحمد", "محمد زاهد", "محمدصبور", "محمدنعمان", "مشتاق", "وارث", "محمدصالح", "ابوذر", "احمدفیاض", "شرف الدین", "شهیدالله", "شوکت", "فضل الرحیم", "محمد داود", "شاکر", "ضیاءالحق", "عبدالقاهر", 
    "عبدالمومن", "غلام حسن", "اکبر", "باقر", "خالد احمد", "شیر آغا", "سعدالله", "وزیراحمد", "ارسلان", "سرور", "سیدرحمن", "غلام محی الدین", "جنت گل", "ضمیر", "عبدالباعث", "محمد مجتبی", "ولی خان", "ظاهر شاه", "وسیع الله", "محمد امین", "علی اصغر", "بیژن", 
    "خدایداد", "خان ولی", "سلطان", "سیدعارف", "احمد رامین", "کاظم", "زبیراحمد", "عبیدالرحمن", "بهرام الدین", "سید آغا", "غلام مرتضی", "میرآغا", "علی شاه", "فاروق", "محمد مرتضی", "الهام", "عثمان", "محمد ابراهیم", "محمد ذکریا", "ملیار", "فضل محمد", "نادر شاه", 
    "احمد حامد", "دادالله", "سیدجعفر", "حضرت محمد", "رجب علی", "رحمان الله", "محمد ویس", "جاویدالله", "گل رحمن", "ثمرالدین", "سیدحبیب", "حبیب", "اباسین", "زبیدالله", "سید امین", "محمد نسیم", "وحدت الله", "فرهادالله", "ربیع الله", "خال الدین", "شعیب الله", "محمد 
    فیاض", "مشعل", "هلال الدین", "احمد منصور", "محمد علی", "یونس", "درمحمد", "سیدجلال", "عادل", "فیروزالدین", "فیض الدین", "محمد هارون", "احسان", "شفیق", "عطاءالله", "موسی خان", "سلمان", "محمد لطیف", "احمد الله", "احمد امید", "زمان الدین", "عجب خان", "قطب الدین", 
    "محمد خالد", "نوروز علی", "حارث", "محمد خلیل", "امان", "بیت الله", "زریالی", "قربان علی", "توفیق الله", "نعیم", "محمد فاضل", "محمد یحیی", "منیر", "الماس", "حیدر", "سخیداد", "سید اکبر", "محمد الله", "محمد حسین", "منصور احمد", "سید ابراهیم", "شاه پور", "شیرزاد", 
    "بهروز", "محمد فهیم", "نسیم الله", "سید حبیب الله", "سید ناصر", "عطاالرحمن", "مبارک شاه", "محمد آصف", "محمد اکرام", "وسیم", "بهاوالدین", "غلام یحیی", "محمد شکیب", "محمد نواب", "احمد مختار", "بصیر", "سید محمود", "احمد گل", "اسرار الله", "حضرت ولی", "جان 
    اغا", "سخی محمد", "شهرام", "قربان علی", "کرامت الله", "محب الرحمن", "بشرمل", "پیرمحمد", "دل آغا", "عبدالقدیم", "یحیی", "شیر حسین", "لطیف الله", "مصور", "حامدالله", "زمان", "عیدی محمد", "زاهد", "محمد عباس", "رشاد", "سید عالم", "عبدالفواد", "محمد جاوید", 
    "محمد رفیع", "سیدعباس", "شرافت", "کریم", "نادر", "احمد ضیاء", "گل ولی", "محمدراشد", "محمد ظفر", "اشرف", "عبیدالله", "محمد عادل", "صحبت الله", "گل آغا", "میرزا محمد", "ایام الدین", "میرحمزه", "ثناءالله", "ذکی", "عمر", "محمد علم", "محمد ندیم", "امدادالله", 
    "سیدکریم", "مشتاق احمد", "سید نجیب الله", "شاهین", "محمد ناصر", "آرش", "سلطان احمد", "محمد رضا", "نثار احمد", "احمد ضیا", "حسن علی", "ضیاءالحق", "محبوب", "هلال", "الفت الله", "انور", "عنایت الرحمن", "غیاث الدین", "فرامرز", "احمد ارشاد", "احمد شبیر", "ساحل", 
    "سمیراحمد", "سیدامیر", "قند آغا", "ریاض الله", "صبرالله", "محمد یوسف", "محمد دین", "محمد شبیر", "ناصر احمد", "احمد رضا", "پاینده محمد", "ظفر خان", "عبداللطیف", "سید هارون", "فواد احمد", "محمد ادریس", "ناصرخان", "احمد مسیح", "حمایت الله", "محمد توفیق", "محمد 
    مسلم", "ادیب الله", "عوض", "احمد قیس", "رسول خان", "محمد شریف", "محمد مبین", "محمد معصوم", "محمدن ظیف", "تقی", "توحید الله", "ثناءالله", "رحمن", "عمادالدین", "ویس الله", "احمد طارق", "شیرآقا", "قمرالدین", "محمدجمشید", "معشوق", "الله داد");

    /**
     * @source Afghanistan Kankor (University Entrance Exam) 2003-2017 data.
     * The data collected, preprocessed and prepared by Abdul Rahman Sherzad (absherzad@gmail.com).
     * @license: Creative Commons Attribution-ShareAlike License
    */
    protected static $firstNameFemale = array("فاطمه", "فرشته", "مریم", "زهرا", "فرزانه", "مرسل", "تمنا", "مرضیه", "سمیرا", "خاطره", "شکریه", "معصومه", "نرگس", "شبانه", "فریده", "شگوفه", "آرزو", "مژگان", "نیلوفر", "راضیه", "فریبا", "سهیلا", "ذکیه", "فهیمه", "نوریه", "وحیده", "خالده", "زینب", "بصیره", 
    "خدیجه", "حمیده", "فوزیه", "سمیه", "شکیلا", "زهره", "نجیبه", "شکیبا", "صدیقه", "نادیه", "شبنم", "فروزان", "ثریا", "مسعوده", "لطیفه", "پروانه", "شریفه", "عزیزه", "مدینه", "منیژه", "یلدا", "لیدا", "جمیله", "حمیرا", "سکینه", "ناجیه", "نظیفه", "نسیمه", "رحیمه", "زحل", 
    "نیلاب", "فرحناز", "سونیا", "کریمه", "عاطفه", "پلوشه", "سویتا", "رویا", "آمنه", "زرمینه", "ریحانه", "نگینه", "نبیلا", "حبیبه", "عادله", "طاهره", "لینا", "حلیمه", "رقیه", "لیلا", "شفیقه", "فیروزه", "راحله", "بنفشه", "نسرین", "سوسن", "نفیسه", "محبوبه", "یاسمین", 
    "صالحه", "بهشته", "مژده", "زرغونه", "وژمه", "حسینه", "حسینا", "سعیده", "صابره", "پریسا", "رابعه", "کامله", "تهمینه", "صدف", "عاقله", "صفیه", "منیره", "فریحه", "ملالی", "هما", "ملیحه", "انیسه", "ناهیده", "شیما", "شمیلا", "سیما", "شازیه", "عارفه", "سحر", 
    "نازنین", "حنیفه", "ظریفه", "مینه", "سعدیه", "طیبه", "پروین", "نازیه", "کبرا", "مینا", "اسما", "سونیتا", "فرخنده", "لیمه", "شیبا", "عالیه", "عایشه", "عابده", "ویدا", "ملکه", "سامعه", "لیلما", "سلما", "شیلا", "گیتا", "سودابه", "فتانه", "برشنا", "ذاکره", "ارزو", "شایسته", 
    "ستاره", "گلالی", "انیتا", "انجیلا", "قدسیه", "وجیهه", "هدیه", "سلیمه", "رخسار", "رونا", "نجیلا", "دیبا", "گلثوم", "نصیبه", "فریما", "ناهید", "بهاره", "مارینا", "زیبا", "فاضله", "حسنا", "مروه", "نازیلا", "نجلا", "الهه", "بلقیس", "سوما", "حکیمه", "رمزیه", "زبیده", 
    "ماریا", "سارا", "حسنیه", "ساره", "افسانه", "نادره", "طوبا", "کرشمه", "اناهیتا", "شهلا", "سونا", "هنگامه", "مستوره", "ضیاگل", "فخریه", "فایزه", "فضیله", "دیانا", "هاجره", "مهناز", "نبیله", "هیلی", "سپوژمی", "شمسیه", "مسکا", "آمینه", "حفیظه", "هوسی", "ساجده", 
    "آسیه", "مولوده", "سیماگل", "وجیه", "نصیره", "نویده", "روحینا", "حسیبا", "زرلشت", "بی بی مریم", "حدیثه", "انوشه", "ماه جبین", "حسیبه", "میترا", "ماریه", "رویدا", "خاتمه", "شهناز", "نذیره", "مومنه", "سجیه", "رخشانه", "مرجان", "مونسه", "گیتی", "خجسته", 
    "مهریه", 
    "لیزا", "آصفه", "روهینا", "روینا", "امنه", "آزیتا", "ادیبه", "لیلی", "پرستو", "خوشبو", "روبینا", "صغرا", "تبسم", "الهام", "پرمیلا", "مسلمه", "رعنا", "سیاه موی", "شاکره", "رزما", "مهدیه", "مهتاب", "شکوفه", "سلسله", "بی بی فاطمه", "دینا", "سایره", "بی بی گل", 
    "ظاهره", 
    "اصیلا", "سومن", "شهربانو", "ملینا", "مرینا", "وسیمه", "ماه گل", "نجمه", "خورشید", "فردینا", "امینه", "انیس گل", "روقیه", "محجوبه", "زلیخا", "سمین", "سونم", "ماری", "بی نظیر", "ترینا", "سلطانه", "ضمیره", "پاکیزه", "سوریا", "نازدانه", "شمیم", "ماجبین", "هیله", 
    "آزاده", "زر افشان", "منصوره", "لایقه", "ستوری", "حماسه", "سیمین", "ریتا", "حاجره", "نیک بخت", "حوریه", "دیوه", "غزال", "فرحت", "نازی", "فایقه", "بی بی زهرا", "سمینه", "ام البنین", "رقیبه", "پری گل", "ساغر", "ممتاز", "نفس گل", "پیمانه", "حوا", "بسمینه", 
    "فروهر", 
    "ملیکه", "ریزه گل", "زرینه", "معروفه", "صبریه", "ربابه", "صفورا", "اورانوس", "تورپیکی", "مشعل", "بی بی عایشه", "اقلیما", "علینا", "لیذا", "شغله", "روما", "مونیکا", "سبزه گل", "محموده", "الاهه", "روح افزا", "بی بی زینب", "بی بی هوا", "صنم", "مقبوله", "لاله", 
    "شمایل", "جینا", "انگیزه", "فریضه", "مشتری", "حسنی", "لیلماه", "پشتنه", "صبرینا", "سمانه", "راکیه", "قمرگل", "روبینه", "زاهده", "میناگل", "سیاموی", "آریا", "ندیمه", "رنگینه", "نورزیه", "روشن", "هایده", "شهیره", "نیلا", "سونیلا", "شیرین گل", "ذلیخا", "شاه گل", "بی بی 
    آمنه", "بینظیر", "سینا", "قدریه", "هاجر", "صبرگل", "شایقه", "نورضیا", "پری", "حامده", "عذرا", "مقدسه", "بس بی بی", "بی بی خدیجه", "بشیره", "گل جان", "ریکا", "شهزاده", "بختاور", "گلشن", "نعیمه", "شاهده", "عزیزگل", "کیمیا", "واحده", "محسنه", "انیلا", "بی بی 
    حوا", "صوفیا", "ثمرگل", "قندی گل", "گل چهره", "محدثه", "تانیا", "یگانه", "استوری", "امیده", "پریگل", "دنیا", "ژیلا", "ریسه", "کبری", "گل افروز", "عتیقه", "مروارید", "مومینه", "صایمه", "عفیفه", "ارغوان", "بشرا", "جاهده", "ثنا", "سیتا", "عطیه", "فروغ", "شراره", 
    "فریال", "فرهناز", "نوشین", "شرین گل", "اسیه", "زینت", "ماهره", "عالمه", "قمر", "الهامه", "بس گل", "بی بی حلیمه", "زلفیه", "طوبی", "مبارکه", "آرین", "پریما", "کوثر", "اصفه", "نظیره", "سیده", "زرینا", "زکیه", "ولوله", "رنا", "منوره", "نازو", "نیکبخت", "بهار", 
    "غزاله", 
    "نسترن", "فرنگیس", "شیرین", "فرضیه", "ماه جان", "حوا گل", "صنوبر", "اسماء", "زهل", "سوریه", "سومیه", "نجما", "پتونی", "زیباگل", "قندیگل", "مدیحه", "ناظمه", "حافظه", "لیما", "سنبل", "شاپیری", "جیلا", "مزاری", "وجهیه", "ازیتا", "بی بی خاطره", "گل اندام", 
    "ناصره", "شیوا", "صاحبه", "کوکبه", "نیلم", "بسگل", "بی بی هاجره", "لامعه", "بهناز", "بی بی رابعه", "رشیده", "روزیتا", "رومینا", "زمزمه", "شرمیلا", "صیفوره", "کبیتا", "منیکا", "نازگل", "ندا", "خالصه", "مقدس", "بریشنا", "بی بی ساره", "تمکین", "منیلا", "بی بی جان", 
    "نسرین گل", "اندیشه", "سایمه", "عاصمه", "مرحبا", "سیلی", "گل بخت", "بتول", "بی بی فرشته", "زویا", "مانیلا", "مسیحه", "نایله", "روشن گل", "صحرا", "نرجس", "نگیتا", "بی بی تمنا", "بی بی مدینه", "خماری", "نورضیه", "ختیمه", "هادیه", "گل غوتی", "گل مکی", "سمین گل", 
    "بی بی رقیه", "عظیمه", "وینوس", "سویدا", "میسره", "حنا", "رضوانه", "ملیه", "بی بی رحیمه", "حفصه", "شاه پیری", "گلدسته", "مهاجره", "بی بی اسما", "روضیه", "سیاره", "شقایق", "عاتکه", "نتاشه", "پرنیان", "راحیله", "روزینا", "گل بی بی", "جواهر", "خاتول", 
    "ریحان", 
    "زینوره", "سنیه", "صوفیه", "رخساره", "ناظره", "بی بی شکریه", "بی بی نظیفه", "پشتون", "شمینه", "فروه", "نگین", "گل افشان", "نجوا", "هلینا", "باصره", "بسیمه", "بی بی زهره", "خالیده", "ریما", "سمیره", "شرین", "نور بی بی", "هوگی", "وږمه", "خیرالنسا", "گل 
    مینه", 
    "بانو", "رینا", "زرین", "گل پری", "مبینه", "نزاکت", "بی بی مرسل", "پیکی", "توبا", "سعادت", "یولدوز", "بی بی ذکیه", "سمیعه", "شیما گل", "افسون", "بوبانی", "صمیمه", "عهدیه", "گل چمن", "گل غتی", "مملکت", "وسیله", "ماه رخ", "نغمه", "بی بی خالده", "بی بی راضیه", "بی بی 
    سمیرا", "عاطیفه", "فرح", "کتایون", "ازاده", "تجلا", "سبزه", "فایضه", "مرغلره", "مونیسه", "بی بی حنیفه", "بی بی صدیقه", "بی بی کریمه", "بی بی نرگس", "صفرا", "مهوش", "نورجهان", "انار گل", "بی بی صالحه", "بی بی نوریه", "بیگم", "ثمیرا", "رئیسه", "کامیله", 
    "شرافت", "عیدیه", "گلناز", "مرمر", "نقیبه", "سنگی ماه", "فروزه", "الینا", "بی بی شبنم", "راشده", "کاینات", "گل بیگم", "مجاهده", "هاشمه", "بی بی صفیه", "بی بی فهیمه", "زیاده", "زیب النسا", "سیماه", "شمشاد", "شمیمه", "فدیه", "فرح دیبا", "لیلی ماه", "بی بی مسعوده", "بی 
    بی نسیمه", "نجمیه", "ولیه", "برگ گل", "بی بی وحیده", "روبابه", "زیتون", "صبیه", "عایده", "عزرا", "غوتی", "مکی", "یما", "اوستا", "شیماه", "کلثوم", "گل شاه", "آدینه", "بی بی صابره", "بی بی مرضیه", "بی بی معصومه", "پرمینه", "ترانه", "جاویده", "زیتونه", "شاه پری", 
    "ضیا 
    گل", "فلورانس", "محبه", "نورینه", "بی بی عاطفه", "ذبیحه", "سامره", "شکرانه", "صادقه", "صفا", "فاخره", "فرینا", "فریه", "فهمیه", "گل بهار", "مکیه", "مهرانگیز", "تازه گل", "رویا گل", "علیا", "غزل", "فرخ لقا", "گوهر", "محفوظه", "مرضیلا", "بنین", "بی بی حمیده", "بی 
    بی شبانه", "بی بی شریفه", "بی بی فوزیه", "بی بی کامله", "بی بی نازیه", "پروین گل", "زرین گل", "سبزینه", "عبیده", "قطبیه", "منور", "نازی گل", "نورجان", "هانیه", "افغان گل", "انجلا", "بی بی راحله", "بی بی فریده", "بی بی نادیه", "سمن", "مهر افزون", "بسیه", "بی بی 
    آرزو", "حریره", "درخشان", "زرفشان", "سبنا", "سپنا", "سیمین گل", "فرح ناز", "الناز", "بی بی عادله", "بی بی ناجیه", "چمن گل", "روحیه", "شهیلا", "گلثومه", "مهشید", "بی بی بصیره", "بی بی حسینه", "رافعه", "زهراه", "سپیده", "سمیلا", "شیدا", "ضیاء گل", "فرنوش", "ماه گل", 
    "مروه", "مهری", "مهسا", "میده گل", "نارون", "هوا گل", "بی بی عالیه", "بی بی ناز", "سما", "فائزه", "کبریا", "گل نسا", "مجیبه", "ملیلا", "نیره", "هوا", "بی بی پروانه", "بی بی حاجره", "بی بی حمیرا", "بی بی شگوفه", "بی بی عزیزه", "ذکریه", "رودابه", "شهیده", "لامیه", 
    "نزیره", "یسنا", "بادام گل", "بلقیسه", "رامشه", "سلگی", "عاقیله", "فضه", "کشور", "مرغلی", "نازیتا", "نگار", "واحیده", "آریانا", "بی بی سعیده", "بی بی سلیمه", "بی بی فرزانه", "بی بی مروه", "بی بی نفیسه", "راکعه", "سالمه", "سمینا", "فرنگیز", "فیروزان", "قدیره", 
    "مسلیمه", 
    "مطهره", "ورانگه", "اریا", "بی بی انیسه", "بی بی سکینه", "بی بی لطیفه", "بی بی ملیحه", "زرگی", "زرنگار", "زهراء", "سیما گل", "عقیله", "فاضیله", "فرهنگیز", "مرغوبه", "نادیا", "نازله", "بی بی سعدیه", "بی بی طیبه", "سبیکه", "فیضه", "گل پیدا", "معشوقه", "نرگیس", 
    "بدریه", "بی بی امنه", "بی بی جمیله", "بی بی زیبا", "زمرد", "شافعه", "گلدانه", "محبت", "هویدا", "بی بی شازیه", "بی بی فریبا", "حامیه", "خال بی بی", "سحرگل", "شاه بی بی", "شمین", "عظمی", "گلشاه", "گوزل", "محسینه", "نودا", "بس مینه", "بی بی آمینه", "بی بی 
    حبیبه", "بی بی فیروزه", "بی بی کبرا", "پرسیلا", "پروینه", "دل افروز", "سامیه", "شاه جان", "فرانگیز", "گل دسته", "گلچهره", "معظمه", "ادیبا", "بی بی سارا", "بی بی شفیقه", "بی بی طاهره", "بی بی عابده", "بی بی لینا", "جلوه", "ذحل", "رامینا", "شامله", "شکیباه", "شهره", 
    "فرخ", 
    "کیمیا گل", "گرانه", "مدیه", "منظوره", "میمونه", "نسیبه", "انیسگل", "بسینا", "بی بی منیژه", "بی بی نبیلا", "پریناز", "پریوش", "تمینه", "ثویبه", "حدیقه", "رومان", "زیور", "شمله", "گلنار", "ماه پری", "معرفه", "موجوده", "نسیم گل", "بی بی آسیه", "بی بی سمیه", "رزماه", 
    "زربی بی", "سپوږمی", "صغری", "فلک ناز", "قاهره", "گل زیور", "لاجورد", "منیجه", "همیشه گل", "بی بی امینه", "بی بی ظریفه", "بی بی نجیبه", "بی بی نگینه", "بی بی هما", "دانش", "رامیکا", "سنیتا", "سهلا", "شکیلاه", "شمیسا", "گلستان", "مایله", "مکرمه", "بومانه", "بی 
    بی 
    زحل", "بی بی صدف", "ثمینه", "شمسی", "گل ناز", "مرزیلا", "ناهده", "اسرا", "امیلا", "برنا", "تاجور", "رضوان", "رعناگل", "گلسوم", "مرحمه", "ولایت", "بی بی حسنا", "بی بی حکیمه", "بی بی ریحانه", "بی بی مژگان", "بی بی یلدا", "خیریه", "رحمانه", "صبرینه", "غنچه 
    گل", "فریباه", "مبارک", "محاربه", "انسیه", "بی بی ثریا", "بی بی مژده", "بی بی ملکه", "پلواشه", "چمن", "روشنا", "روفه", "سویلا", "شاعره", "صائمه", "طاوس", "گل سیمه", "گیسو", "ماه بیگم", "منزه", "ندیما", "المیرا", "انایتا", "بی بی زرمینه", "بی بی ناهیده", "پری ناز", 
    "جلیله", "جهانتاب", "ذلفیه", "زهر اگل", "ساناز", "سدره", "سلوا");

    /**
     * @source Afghanistan Kankor (University Entrance Exam) 2003-2017 data.
     * The data collected, preprocessed and prepared by Abdul Rahman Sherzad (absherzad@gmail.com).
     * @license: Creative Commons Attribution-ShareAlike License
    */
    protected static $lastName = array("احمدی", "محمدی", "نوری", "رحیمی", "امیری", "حیدری", "عزیزی", "صدیقی", "حسینی", "نظری", "کریمی", "رحمانی", "هاشمی", "سادات", "رسولی", "صافی", "شریفی", "اکبری", "حمیدی", "فیضی", "حبیبی", "یوسفی", "سلطانی", "حکیمی", "سروری", "ابراهیمی", 
    "عظیمی", "امینی", "نیازی", "احمدزی", "مرادی", "ناصری", "قادری", "عمری", "نبی زاده", "شیرزاد", "غفوری", "همدرد", "یعقوبی", "رضایی", "ایوبی", "عثمانی", "علی زاده", "انوری", "سعیدی", "فقیری", "صمدی", "واحدی", "قاسمی", "افضلی", "حسنی", "رضائی", 
    "فضلی", "سعادت", "وفا", "جعفری", "شیرزی", "محمودی", "سخی زاده", "عابد", "ولی زاده", "موسوی", "قریشی", "سیدی", "صالحی", "روفی", "همت", "طاهری", "ستانکزی", "قیومی", "امانی", "نادری", "احدی", "عطائی", "بارکزی", "کوهستانی", "یوسفزی", "عالمی", 
    "نعیمی", "صادقی", "رشیدی", "انصاری", "جلالی", "حسن زاده", "غلامی", "الکوزی", "کاکر", "ساحل", "امین", "هوتک", "عطایی", "رحمانی", "دانش", "ملک زاده", "شمس", "پوپل", "عادل", "خلیلی", "افغان", "ابراهیم خیل", "مهمند", "کاظمی", "مومند", "نظامی", "مجیدی", 
    "حقیار", "جویا", "زاهد", "وزیری", "خالقی", "عباسی", "منگل", "فروتن", "اسلمی", "غفاری", "تیموری", "خیرخواه", "خاکسار", "شینواری", "زمانی", "امرخیل", "حلیمی", "نیکزاد", "نوابی", "صابری", "محسنی", "غیاثی", "لطیفی", "قربانی", "صفری", "میرزاده", "صمیم", 
    "قاضی زاده", "نورزی", "اعظمی", "حقمل", "سکندری", "ظاهری", "میاخیل", "اکرمی", "رجبی", "میرزایی", "وردک", "منصوری", "حاجی زاده", "علیزاده", "صالح", "سیرت", "احسان", "میرزائی", "سلیمی", "نصرت", "بهادری", "بخشی", "حنیفی", "فقیرزاده", "حفیظی", 
    "تنها", "فرهمند", "نوروزی", "مجددی", "صاحب زاده", "مایار", "نسیمی", "عارفی", "اسدی", "درویش", "بشردوست", "اوریاخیل", "الهام", "صمیمی", "صادق", "سهاک", "سیفی", "راسخ", "رستمی", "توخی", "عصمتی", "ظریفی", "ظفری", "غنی زاده", "حسین زاده", 
    "سیدزاده", 
    "حقانی", "ذکی", "روحانی", "جلیلی", "صوفی زاده", "عبیدی", "معصومی", "جمشیدی", "خواجه زاده", "مبارز", "خیری", "صفدری", "بیات", "محبی", "خاوری", "عمرخیل", "قاری زاده", "جامی", "میرزاد", "کبیری", "وردک", "لودین", "شکوری", "غوثی", "حبیب", 
    "مخلص", 
    "الفت", "شهاب", "بهرامی", "خالقیار", "ستاری", "حسین خیل", "یوسف زی", "فخری", "ضیائی", "علوی", "جبارخیل", "امید", "نورزاد", "امامی", "نذیری", "جمال", "عرفان", "مقصودی", "نقشبندی", "نیک زاد", "دلسوز", "نصیری", "دوست", "بهار", "احساس", "فاروقی", 
    "اصغری", "صبوری", "عبادی", "عزیز", "پیمان", "عرب", "اختری", "عاشوری", "ایماق", "وحدت", "ضیایی", "همراز", "پارسا", "شمسی", "حقجو", "مظفری", "درانی", "غزنوی", "احسانی", "حضرتی", "نجفی", "احمدیار", "نور", "بهزاد", "ثاقب", "بابکرخیل", "سحر", 
    "عابدی", "شاهی", "جمالی", "زهیر", "فیاض", "براتی", "طوطاخیل", "عمر", "نعمتی", "شاهین", "جلال", "حیران", "شفق", "فیروزی", "آرین", "عرب زاده", "پویا", "دولت زی", "سروش", "مجاهد", "شاداب", "محبوبی", "برهانی", "دانشجو", "ولیزاده", "ضیا", "هجران", 
    "عرفانی", "قلندری", "مشعل", "سدید", "حلیم", "فروغ", "زاهدی", "اخلاقی", "جباری", "خادم", "رضای", "سلیمانی", "عیار", "همکار", "افشار", "تلاش", "رسا", "میری", "شجاعی", "صابر", "اتل", "توکلی", "قدیری", "ولی", "مددی", "اشرفی", "حیات", "سهرابی", "بختیار", 
    "خرمی", "محبت", "کمال", "حیاتی", "مولوی زاده", "پوپل زی", "حبیب زاده", "قانع", "کامران", "شاکر", "گوهری", "محرابی", "شجاع", "مسعود", "صفا", "عمرزی", "بختیاری", "علمی", "شیرزاده", "نورستانی", "زیارمل", "نورزائی", "پوپلزی", "صدیق", "مشفق", 
    "اخندزاده", 
    "اندر", "مرزائی", "دانشیار", "حسن", "خرم", "حمید", "حکمت", "صداقت", "ادیب", "اعظیمی", "یونسی", "امان", "ارمانی", "حسین", "سجادی", "فرملی", "وطن دوست", "سلیمان خیل", "ابدالی", "مسلم", "عبدالله", "یارزاده", "اوریا", "سمسور", "مسعودی", "نصرتی", "اسحق 
    زی", "اسماعیلی", "درویشی", "یاری", "خاموش", "سخی", "هدایت", "سعید", "خپلواک", "نورانی", "حنفی", "جلالزی", "علمیار", "فایز", "مظلوم یار", "محمدزی", "قمبری", "نوید", "سراج", "داودزی", "نجرابی", "همنوا", "سمندری", "منصور", "هادی", "بارک", "حسن زی", 
    "پروانی", "ترین", "حق پرست", "حق یار", "فایق", "پاینده", "خیراندیش", "فیض", "ندیم", "عارف", "عسکری", "ملاخیل", "انتظار", "متین", "بصیری", "صالح زاده", "عادلی", "عظمی", "کمالی", "هوتکی", "فطرت", "کوهی", "وهاب زاده", "استانکزی", "بهیر", "یاوری", 
    "سیلاب", "لعلی", "همراه", "وکیلی", "بیک زاد", "شرافت", "عاطف", "فدایی", "مفتون", "احراری", "فرحت", "رفعت", "آصفی", "پناهی", "راشد", "احمد", "امیرزاده", "حامدی", "صاحبی", "محبوب", "ملکزاده", "هوشمند", "رمضانی", "گلستانی", "آخندزاده", "ملکزی", 
    "رازقی", 
    "فهیم", "یاسینی", "آریا", "رحمی", "سباوون", "بیکزاد", "عزیزیار", "نجیبی", "حاحی", "حدران", "جاوید", "حق جو", "ارین", "حبیب زی", "میرزای", "جوادی", "ارمان", "شاهد", "فرهادی", "فدائی", "شریف", "شهزاد", "علی خیل", "مومن زاده", "باقری", "سعادات", 
    "سعدی", "تسل", "روشن", "فاضل", "فاضلی", "نثار", "اقبال", "داودی", "زرمتی", "جوینده", "ناظری", "ترابی", "شایق", "بلخی", "طوفان", "امیرزی", "خسروی", "وصال", "قدوسی", "مهدوی", "مهربان", "ذاکری", "ریحان", "شفیق", "رحیم زی", "علیمی", "معروف", 
    "بسمل", "حکیم زاده", "فرهاد", "مرزایی", "مسلم یار", "شهابی", "جاهد", "خوشحال", "حنیف", "شکیب", "تره کی", "سنگین", "نورزاده", "نیکمل", "میرخیل", "ظهیر", "مموزی", "تابش", "خلیل", "داوری", "فرهنگ", "وحیدی", "بره کی", "معصوم", "مهدی", "حیدر", "هلال", 
    "حیدرزاده", "مسرور", "رنجبر", "سرحدی", "قبادی", "سید", "نایل", "جواد", "خروتی", "نجمی", "امین زاده", "بیگزاد", "صدری", "ظاهر", "مجروح", "یادگاری", "واثق", "بشیری", "خالد", "عالمیار", "بهروز", "لیوال", "متقی", "باختری", "توحیدی", "رضوانی", "دقیق", 
    "کارگر", "اسماعیل زاده", "ساجد", "سخا", "ایازی", "بلوچ", "سجاد", "علیزی", "کوچی", "لطفی", "مصلح", "منیب", "رضوی", "اصفی", "حامد", "قیام", "وهاب", "حق مل", "حکمی", "سالارزی", "موسی زی", "محب زاده", "مهری", "باوری", "بها", "پردیس", "خادمی", 
    "جهانی", "دوستی", "برهان", "بیک زاده", "قیامی", "مراد", "دلاور", "زلمی", "مهرزاد", "محب", "فایض", "فضل", "وقار", "وکیل زاده", "اکبرزاده", "رفیعی", "رفیقی", "مندوزی", "پشتون", "سرفراز", "سلجوقی", "الماس", "جمیلی", "سبحانی", "صیاد", "نایبی", "باور", "خواجه", 
    "رحمت", "چکری", "قاریزاده", "نبوی", "روزی", "شیدا", "مقبل", "سهیل", "ظفر", "گلزار", "دولتی", "سراجی", "علم", "نورزایی", "بارز", "دلاوری", "ذهین", "خان", "صبری", "فیضان", "مختار", "موحد", "اعتمادی", "بوستانی", "خان زاده", "مومنی", "پیکار", "علی زی", 
    "خطیبی", "بهرام", "علی", "عنایت", "فدا", "واعظی", "شاکری", "عمرزاده", "سیدخیلی", "قرلق", "کاشفی", "اسلامی", "بشرمل", "اخلاص", "بشارت", "عصمت", "قلم یار", "رمزی", "شیرزوی", "ضمیری", "نیک زاده", "ربانی", "سرداری", "ظریف", "فیروز", "نیازمند", 
    "آزاد", 
    "جیلانی", "سلیم", "غیرت", "فراهی", "بیدار", "زیوری", "عبید", "فریادی", "کوهدامنی", "نجیب", "یزدانی", "احمدزاده", "بیک", "لشکری", "محمد", "مختاری", "اسحاق زی", "جلال زی", "ظهوری", "متوکل", "مشتاق", "بهادر", "دورانی", "عمران", "هروی", "الیاسی", 
    "بهاوی", "حصاری", "صاحبزاده", "ملک زی", "نایاب", "ارشاد", "رحمنی", "عبدی", "همدم", "بابری", "رشاد", "عاطفی", "حاتمی", "عینی", "مومن", "پکتیاوال", "رزاقی", "مصباح", "همتی", "امیر", "برومند", "رحیم", "رستگار", "رفیع", "منوری", "جمال زاده", "حسامی", 
    "ارغندیوال", "آرمان", "پیکان", "حلاند", "خیرزاده", "ذاهد", "روان", "روشان", "زیرک", "عبدالهی", "مسجدی", "اریا", "خانزاده", "وفادار", "پیرزاده", "سیار", "مصدق", "تاجیک", "سرابی", "عزتی", "معروفی", "ملکی", "نجات", "اخگر", "بریالی", "دانش یار", "فقیریار", 
    "کتوازی", "ناصر", "خوگیانی", "فهیمی", "اندرابی", "شیخ زاده", "مروت", "معراج", "حسام", "حسن یار", "رسول", "سخیزاده", "غنی", "احمد زی", "عطای", "کیهان", "اقبالی", "امیدی", "حق بین", "غوری", "فرزام", "هلالی", "خلوتی", "رحمت زاده", "میوند", "واحدیار", 
    "وثیق", 
    "ثابت", "سفری", "وفایی", "حافظی", "حکمتی", "ساپی", "محسن", "نجاتی", "امین زی", "سالک", "سلامی", "سنگر", "مودودی", "حقبین", "کمال زاده", "گردیزی", "اچکزی", "اریوبی", "تاج", "ذاکر", "صبور", "نبی", "احمدي", "ایثار", "حقیقی", "حکیم", "سرور", "آرزو", 
    "بشری", "شریف زاده", "شهیر", "فرزان", "کریم", "محمود", "نثاری", "تراب", "قمری", "جوهری", "سهار", "علی یار", "نایب خیل", "هوفیانی", "بنیادی", "شهبازی", "نبیل", "سلطان", "سلطان زاده", "شباب", "شمال", "عاجز", "علم یار", "علی پور", "مطهری", "نیک مل", 
    "اسکندری", "شهیدی", "عیسی زاده", "مرزای", "مصطفی", "بارکزائی", "بهبودی", "خاورین", "سیغانی", "شهباز", "فیصل", "هاشیمی", "حسرت", "رشید", "رضا", "زمان", "شنواری", "عاصم", "عسکرزاده", "فیاضی", "گلزاد", "منیر", "اصیل", "افغانیار", "فقیرزی", 
    "ابراهیم", 
    "امانیار", "بیان", "عدیل", "الله یار", "راحل", "سلیمان", "ماهر", "نظیری", "ابراهمی", "توفیق", "ثمر", "رامین", "رضوان", "ساعی", "شفایی", "شهزاده", "مدبر", "وفائی", "اسد", "الیاس", "جویان", "خیرخوا", "سامع", "کیانی", "ابراهیم زاده", "حماس", "درمان", "طارق", 
    "قتالی", "یاور", "بیگی", "حمیدزاده", "محقق", "محمدي", "نشاط", "نعمانی", "حازم", "خدادادی", "فولادی", "گوهر", "ملنگ", "موسی زاده", "نجم", "هارونی", "اشنا", "حقدوست", "رستم زاده", "روف", "زمری", "عرب زی", "عطا", "حداد", "حساس", "حمدی", "رجب زاده", 
    "لنگری", "نجیمی", "بیانی", "تنی", "حق دوست", "خوشیوال", "دلدار", "دیدار", "سالنگی", "شایان", "قانت", "نزهت", "امین یار", "حبیب یار", "دشتی", "سلیمانخیل", "سمندر", "قلندر", "گیلانی", "میرزا", "نصری", "نظیمی", "وهاج", "یولداش", "بینوا", "توانا", "خالق یار", 
    "شهیدزاده", "فرزاد", "مبشر", "بیگ", "بیگ زاد", "روحی", "شادان", "کاظیمی", "مدثر", "اکرامی", "الطاف", "تبسم", "سنگری", "شرف", "ممتاز", "یارمل", "ارباب زاده", "افضل", "اعلمی", "افتخاری", "پیروز", "شفائی", "شیوا", "غوربندی", "غیور", "مشال", "یوسف زاده", 
    "اتمر", 
    "باتوری", "حافظ", "رفیق", "صادقیار", "طیب", "قانونی", "مهر", "هویدا", "خوستی", "رحمن", "رحیم زاده", "عتیق", "غریب یار", "میرزازاده", "اسحق زاده", "برنا", "رامکی", "سالمی", "ستومان", "عثمان", "مایل", "محمدزاده", "مرزاخیل", "ناصح", "وطن یار", "اختیاری", 
    "آشنا", "امام زاده", "باهر", "بیگ زاده", "حسنیار", "رهین", "سهیم");

    protected static $titleMale = array('آقای', 'استاد', 'دکتر', 'دوکتور', 'داکتر', 'مهندس', 'انجنیر');
    protected static $titleFemale = array('خانم', 'استاد', 'دکتر', 'دوکتورس', 'داکترس', 'مهندس', 'انجنیر');
}
