<?php

namespace Faker\Provider\fa_AF;

class Person extends \Faker\Provider\Person
{
    /**
     * @example 'عبدالرحمن شیرزاد'
     * @example 'مهندس عبدالرحمن شیرزاد'
     * @example 'انجنیر عبدالرحمن شیرزاد'
     * @example 'داکتر عبدالرحمن شیرزاد'
     * @example 'آقای عبدالرحمن شیرزاد'
     */
    protected static $maleNameFormats = array(
        '{{firstNameMale}} {{lastName}}',
        '{{titleMale}} {{firstNameMale}} {{lastName}}',
    );

    /**
     * @example 'فرشته احمدی'
     * @example 'خانم فرشته احمدی'
     * @example 'مهندس فرشته احمدی'
     * @example 'داکترس فرشته احمدی'
     */
    protected static $femaleNameFormats = array(
        '{{firstNameFemale}} {{lastName}}',
        '{{titleFemale}} {{firstNameFemale}} {{lastName}}',
    );

    /**
     * @source Afghanistan Kankor (University Entrance Exam) 2003-2017 data.
     * The data collected, preprocessed and prepared by Abdul Rahman Sherzad (absherzad@gmail.com).
     * @link https://sites.google.com/view/absherzad/male-names
     * @license: Creative Commons Attribution-ShareAlike License
     */
    protected static $firstNameMale = array(
        "اباسین", "ابراهیم", "ابوبکر", "ابوذر", "اجمل", "احمد", "اخترمحمد", "ادریس", "ارسلان", "ارشاد", "اسحق", "اسدالله", "اسلام الدین", "اسماعیل", "اشرف", "اقبال", "اکبر", "اکمل", "الله داد", "الماس", "الهام", "الیاس",
        "آرش", "آصف", "آغامحمد",
        "بازمحمد", "باقر", "برکت الله", "برهان الدین", "بریالی", "بسم الله", "بشیر احمد", "بصیراحمد", "بکتاش", "بلال", "بهرام", "بهروز", "بیژن",
        "پاینده محمد", "پرویز", "پیرمحمد", "پیمان",
        "تاج الدین", "تاج محمد", "تقی", "تمیم", "توریالی", "توفیق", "تیمور شاه",
        "ثمرالدین", "ثناءالله",
        "جان آغا", "جان محمد", "جاوید", "جعفر", "جلال الدین", "جلیل احمد", "جمال الدین", "جمال ناصر", "جمشید", "جمعه خان", "جمعه گل", "جمیل", "جنت گل", "جواد",
        "حارث", "حامد", "حبیب الرحمن", "حبیب الله", "حسام الدین", "حسن", "حسیب الله", "حسین", "حشمت الله", "حفیظ الله", "حکمت الله", "حکیم الله", "حمید", "حنیف", "حیات الله",
        "خالد", "خان آغا", "خان محمد", "خداداد", "خسرو", "خلیل احمد", "خوشحال خان", "خیبر", "خیرالله", "خیرمحمد",
        "داود", "در محمد", "دل آغا", "دلاور", "دوست محمد", "دین محمد",
        "ذاکر حسین", "ذاکرالله", "ذبیح الله", "ذکریا", "ذکی الله", "ذین الله",
        "رازمحمد", "راشد", "رامش", "رامین", "ربیع الله", "رجب علی", "رحمت الله", "رستم", "روح الله",
        "زاهد", "زبیر", "زلمی", "زمان", "زمری", "زیارمل", "زین الدین", "زین الله",
        "ساحل",
        "شاپور", "شاداب", "شاکر", "شاکرالله", "شاه ولی", "شاهدالله", "شاهین", "شیراحمد", "شیرآغا", "شیرخان", "شیرزاد", "شیرمحمد",
        "صابر", "صادق", "صالح محمد", "صبغت الله", "صدام", "صفی الله", "صلاح الدین", "صمیم",
        "ضیاءالحق", "ضیاالدین", "ضیاالرحمن",
        "طارق", "طاهر", "طوفان",
        "ظاهر شاه", "ظاهر", "ظفر خان",
        "عارف", "عاشق الله", "عبادالله", "عباس", "عبدالاحد", "عبدالاحمد", "عبدالباری", "عبدالباسط", "عبدالباقی", "عبدالتواب", "عبدالجبار", "عبدالجمیل", "عبدالحق", "عبدالحکیم", "عبدالحلیم", "عبدالحمید", "عبدالحی", "عبدالخالق", "عبدالرازق", "عبدالرحمن", "عبدالستار", "عبدالسلام", "عبدالوحید",
        "غلام حسن", "غلام حسین", "غلام حضرت", "غلام حیدر", "غلام ربانی", "غلام رسول", "غلام رضا", "غلام سخی", "غلام سرور", "غلام صدیق", "غلام عباس", "غلام علی", "غلام فاروق", "غلام مجتبی", "غلام محمد", "غلام محی الدین", "غلام مرتضی", "غلام مصطفی", "غلام نبی", "غلام یحیی", "غلام یحیی", "غوث الدین", "غیاث الدین",
        "فرامرز", "فردوس", "فردین", "فرزاد", "فرشاد", "فرشید", "فرمان الله", "فرهاد", "فرید", "فریداحمد", "فریدون", "فضل احمد", "فضل الحق", "فضل الرحمن", "فضل الرحیم", "فضل الله", "فضل محمد", "فهیم الله", "فهیم",
        "قاسم", "قدرت الله", "قربان علی", "قربان علی", "قربان", "قطب الدین", "قمرالدین", "قند آغا", "قندآغا", "قیام الدین", "قیس",
        "کاظم", "کامران", "کرامت الله", "کریم الله", "کریم", "کفایت الله", "کلیم الله", "کمال الدین",
        "گل احمد", "گل الرحمن", "گل آغا", "گل آغا", "گل رحمن", "گل محمد", "گل ولی", "گلاب الدین", "گلبدالدین", "گلبدین",
        "لطف الرحمن", "لطف الله", "لطیف الله", "لعل محمد", "لیاقت",
        "مبارز", "مبارک شاه", "مجاهد", "مجتبی", "مجیب الرحمن", "مجیب الله", "محب الرحمن", "محب الله", "محبوب", "محراب الدین", "محسن", "میرویس", "میلاد",
        "نادر شاه", "ناصر", "نبی الله", "نثار احمد", "نجم الدین", "نجیب الله", "نذیراحمد", "نسیم", "نصرالله", "نصرت الله", "نصیب الله", "نصیر احمد", "نصیراحمد", "نصیرالله", "نظام الدین", "نظر محمد", "نعمان",
        "هادی", "هارون", "هدایت الله", "هلال", "همایون", "هیواد",
        "وحید احمد", "وحید", "وزیر احمد", "وسیم", "وکیل احمد", "ولی خان", "ولی محمد", "ولید", "ویس",
        "یار محمد", "یاسر", "یاسین", "یحیی", "یما", "یوسف", "یونس"
    );

    /**
     * @source Afghanistan Kankor (University Entrance Exam) 2003-2017 data.
     * The data collected, preprocessed and prepared by Abdul Rahman Sherzad (absherzad@gmail.com).
     * @link https://sites.google.com/view/absherzad/female-names
     * @license: Creative Commons Attribution-ShareAlike License
     */
    protected static $firstNameFemale = array(
        "اسرا", "اسماء", "اصیلا", "افسانه", "افسون", "المیرا", "الناز", "الهه", "انیتا", "انیلا", "اورانوس",
        "آرزو", "آریانا", "آزاده", "آزیتا", "آسیه", "آصفه", "آمنه",
        "بصیره", "بلقیس", "بنفشه", "بهار", "بهاره", "بهشته", "بهناز", "بیگم",
        "پاکیزه", "پرستو", "پرسیلا", "پرمیلا", "پروانه", "پروین", "پری", "پریسا", "پری گل", "پریما", "پریناز", "پلوشه",
        "تاجور", "تازه گل", "تانیا", "تبسم", "تجلا", "ترانه", "تمنا", "تورپیکی",
        "ثریا", "ثمرگل", "ثمیرا", "ثمینه", "ثویبه",
        "جاهده", "جاویده", "جلیله", "جمیله",
        "چمن گل", "چمن",
        "حاجره", "حبیبه", "حسنا", "حسینه", "حفیظه", "حکیمه", "حلیمه", "حمیده", "حمیرا", "حنا", "حنیفه", "حوا", "حوریه",
        "خاتمه", "خاطره", "خالده", "خجسته", "خدیجه", "خماری", "خورشید", "خوشبو",
        "درخشان", "دنیا", "دیانا", "دیبا", "دینا",
        "ذاکره", "ذکیه", "ذلفیه", "ذلیخا",
        "رابعه", "راحله", "راضیه", "رزما", "رعنا", "رقیه", "روحینا", "روما", "رومینا", "رونا", "رویا", "ریحانه",
        "زرغونه", "زرفشان", "زرلشت", "زلیخا", "زهرا", "زهره", "زویا", "زیبا", "زینب", "زینت",
        "ژیلا",
        "ساجده", "ساغر", "ساناز", "سبزه گل", "سبنا", "سپنا", "سپوژمی", "سپیده", "سحر", "سعیده", "سکینه", "سودابه", "سوریه", "سوسن", "سونیا", "سونیتا", "سویتا", "سیما گل", "سیمین",
        "شاه گل", "شاهده", "شایسته", "شایقه", "شبانه", "شبنم", "شراره", "شرمیلا", "شریفه", "شرین گل", "شفیقه", "شقایق", "شکریه", "شکوفه", "شکیبا", "شکیلا", "شگوفه", "شمیم", "شهره", "شهزاده", "شهلا", "شهناز", "شیرین", "شیلا", "شیما", "شیوا",
        "صابره", "صدف", "صدیقه", "صغرا", "صفا", "صفورا", "صنم", "صنوبر",
        "ضمیره", "ضیا گل", "ضیاء گل", "ضیاگل",
        "طاهره", "طاوس", "طوبی", "طیبه",
        "ظاهره", "ظریفه",
        "عابده", "عادله", "عارفه", "عاطفه", "عایشه", "عزیز گل", "عزیزه",
        "غزال", "غزاله", "غزل", "غنچه گل",
        "فاخره", "فاضله", "فاطمه", "فتانه", "فرح", "فرحت", "فرحناز", "فرخ لقا", "فرخ", "فرخنده", "فردینا", "فرزانه", "فرشته", "فوزیه", "فیروزه",
        "قاهره", "قدریه", "قدسیه", "قدیره", "قطبیه", "قمر", "قمرگل", "قندی گل",
        "کتایون", "کرشمه", "کریمه", "کلثوم", "کوثر", "کوکبه", "کیمیا",
        "گل چهره", "گل دسته", "گل ناز", "گلالی", "گلثوم", "گلچهره", "گوهر", "گیتی", "گیسو",
        "لاله", "لایقه", "لطیفه", "لیدا", "لیلا", "لیلما", "لیلی", "لیمه", "لینا",
        "ماریا", "مارینا", "ماه رخ", "ماه گل", "محبوبه", "محجوبه", "مرجان", "مرسل", "ملالی", "ملکه", "منیره", "منیژه", "منیکا", "منیلا", "مهاجره", "مهتاب", "مهرانگیز", "مهری", "مهسا", "مهشید", "مهناز", "مهوش", "مونیکا", "میترا", "مینا",
        "ناجیه", "نادیه", "نازگل", "نازنین", "ناهید", "نجلا", "نجیبه", "نجیلا", "ندا", "ندیمه", "نرگس", "نسترن", "نسرین", "نغمه", "نفس گل", "نفیسه", "نگار", "نوریه", "نوشین", "نیلا", "نیلاب", "نیلوفر",
        "هاجره", "هادیه", "هانیه", "هایده", "هدیه", "هلینا", "هما", "همیشه گل", "هنگامه", "هوا", "هویدا",
        "وجیهه", "وحیده", "وژمه", "ولوله", "ویدا", "وینوس",
        "یاسمین", "یسنا", "یگانه", "یلدا"
    );

    /**
     * @source Afghanistan Kankor (University Entrance Exam) 2003-2017 data.
     * The data collected, preprocessed and prepared by Abdul Rahman Sherzad (absherzad@gmail.com).
     * @link https://sites.google.com/view/absherzad/family-names
     * @license: Creative Commons Attribution-ShareAlike License
     */
    protected static $lastName = array(
        "ابدالی", "ابراهیمی", "اتمر", "اچکزی", "احراری", "احساس", "احمدی", "اختیاری", "اخلاقی", "آخندزاده", "ادیب", "ارباب زاده", "آرزو", "افضلی", "افغان", "الکوزی", "الهام", "امانی", "امیری", "امین زاده", "امینی", "انصاری", "انوری", "ایازی", "ایثار", "ایماق", "ایوبی",
        "بابری", "بارز", "برومند", "بشارت", "بشردوست", "بشرمل", "بلخی", "بلوچ", "بهادری", "بهرامی", "بیات", "بیدار", "بینوا",
        "پارسا", "پاینده", "پناهی", "پوپل زی", "پویا", "پیروز", "پیکار", "پیمان",
        "تابش", "تاجیک", "ترابی","تلاش", "تنها", "توانا", "توحیدی", "توخی", "توکلی", "تیموری",
        "ثابت", "ثاقب", "ثمر",
        "جامی", "جاهد", "جاوید", "جعفری", "جلالی", "جلیلی", "جمال زاده", "جمشیدی", "جوادی", "جوهری", "جویا", "جوینده",
        "چکری",
        "حاتمی", "حاجی زاده", "حافظ", "حامدی", "حبیب زاده", "حبیبی", "حساس", "حسن زاده", "حسین زاده", "حقجو", "حقدوست", "حقیقی", "حمیدی", "حنیفی", "حیدری",
        "خادم", "خاکسار", "خاموش", "خاوری", "خرمی", "خسروی", "خطیبی", "خلیلی", "خواجه زاده", "خیراندیش", "خیرخوا", "خیرخواه", "خیرزاده",
        "دانشیار", "درانی", "درمان", "دلاوری",
        "ذاکر", "ذاکری",
        "راحل", "رازقی", "راسخ", "رامکی", "ربانی", "رجب زاده", "رحمانی", "رحیمی", "رزاقی", "رستگار", "رستمی", "رسولی", "رشیدی", "رضایی", "رضوی", "رفعت", "رنجبر", "رهین",
        "زاهد", "زاهدی", "زرمتی", "زلمی", "زمان", "زمانی", "زمری", "زهیر", "زیارمل", "زیرک", "زیوری",
        "ساحل", "سادات", "ساعی", "سباوون", "سجادی", "سخا", "سخیزاده", "سروری", "سروش", "سعادت", "سعدی", "سعیدی", "سکندری", "سلجوقی", "سلطان زاده", "سیفی",
        "شاداب", "شریفی", "شفیق", "شکوری", "شهابی", "شهیدزاده", "شهیر", "شیخ زاده", "شیرزاد", "شینواری",
        "صابری", "صادقی", "صافی", "صالح زاده", "صالحی", "صدیقی", "صفدری", "صوفی زاده",
        "ضمیری", "ضیا", "ضیایی",
        "طاهری", "طوطاخیل",
        "ظاهری", "ظریفی", "ظهیر",
        "عاجز", "عادل", "عارفی", "عاطفی", "عرب زاده", "عرفانی", "عزیزی", "عسکرزاده", "عصمتی", "عطایی", "عظیمی",
        "غریب یار", "غزنوی", "غفاری", "غفوری", "غنی زاده", "غیاثی", "غیور",
        "فاروقی", "فاضلی", "فایض", "فراهی", "فرهمند", "فرهنگ", "فروتن", "فروغ", "فقیری", "فولادی", "فیضی",
        "قادری", "قاری زاده", "قاریزاده", "قاسمی", "قاضی زاده", "قانع", "قانونی", "قتالی", "قربانی", "قریشی", "قیامی", "قیومی",
        "کارگر", "کاشفی", "کاظمی", "کاکر", "کوهستانی", "کوهی", "کیانی", "کیهان",
        "گردیزی", "گلزاد", "گلزار", "گلستانی", "گوهر", "گوهری", "گیلانی",
        "لشکری", "لطفی", "لطیفی", "لودین",
        "ماهر", "مایار", "مبارز", "مبشر", "متقی", "متین", "مجاهد", "مجددی", "مجروح", "مجیدی", "محبوبی", "محرابی", "محسنی", "محقق", "محمدی", "مخلص", "مسرور", "مشعل", "مصباح", "مصدق",
        "نادری", "ناصح", "ناصری", "ناظری", "نایاب", "نبی زاده", "نجرابی", "نجفی", "نزهت", "نظامی", "نظری", "نعمانی", "نوابی", "نورزایی", "نورستانی", "نیازی", "نیکزاد",
        "هادی", "هارونی", "هاشمی", "هاشیمی", "هجران", "هدایت", "هروی", "همدرد", "همراز", "هوتکی", "هوشمند",
        "واحدی", "واعظی", "وحدت", "وحیدی", "وطن دوست", "وهاب زاده",
        "یارمل", "یاری", "یاوری", "یزدانی", "یعقوبی", "یوسف زاده", "یوسفی"
    );

    protected static $titleMale = array('آقای', 'استاد', 'دکتر', 'دوکتور', 'داکتر', 'مهندس', 'انجنیر');
    protected static $titleFemale = array('خانم', 'استاد', 'دکتر', 'دوکتورس', 'داکترس', 'مهندس', 'انجنیر');
}
