<?php

namespace Faker\Provider\uk_UA;

/**
 * Class Lorem
 *
 * @category Classes
 * @package  Faker\Provider\uk_UA
 * @author   Volodymr Kornilov <mail@terion.name>
 * @license  MIT http://opensource.org/licenses/MIT
 * @link     http://terion.name
 */
class Lorem extends \Faker\Provider\Lorem
{
    protected static $wordList = array(
        'але', 'щоб', 'ви', 'зрозуміли', 'звідки', 'виникає', 'це', 'хибне', 'уявлення', 'людей',
        'лихословники', 'насолоду', 'і', 'вихваляють', 'я', 'розкрию', 'перед', 'вами',
        'всю', 'картину', 'роз\'ясню', 'що', 'саме', 'говорив', 'цей', 'чоловік', 'який', 'відкрив',
        'істину', 'якого', 'б', 'назвав', 'зодчим', 'щасливого', 'життя', 'дійсно', 'ніхто', 'не',
        'відкидає', 'зневажає', 'уникає', 'насолод', 'тільки', 'через', 'те', 'насолоди', 'лише', 'тих',
        'хто', 'вміє', 'розумно', 'віддаватися', 'насолодам', 'осягають', 'великі', 'так', 'само', 'як',
        'немає', 'нікого', 'полюбив', 'би', 'зволів', 'зажадав', 'за', 'а', 'тому', 'інший', 'раз',
        'виникають', 'такі', 'обставини', 'коли', 'приносять', 'якесь', 'чималу', 'якщо', 'скористатися',
        'найпростішим', 'прикладом', 'то', 'з', 'нас', 'став', 'займатися', 'якими', 'було', 'тяжкими',
        'фізичними', 'вправами', 'якби', 'приносило', 'собою', 'якоїсь', 'користі', 'міг', 'по', 'справедливості',
        'дорікнути', 'прагнучого', 'до', 'яке', 'несло', 'ніяких', 'неприємностей', 'або', 'того', 'уникав',
        'такого', 'ніякої'
    );
}