<?php

namespace Faker\Provider\uk_UA;

class Person extends \Faker\Provider\Person
{
    protected static $maleNameFormats = array(
        '{{firstNameMale}} {{middleNameMale}} {{lastName}}',
        '{{lastName}} {{firstNameMale}} {{middleNameMale}}',
    );

    protected static $femaleNameFormats = array(
        '{{lastName}} {{firstNameFemale}} {{middleNameFemale}}',
        '{{firstNameFemale}} {{middleNameFemale}} {{lastName}}',
    );

    protected static $firstNameMale = array(
        'Андрій', 'Арсен', 'Арсеній', 'Артем', 'Артур', 'Богдан', 'Вадим', 'Василь', 'Віктор', 
        'Віталій', 'Владислав', 'Володимир', 'Давид',  'Данило', 'Дем\'ян', 'Денис', 'Дмитро', 'Євген', 'Захар', 'Іван', 'Ігор', 
        'Ілля', 'Лук\'ян', 'Любомир', 'Максим', 'Маркіян', 'Марко', 'Мар\'ян', 'Матвій', 'Микола', 'Михайло', 'Назар', 'Назарій', 
        'Олег', 'Олександр', 'Олексій', 'Остап', 'Павло', 'Роман', 'Ростислав', 'Руслан', 'Святослав', 'Сергій', 'Станіслав', 
        'Степан', 'Тарас', 'Тимофій', 'Юрій', 'Ярослав'
    );

    protected static $firstNameFemale = array(
        'Аліна', 'Анастасія', 'Ангеліна', 'Андріана', 'Анна', 'Валерія', 'Василина', 'Вероніка', 
        'Вікторія', 'Віра', 'Діана', 'Евеліна', 'Єва', 'Єлизавета', 'Злата', 'Іванна', 'Ілона', 'Ірина', 'Каріна', 
        'Кароліна', 'Катерина', 'Лілія', 'Маргарита', 'Марія', 'Марта', 'Мар\'яна', 'Мілана', 'Надія', 'Наталія', 'Оксана', 
        'Олександра', 'Олена', 'Олеся', 'Ольга', 'Поліна', 'Роксолана', 'Соломія', 'Софія', 'Тетяна', 'Уляна', 'Христина', 
        'Юліана', 'Юлія', 'Юстина', 'Яна', 'Ярина'
    );

    protected static $middleNameMale = array(
        'Андрійович', 'Арсенович', 'Артемович', 'Артурович', 'Богданович', 'Вадимович', 'Васильович', 
        'Вікторович', 'Віталійович', 'Владиславович', 'Володимирович', 'Давидович', 'Данилович', 'Дем\'янович', 'Денисович', 
        'Дмитроович', 'Євгенович', 'Захарович', 'Іванович', 'Ігорович', 'Лук\'янович', 'Любомирович', 'Максимович', 'Маркіянович', 
        'Маркоович', 'Мар\'янович', 'Матвійович', 'Миколаович', 'Михайлоович', 'Назарович', 'Назарійович', 'Олегович', 
        'Олександрович', 'Олексійович', 'Остапович', 'Павлоович', 'Романович', 'Ростиславович', 'Русланович', 'Святославович', 
        'Сергійович', 'Станіславович', 'Степанович', 'Тарасович', 'Тимофійович', 'Юрійович', 'Ярославович'
    );

    protected static $middleNameFemale = array(
        'Андріївна', 'Арсеніївна', 'Артемівна', 'Артурівна', 'Богданівна', 'Вадимівна', 'Василівна', 
        'Вікторівна', 'Віталіївна', 'Владиславівна', 'Володимирівна', 'Давидівна', 'Данилівна', 'Дем\'янівна', 
        'Денисівна', 'Дмитрівна', 'Євгенівна', 'Захарівна', 'Іванівна', 'Ігорівна', 'Лук\'янівна', 'Любомирівна', 'Максимівна', 
        'Маркіянівна', 'Марківна', 'Мар\'янівна', 'Матвіївна', 'Миколаівна', 'Михайлівна', 'Назарівна', 'Назаріївна', 'Олегівна', 
        'Олександрівна', 'Олексіївна', 'Остапівна', 'Павлівна', 'Романівна', 'Ростиславівна', 'Русланівна', 'Святославівна', 
        'Сергіївна', 'Станіславівна', 'Степанівна', 'Тарасівна', 'Тимофіївна', 'Юріївна', 'Ярославівна'
    );

    protected static $lastName = array(
        'Мельник', 'Шевченко', 'Бойко', 'Коваленко', 'Бондаренко', 'Ткаченко', 'Ковальчук', 
        'Кравченко', 'Олійник', 'Шевчук', 'Коваль', 'Поліщук', 'Бондар', 'Ткачук', 'Мороз', 'Марченко', 'Лисенко', 
        'Руденко', 'Савченко', 'Петренко', 'Кравчук', 'Клименко', 'Павленко', 'Савчук', 'Кузьменко', 'Швець', 
        'Гаврилюк', 'Харченко', 'Пономаренко', 'Мельничук', 'Василенко', 'Мазур', 'Хоменко', 'Левченко', 'Карпенко', 
        'Кушнір', 'Сидоренко', 'Романюк', 'Мартинюк', 'Коломієць', 'Павлюк', 'Ткач', 'Литвиненко', 'Панченко', 'Костенко', 
        'Кулик', 'Кравець', 'Юрченко', 'Білоус', 'Дяченко', 'Семенюк', 'Костюк', 'Гуменюк', 'Вовк', 'Гончаренко', 'Яковенко', 
        'Романенко', 'Приходько', 'Козак', 'Ковтун', 'Назаренко', 'Пилипенко', 'Гончар', 'Іщенко', 'Федоренко', 'Гончарук', 
        'Нестеренко', 'Колісник', 'Демченко', 'Терещенко', 'Тищенко', 'Бабенко', 'Попович', 'Тарасенко', 'Макаренко', 
        'Марчук', 'Москаленко', 'Зінченко', 'Яценко', 'Жук', 'Литвин', 'Герасименко', 'Кириченко', 'Колесник', 'Міщенко', 
        'Тимошенко', 'Фоп', 'Паламарчук', 'Власенко', 'Шаповал', 'Бондарчук', 'Луценко', 'Кондратюк', 'Антонюк'
    );

    /**
     * Return male middle name
     *
     * @example 'Іванович'
     *
     * @access public
     *
     * @return string Middle name
     */
    public function middleNameMale()
    {
        return static::randomElement(static::$middleNameMale);
    }
    
    /**
     * Return female middle name
     *
     * @example 'Іванівна'
     *
     * @access public
     *
     * @return string Middle name
     */
    public function middleNameFemale()
    {
        return static::randomElement(static::$middleNameFemale);
    }
}
