<?php

namespace Faker\Provider\ps_AF;

class Person extends \Faker\Provider\Person
{
    protected static $maleNameFormats = array(
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{titleMale}} {{firstNameMale}} {{lastName}}',
    );

    protected static $femaleNameFormats = array(
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{titleFemale}} {{firstNameFemale}} {{lastName}}',
    );

    /**
     * @link http://www.paktika1.com/?page_id=1520
     */
    protected static $firstNameMale = array(
       'اټک','اختر','اجمل','اوښتون','اتل','انگار','اميل خان','ايمل','انځور','اباسين','ازمون','ارمان','اند','اڅک','انځرگل','اوڅار',
       'ببری','بختور','بېټ','باتور','بهادر','بری','باز گل','باز','برمل','بڅرکى','بريالی','بهير','پامير','پروټ','پسرلی','پېزوان',
       'پاچا','پردېس','پتيال','پتنگ','پښتون','پاڅون','پتمن','پرتمین','پولاد','پیاوړی','پيوستون','پټان','پېوند','تاند','تکل','توريال',
       'تړون','توريالی','تازه گل','چمبېلى','چمتو','چنار',
       'چارگل','څاروان','څرک','څپاند','څرگند','څراغ','ځونډی','ځلاند','ځير','ځيگر','ځواک','ځيږ','ځيرک','خوشال','خپلواک','خوځښت','خيال',
       'خاورين','خيبر','خندان','خوازک','دريا خان','دريځ','روښان','رښتين','رنگين','روان','ريدی','ژړک','ژوند','ژوندون','زمری','زمريالی',
       'زمرک','زرغون','زړگی','زيار','زېړگل','زلمی','زغرد','زړور','زيارمل','زېرى','زرين','ستوری','سپېلنی','سلېمان','سمسور','سوبمن','سمندر',
       'سهارگل','سمون','سحر','سيلاب','سيلان','سباوون','سپين غر','سورگل','سرتور','سيال','سپېڅلى','سپين گل','سورغر','شپون','شمشاد','شپونکی',
       'شين گل','ښاد','ښادمن','ښالم','ښايسته خان','غاټول','غروال','غبرگون','غازي','غورځنگ','غرغښت','غيرت','غرنى','غرزی','غمی','غښتلی',
       'غشى','کاروان','کليوال','کشمالی','كنيشكا','کروړ','كوچى','گټيالی','گړندی','گلالی','گلاب','گران','گلبڼ','گهيځ','گلورين','لونگين','لېوال',
       'لرغون','لونگ','لمر','لالی','لمرڅرک','ماکو','مړوند','مېوند','مېړنی','ملنگ','مين','مينه گل','مينه ناک','مينه پال','ميرويس','منگول','مټور',
       'منلی','مرغلين','مخکښ','ننگ','ننگيالی','نوښت','نوميالی','نښتر','ولسمل','ودان','وياړ','وياړمن','ويال','ورين','واکمن','هېواد','هاند',
       'هوډ','هوډمن','يون','يرغل','يما'
    );

    /**
     * @link http://www.paktika1.com/?page_id=1520
     */
    protected static $firstNameFemale = array(
       'اوږۍ','اوښکه','اناره','اورنۍ','اورځلا','اشرفۍ','بدرۍ','برېښنا','ببرۍ','بېديا','بلبله','بخمله','بسوگله','بڼکه','بختوره',
       'پتمنه','پرخه','پلوشه','پرتمينه','پاولينه','پسته','پستکۍ','پښتنه','پاڼه','پانگه','پرخه','پتاسه','پېروزه','تلوسه','تورپيکۍ',
       'تالنده','تمامه','تاتره','توتکۍ','تانده','تنکۍ','څپه','څانگه','ځلانده','ځلبله','ځلا','ځولۍ','خزانه','خياله','خوږه','خندا','خولگۍ',
       'خوماره','خيال مينه','خيبره','درخانۍ','درانۍ','درخو','دولته','ډېوه','ډالۍ','رڼا','راڼۍ','روښانه','روهيله','روهيلۍ','ژمنه','ژېړکه',
       'زرغونه','زاڼه','زرلښته','زردانه','زرپاڼه','زرينه','زرمينه','زرڅانگه','زرکه','زربخته','سارا','سارکه','سارمکۍ','سارمه','سپرغۍ',
       'سوله','سپينه','سنځله','سپوږمۍ','سوریا','سېلۍ','شانداره','شغله','شمله','شاترينه','شامسته','شامتوره','شربت گله','شين خالۍ','شينکۍ',
       'شيرينو','شېبه','ښايسته','ښارو','ښکلا','ښاپيرۍ','غونډۍ','غورځکه','غرنۍ','غونچه','غاړه كۍ','غوټۍ','غرڅنۍ','غاټوله','کوچۍ','کليواله',
       'کيږدۍ','کوکۍ','کوتره','گلبشره','ګل غوټۍ','گرانه','گل اندامه','گلبدنه','گل لمنه','گوربته','گل څېره','گېډۍ','گل څانگه','گورگره','گلپاڼه',
       'گلورينه','گل مکۍ','گلالۍ','لښته','للمه','لېمه','لونگينه','لمبه','لونگه','ليندۍ','مېړنۍ','ملالۍ','موسکا','مينه','موماڼه','ميمونه','ململه',
       'مالداره','مرغلره','مکۍ','مڼه','مېلمنه','ملاله','مسته','ملنگه','مرغۍ','نازو','نتکۍ','نغمه','نېکمرغه','ننداره','نينه','نېکبخته','نيازمنه',
       'واورينه','وږمه','ولوله','وياړمنه','وړانگه','ورېښمينه','هوسۍ','هوسا','هسکه','هوا','هيله','هيلۍ','سلگۍ','سياله','سپېڅلې','سايره','سندره'
    );

    /**
     * @link http://benawa.com/web_stuff/nomoona.php
     */
    protected static $lastName = array(
        'سپين غر','سيلاب','سیلان','سپين','سمون','سحر','سباوون','سپين غر','سيلاب','شپون','شالون','شرنګ','شپونکی','شين ګل','ښادمن','ښالم',
        'ښايسته خان','غروال','غبرګون','غازي','غورځنګ','غرغښت','غټئ','غيرت','غرنئ','غرزی','غمی','غښتلی','غشئ','کاڼی','کليوال','کړوخيل',
        'کروړ','ګټيالی','ګړندی','ګل','ګلالی','ګلبت','ګلاب','ګران','ګلبڼ','ګهيځ','ګلورين','لونګين','ليوال','لرغون','لونګ','لمر','لالی','لايق',
        'لمرڅرک','مړوند','مېوند','مېړنی','ملنګ','مين','مينه ګل','مينه ناک','مينه پال','ميرويس','منګول','مټور','منلی','مرغلين','مخکښ','مروړ',
        'ننګ','ننګيالی','نوښت','نوميالی','نښتر','ناوړګۍ','ودان','وياړ','وياړمن','وريځ','ويال','ورين','واکمن','هيواد','هاند','هار','هلمند','يون',
        'يرغل','سورګل','سرتور','سردار','سيال','سپېڅلئ','سپين ګل','سورغر','نوښت','نوميالی','نښتر','ناوړګۍ','ودان','وياړ','وياړمن','وريځ','ويال',
        'ورين','واکمن','هيواد','هاند','هار','هلمند','يون','يرغل','سورګل','سرتور','سردار','سيال','سپېڅلئ','سپين ګل','سورغر','شپنه','شغله',
        'شرنګو','شمله','شاترينه','شاتره','شامسته','شربت ګله','شين خالۍ','شينکۍ','شيرينو','شېبه','ښکلا','ښاپيرۍ','ښاديزی','ښايسته','طوطانه',
        'غونډۍ','غورځکه','غرنۍ','غنچه','غاړه ګۍ','غوټۍ','غرڅنۍ','غاټول','کبلۍ','کوچۍ','کاکۍ','کليواله','کيږدۍ','کوکۍ','کوتره','کراره','ګلدسته',
        'ګلبشره','ګلپيغله','ګرانه','ګل څانګه','ګل بدنه','ګل لمنه','ګلانه','ګوربته','ګل خندا','ګل څېره','ګېډۍ','ګل څېره','ګورګره','ګلڅوکه','ګلپاڼه',
        'ګل مکۍ','ګلالۍ','ګل پري','لښته','للمه','لېمه','لونګينه','لايقه','لمبه','ليندۍ','مېړنۍ','ملالۍ','موسکا','ميمه','موماڼه','مشکه','مرغابۍ',
        'ميمونه','ململه','مينه','مالداره','مرغلره','مکۍ','مڼه','مېلمنه','ملاله','ملايئکه','مسته','ملنګه','مرغۍ','نازو','نته','نتکۍ','نرګس','نکريزه',
        'نغمه','نيکمرغه','ننداره','نينه','نيکبخته','نارئ','نيازمنه','واوره','وريځ','واورينه','وږمه','ولوله','ويدا','وړانګه','وريشمينه','وړه',
        'ولمه','وښکاله','هوسۍ','هوسا','هسکه','هوا','هيله','هيلۍ','سلګۍ','سېلۍ','سپلنۍ','سياله','سپېڅلې','سايره','سندره'
    );

    protected static $titleMale = array('ښاغلی', 'ښوونکی', 'ډاکټر', 'مهندس','انجینیر');
    protected static $titleFemale = array('میرمن', 'ښوونکې', 'ډاکټره', 'مهندس');
}
