<?php

namespace Faker\Provider\ps_AF;

class Text extends \Faker\Provider\Text
{
    /**
     * generates text string in Pashto
     *
     * @example 'په جمله کې ټاکندویه عناصر کېدای شي چې صفت وي، مضاف وي یا شمېر نوم'
     * @param  integer                   $maxNbChars
     * @param  integer                   $indexSize
     * @return string
     * @throws \InvalidArgumentException
     */
    public function realText($maxNbChars = 200, $indexSize = 2)
    {
        if ($maxNbChars < 10) {
            throw new \InvalidArgumentException('maxNbChars must be at least 10');
        }

        if ($indexSize < 1) {
            throw new \InvalidArgumentException('indexSize must be at least 1');
        }

        if ($indexSize > 5) {
            throw new \InvalidArgumentException('indexSize must be at most 5');
        }

        $words = $this->getConsecutiveWords($indexSize);
        $result = array();
        $resultLength = 0;
        // take a random starting point
        $next = static::randomKey($words);
        while ($resultLength < $maxNbChars && isset($words[$next])) {
            // fetch a random word to append
            $word = static::randomElement($words[$next]);

            // calculate next index
            $currentWords = explode(' ', $next);

            $currentWords[] = $word;
            array_shift($currentWords);
            $next = implode(' ', $currentWords);

            if ($resultLength == 0 && !preg_match('/^[\x{0600}-\x{06FF}]/u', $word)) {
                continue;
            }
            // append the element
            $result[] = $word;
            $resultLength += strlen($word) + 1;
        }

        // remove the element that caused the text to overflow
        array_pop($result);

        // build result
        $result = implode(' ', $result);

        return $result.'.';
    }

    /**
     * License: Creative Commons Attribution-ShareAlike License
     *
     * Language: Pashto
     *
     * @see https://www.bbc.co.uk/academy/ps/articles/art20131031113816478
     * @var string
     */
    protected static $baseText = <<<EOD

    په جمله کې ټاکندویه عناصر کېدای شي چې صفت وي، مضاف وي یا شمېر نوم اسم عدد.

    ددغو عناصرو پرله پسې والی په بېلگو کې
    
    یوه تور هلک يوه سپينه نجلۍ وليده.
    
    دوه پېړو او پلونډو هلکانو دوې ښکلې نرۍ او نازکې نجونې تر کوره بدرگه کړې.
    
    د يوه سر ښوونکي زوی د يوه ښوونکي زوی وستایه. 
    
    تېر لس کلن کورني جنگ زموږ ډېر ښکلی هېواد افغانستان وران ويجاړ کړ.
    
    د زيات پوهاوي په موخه د کره او ناکره فقرو او جملو دالاندې ليکلړ د پام وړ دی
    
    خو  د دویمې ښاري څانگې خلاف، په بېړنۍ لومړنۍ مرستې کې شمېر نوم لومړنۍ تر بیړنۍ وروسته او تر مرستې دمخه راځي،
    
     ځکه چې دا له مرستې سره يو گډ مفهوم  جوړوي. د د اضافت توری چې په ځینو ځایونو کې حتمي دی، په ځینو نورو کې غورځي، لکه په دې بېلگو کې
    
    کابل ښار، کابل ښاروال، کابل ښاروالي، کابل ولايت، کابل پوهنتون، ننگرهار پوهنتون.
    
    دلیل یې دادی چې دلته کابل یا په ورته ډول بل کارېدلی ټکی د صفت په څېر پر يوه ټاکندوی  اوړي. 
    
    ژبني او لږو ډېر ټبرني نومونه بيا ټو ل له ورپسې نومونو سره بې د اضافي فقره جوړوي، لکه
    
    پښتو ژبه، پښتو ټولنه، پښتو ادب يا اردو، هندي، انگرېزي، جرمني،
    
     مومند ټبر، هزاره ټبر، وزبک ټبر، تاجيک ټبر، بلوڅ ټبر، پښتون ولس، افغان ولس.افغان طالبان، افغان طالبانو. هم نوی دود موندلی دی. 
    
    په جمله کې ټاکندویه عناصر کېدای شي چې صفت وي، مضاف وي یا شمېر نوم اسم عدد.
    
    ددغو عناصرو پرله پسې والی په بېلگو کې
    
    یوه تور هلک يوه سپينه نجلۍ وليده.
    
    دوه پېړو او پلونډو هلکانو دوې ښکلې نرۍ او نازکې نجونې تر کوره بدرگه کړې.
    
    د يوه سر ښوونکي زوی د يوه ښوونکي زوی وستایه. 
    
    تېر لس کلن کورني جنگ زموږ ډېر ښکلی هېواد افغانستان وران ويجاړ کړ.
    
    د زيات پوهاوي په موخه د کره او ناکره فقرو او جملو دالاندې ليکلړ د پام وړ دی
    
    خو  د دویمې ښاري څانگې خلاف،
    
    په بېړنۍ لومړنۍ مرستې کې شمېر نوم لومړنۍ تر بیړنۍ وروسته او تر مرستې دمخه راځي، ځکه چې دا له مرستې سره يو گډ مفهوم  جوړوي.
    
    د د اضافت توری چې په ځینو ځایونو کې حتمي دی، په ځینو نورو کې غورځي، لکه په دې بېلگو کې
    
    کابل ښار، کابل ښاروال، کابل ښاروالي، کابل ولايت، کابل پوهنتون، ننگرهار پوهنتون.
    
    دلیل یې دادی چې دلته کابل یا په ورته ډول بل کارېدلی ټکی د صفت په څېر پر يوه ټاکندوی  اوړي. 
    
    ژبني او لږو ډېر ټبرني نومونه بيا ټو ل له ورپسې نومونو سره بې د اضافي فقره جوړوي، لکه
    
    پښتو ژبه، پښتو ټولنه، پښتو ادب يا اردو، هندي، انگرېزي،
    
    جرمني،مومند ټبر، هزاره ټبر، وزبک ټبر، تاجيک ټبر، بلوڅ ټبر، پښتون ولس، افغان ولس.افغان طالبان، افغان طالبانو. هم نوی دود موندلی دی. 
    
    په جمله کې ټاکندویه عناصر کېدای شي چې صفت وي، مضاف وي یا شمېر نوم اسم عدد.

    ددغو عناصرو پرله پسې والی په بېلگو کې
    
    یوه تور هلک يوه سپينه نجلۍ وليده.
    
    دوه پېړو او پلونډو هلکانو دوې ښکلې نرۍ او نازکې نجونې تر کوره بدرگه کړې.
    
    د يوه سر ښوونکي زوی د يوه ښوونکي زوی وستایه. 
    
    تېر لس کلن کورني جنگ زموږ ډېر ښکلی هېواد افغانستان وران ويجاړ کړ.
    
    د زيات پوهاوي په موخه د کره او ناکره فقرو او جملو دالاندې ليکلړ د پام وړ دی
    
    خو  د دویمې ښاري څانگې خلاف،
    
    په بېړنۍ لومړنۍ مرستې کې شمېر نوم لومړنۍ تر بیړنۍ وروسته او تر مرستې دمخه راځي، ځکه چې دا له مرستې سره يو گډ مفهوم  جوړوي.
    
    د د اضافت توری چې په ځینو ځایونو کې حتمي دی، په ځینو نورو کې غورځي، لکه په دې بېلگو کې
    
    کابل ښار، کابل ښاروال، کابل ښاروالي، کابل ولايت، کابل پوهنتون، ننگرهار پوهنتون.
    
    دلیل یې دادی چې دلته کابل یا په ورته ډول بل کارېدلی ټکی د صفت په څېر پر يوه ټاکندوی  اوړي. 
    
    ژبني او لږو ډېر ټبرني نومونه بيا ټو ل له ورپسې نومونو سره بې د اضافي فقره جوړوي، لکه
    
    پښتو ژبه، پښتو ټولنه، پښتو ادب يا اردو، هندي، انگرېزي،
    
    جرمني،مومند ټبر، هزاره ټبر، وزبک ټبر، تاجيک ټبر، بلوڅ ټبر، پښتون ولس، افغان ولس.افغان طالبان، افغان طالبانو. هم نوی دود موندلی دی. 
    
    په جمله کې ټاکندویه عناصر کېدای شي چې صفت وي، مضاف وي یا شمېر نوم اسم عدد.
    
    ددغو عناصرو پرله پسې والی په بېلگو کې
    
    یوه تور هلک يوه سپينه نجلۍ وليده.
    
    دوه پېړو او پلونډو هلکانو دوې ښکلې نرۍ او نازکې نجونې تر کوره بدرگه کړې.
    
    د يوه سر ښوونکي زوی د يوه ښوونکي زوی وستایه. 
    
    تېر لس کلن کورني جنگ زموږ ډېر ښکلی هېواد افغانستان وران ويجاړ کړ.
    
    د زيات پوهاوي په موخه د کره او ناکره فقرو او جملو دالاندې ليکلړ د پام وړ دی
    
    خو  د دویمې ښاري څانگې خلاف،
    
    په بېړنۍ لومړنۍ مرستې کې شمېر نوم لومړنۍ تر بیړنۍ وروسته او تر مرستې دمخه راځي، ځکه چې دا له مرستې سره يو گډ مفهوم  جوړوي.
    
    د د اضافت توری چې په ځینو ځایونو کې حتمي دی، په ځینو نورو کې غورځي، لکه په دې بېلگو کې
    
    کابل ښار، کابل ښاروال، کابل ښاروالي، کابل ولايت، کابل پوهنتون، ننگرهار پوهنتون.
    
    دلیل یې دادی چې دلته کابل یا په ورته ډول بل کارېدلی ټکی د صفت په څېر پر يوه ټاکندوی  اوړي. 
    
    ژبني او لږو ډېر ټبرني نومونه بيا ټو ل له ورپسې نومونو سره بې د اضافي فقره جوړوي، لکه
    
    پښتو ژبه، پښتو ټولنه، پښتو ادب يا اردو، هندي، انگرېزي،
    
    جرمني،مومند ټبر، هزاره ټبر، وزبک ټبر، تاجيک ټبر، بلوڅ ټبر، پښتون ولس، افغان ولس.افغان طالبان، افغان طالبانو. هم نوی دود موندلی دی. 
    
    په جمله کې ټاکندویه عناصر کېدای شي چې صفت وي، مضاف وي یا شمېر نوم اسم عدد.

    ددغو عناصرو پرله پسې والی په بېلگو کې
    
    یوه تور هلک يوه سپينه نجلۍ وليده.
    
    دوه پېړو او پلونډو هلکانو دوې ښکلې نرۍ او نازکې نجونې تر کوره بدرگه کړې.
    
    د يوه سر ښوونکي زوی د يوه ښوونکي زوی وستایه. 
    
    تېر لس کلن کورني جنگ زموږ ډېر ښکلی هېواد افغانستان وران ويجاړ کړ.
    
    د زيات پوهاوي په موخه د کره او ناکره فقرو او جملو دالاندې ليکلړ د پام وړ دی
    
    خو  د دویمې ښاري څانگې خلاف،
    
    په بېړنۍ لومړنۍ مرستې کې شمېر نوم لومړنۍ تر بیړنۍ وروسته او تر مرستې دمخه راځي، ځکه چې دا له مرستې سره يو گډ مفهوم  جوړوي.
    
    د د اضافت توری چې په ځینو ځایونو کې حتمي دی، په ځینو نورو کې غورځي، لکه په دې بېلگو کې
    
    کابل ښار، کابل ښاروال، کابل ښاروالي، کابل ولايت، کابل پوهنتون، ننگرهار پوهنتون.
    
    دلیل یې دادی چې دلته کابل یا په ورته ډول بل کارېدلی ټکی د صفت په څېر پر يوه ټاکندوی  اوړي. 
    
    ژبني او لږو ډېر ټبرني نومونه بيا ټو ل له ورپسې نومونو سره بې د اضافي فقره جوړوي، لکه
    
    پښتو ژبه، پښتو ټولنه، پښتو ادب يا اردو، هندي، انگرېزي،
    
    جرمني،مومند ټبر، هزاره ټبر، وزبک ټبر، تاجيک ټبر، بلوڅ ټبر، پښتون ولس، افغان ولس.افغان طالبان، افغان طالبانو. هم نوی دود موندلی دی. 
    
    په جمله کې ټاکندویه عناصر کېدای شي چې صفت وي، مضاف وي یا شمېر نوم اسم عدد.
    
    ددغو عناصرو پرله پسې والی په بېلگو کې
    
    یوه تور هلک يوه سپينه نجلۍ وليده.
    
    دوه پېړو او پلونډو هلکانو دوې ښکلې نرۍ او نازکې نجونې تر کوره بدرگه کړې.
    
    د يوه سر ښوونکي زوی د يوه ښوونکي زوی وستایه. 
    
    تېر لس کلن کورني جنگ زموږ ډېر ښکلی هېواد افغانستان وران ويجاړ کړ.
    
    د زيات پوهاوي په موخه د کره او ناکره فقرو او جملو دالاندې ليکلړ د پام وړ دی
    
    خو  د دویمې ښاري څانگې خلاف،
    
    په بېړنۍ لومړنۍ مرستې کې شمېر نوم لومړنۍ تر بیړنۍ وروسته او تر مرستې دمخه راځي، ځکه چې دا له مرستې سره يو گډ مفهوم  جوړوي.
    
    د د اضافت توری چې په ځینو ځایونو کې حتمي دی، په ځینو نورو کې غورځي، لکه په دې بېلگو کې
    
    کابل ښار، کابل ښاروال، کابل ښاروالي، کابل ولايت، کابل پوهنتون، ننگرهار پوهنتون.
    
    دلیل یې دادی چې دلته کابل یا په ورته ډول بل کارېدلی ټکی د صفت په څېر پر يوه ټاکندوی  اوړي. 
    
    ژبني او لږو ډېر ټبرني نومونه بيا ټو ل له ورپسې نومونو سره بې د اضافي فقره جوړوي، لکه
    
    پښتو ژبه، پښتو ټولنه، پښتو ادب يا اردو، هندي، انگرېزي،
    
    جرمني،مومند ټبر، هزاره ټبر، وزبک ټبر، تاجيک ټبر، بلوڅ ټبر، پښتون ولس، افغان ولس.افغان طالبان، افغان طالبانو. هم نوی دود موندلی دی. 
EOD;
}
