<?php

namespace Faker\Provider\ps_AF;

class Text extends \Faker\Provider\Text
{
    /**
     * generates text string in Pashto
     *
     * @example 'په جمله کې ټاکندویه عناصر کېدای شي چې صفت وي، مضاف وي یا شمېر نوم'
     * @param  integer                   $maxNbChars
     * @param  integer                   $indexSize
     * @return string
     * @throws \InvalidArgumentException
     */
    public function realText($maxNbChars = 200, $indexSize = 2)
    {
        if ($maxNbChars < 10) {
            throw new \InvalidArgumentException('maxNbChars must be at least 10');
        }

        if ($indexSize < 1) {
            throw new \InvalidArgumentException('indexSize must be at least 1');
        }

        if ($indexSize > 5) {
            throw new \InvalidArgumentException('indexSize must be at most 5');
        }

        $words = $this->getConsecutiveWords($indexSize);
        $result = array();
        $resultLength = 0;
        // take a random starting point
        $next = static::randomKey($words);
        while ($resultLength < $maxNbChars && isset($words[$next])) {
            // fetch a random word to append
            $word = static::randomElement($words[$next]);

            // calculate next index
            $currentWords = explode(' ', $next);

            $currentWords[] = $word;
            array_shift($currentWords);
            $next = implode(' ', $currentWords);

            if ($resultLength == 0 && !preg_match('/^[\x{0600}-\x{06FF}]/u', $word)) {
                continue;
            }
            // append the element
            $result[] = $word;
            $resultLength += strlen($word) + 1;
        }

        // remove the element that caused the text to overflow
        array_pop($result);

        // build result
        $result = implode(' ', $result);

        return $result.'.';
    }

    /**
     * License: Creative Commons Attribution-ShareAlike License
     *
     * Language: Pashto
     *
     * @see https://github.com/mohbadar/pashto-text-dataset
     * @var string
     */
    protected static $baseText = <<<EOD

داساسي قانون خبره او دانور چي سره يوي خواته پريږدو او پاتي لا دا چي دپښتو سوچه تورو د نه راوړلو خبره هم را بر سيره شوي ده.
ممكن ډير دوستان او خواږه ژبى شاعران او ليكوال دي خبري ته سره راټول شو ى وى چى ملي سرود وليكى. وبه يى ليكى زه په دى كى شك نه بولوم خو يوه خبره داده چي آيا موږ غواړو دي مسالى سره تخنيكى برخورد وكړو او كه غواړو داسى يو متن وړاندى كړو چى دټولو پري سلا مشورت وى؟

دقومونو دنومونو راوړل په ملى سرود كي هسى يوه زايده خبره ده.دي كار سره نه د په افغانستان کښي د ميشتو قومونو حقوق ادا كيداى شي او نه هم هغوى پر دي خبره خوشحاليږى او كه خوشحاله هم شى څه شى لاس ته راوړى؟

په اساسي قانون كى دملى سرود په اړه پريكړه دى دجمهور رييس په يو امر سره وځنډول شى.او يو داسى متن چى دټولو دمنلو وړ وي رامينځ ته شى چي دافغانستان دټولو ولسونو خلكو ،قومونو او توكو ته دمنلو وړ وى.

ايا افكر مو كړى دي چي موږ داسي يو تيار متن او  تيار كمپوز په لاس كى لرو؟زه په دي باور يم او له ماسره به دافغانستان په سلو كي نهه نوي خلك موافق وى چى كه هر څومره شاعران راټول كړۍ او هر څومره متنونه وليكل شى تر دى متنه به نه قوت ولرى او نه كيفيت او نه هم منونكى.

قوت او كيفيت دلته  د يوه ځانګړى مفوم په توګه كارول شوى چى درانه شاعران او نور دوستان ما ملامت نه كړى چى زه ګڼه ددوى آفرينشى كارته خداى مه كړه ارزښت نه وركوم العياذ بالله داسى نه ده.خو هغه متن چى زه ىى غواړم وړانديز وركړم زموږ دملى او وطنى او قومى ځانګړنو سره جوښت،پوره اوبرابر دى.

وګورۍ چى په تيرو ديرشو كلونو كى څومره پاچهان او جمهور رييسان تير شول او هر يوه ځانته يو ملى سرود وليكل او كمپوز يي كړ خو دهغه دځواك له  له مينځه تللو نه مخكى دهغه ملى سرود له مينځه ولاړ او دا ځكه چى هغه سرود كى ملى والى نه وو كه نه ملى سرود څنګه له مينځه ځى؟ حتى د داوود خان ودوخت ملى سرود چى وايى داستاد مرحوم بينوا شعر وو.مګر هغه څه چى زه وړانديز كوم دهرتاجيك پر ژبه ده،دهر پښتون سره ښايى،دهرازبك او هزاره او ايماق خوښيږى او دهر پشه يى او نورستاني او تركمن اوبلوچ له پاره دمنلو وړده.او بله خبره دا چى دليكلو او كمپوزولو له پاره يي نه پيسى په كار دى او نه هم ځانګړي مصرفونه يوازي دومره وكړى چى دښاغلو ملنګ جان مرحوم او استاد اولمير قبرونه ترميم او جوړ كړۍ او تيار ملي سرود وكاروى.

له ټولو فرهنگيانو،شاعرانو او  دوياړلى افغانستان دمينه والو څخه په ډير ادب او احترام هيله كوم چي كه چيرى زما له وړانديز سره موافقت ولرى نو لطفا دى خپل پيوستون  دى په همدى سايت كى ښكاره كړى.

په ١٣٨ مخونو کي پراخباري کاغذ چاپ سوی دی ، د پښتو ټولني لوی مدير ارواښاد صديق الله رښتين ، سريزه پر ليکلي ده او خپله د کتاب ليکوال راواښاد ( خادم ) د کتاب په اړه څو خبري ليکلي دي ، دا کتاب په ١٣٨ مخونو کي ٥٨ سرليکونه لري .په کوئټه ،کندهار او کابل کي يې تر لاسه کولای شئ .
 
لحده نيسه يې کرار په غيږ کې  .  يوزهره چاودى او خوږمن درسپارو
چې يي زخمونه دي دستورو په څېر . دکهکشان غوندي بدن درسپارو
 
په ډېره خواشيني سره مو خبر ترلاسه کړ چې دافغانستان بيسارى لويه او عظيمه ،علمي او فرهنګي هستي
 فاضل استاد علامه پوهاند اکاډيمسين عبدالشکوررشاد
له دارالفناڅخه ددرالبقا پر لور وکوچيد روح دي يې ښاده وي 

ارواښاد علامه رشاد چې نن د افغانستان په سيمه ايز وخت د سهار پر يوولس نيمي بجې يې خپله سپڅلې ساه خپل خالق ته وسپارله جنازه به يې دجمعې پر ورځ  دليندۍ پر ديارلسمه  نيټه د ارواښاد پلرني ټاټوبي (کندهار ) ته راوړل شي او خاورو ته په وسپارل شي همدا اوس  ـ اوس په کابل او کندهار داراوښاد دوستان او خواخوږي ددوى دتدفين په چارو بوخت دي او په کندهار کې دفرهنګيانو يوه غونډه روانه ،ده چې دارواښاد دتدفين دځاى دټاکلو او نورو مسائلو په اړه يوه ګډه پريکړه وکړي .
 
د پوهاند علامه عبدالشکور رشاد د مړيني  تر خبر وروسته 
په کندهار کښي بېړنۍ غونډه جوړه شوه 
 
په ډېره خواشينۍ سره مو خبر تر لاسه  کړ چې دافغانستان او سيمې ديوې لويې فرهنګي او علمي څيرې ( ارواښاد علامه پوهاند اکا ډميسين عبدالشکور رشاد ) دروند او برکتناک سيورى دافغا ن ملت ، په ځانګړي ډول علمي ا و فرهنګي کړيو له سره ليري شو .
 
انالله وانا الله راجعون
 
 فاضل استاد علامه پوهاند رشاد دروان کال دليندۍ پر دولسمه دغرمې ددولس نيمو بجوپر  مهال  دورپيښې ناجوړې  له امله  خپله سپڅلې اروا په څلورسوه بيستريز روغتون کې خپل خالق ته وسپارله ..
 
دفاضل استا د مړى به سبا ورځ دليندۍ پر ١٣ مه دکابل ښار په څلورسوه بستريز روغتون کې دهغه خواخوږو ، دوستانو دعلمي او فرهنګي  څيرو له خو ا دوروستۍ لېدنې لپاره پروت وي ، بيا به  ورپسې ورځ چې دجمعې مپارکه ورځ او دليندۍ ١٤ ـ مه  کيږي خپل پلرنې ولايت کندهار ته وړل کيږي او هلته به خاورو ته سپارل کيږي .
 
دغونډې د برخوالو انځورونه 
 
 
دارواښاد علامه رشاد دمړينې په اړه دبېنوا فرهنګي ټولنې  پيغام
 
 
نن دداسي يوه انسان دمړيني خبراورو چې دکليمې په ټوله مانا دانساني کرامت ټول ارزښتونه يې له ځانه سره لرل .

ټول افغان ملت ته په ټولنيز ډول دده ودرنې کورنۍ او يمتمې کورنۍ ته په ځانګړي توګه  دغني بادار له درباره دبيساري زغم او صبر غوښتنه کوو.
دفاضل استاد علامه رشاد صاحب اروا په فردوس جنت کې ښاده او خوښه غواړو (  امين )
 
بينوا فرهنګي ټولنه ، کندهار افغانستان
 
موږ خپل ټول وس په کار اچوو تر څو له سيمه ايزو او نړيوالو مطبوعاتو د ارواښاد علامه رشاد صاحب  په اړه ټول خپاره شوي مطالب ثبت او تاسو ته وړاندي کړو . 
 
د هيواد نوميالي ليکوال ، شاعر ، تاريخپوه ، او څېړونکي محقق محمد معصوم هوتک د خپل استاد په وير کي دغه بولنه ويلي ده ، کليک يې کړئ .
 
د افغان رسالې د مسول مدير ښاغلي احمد شا هوتکي سره د فاضل استاد  اکاډيميسن  پوهاند علامه رشاد خبري ، ( دا د رشاد صاحب تر ټولو وروستۍ خپري شوي خبري دي) 
 
د بي بي سي : ١ ډسمبر  ٢٠٠٤ / ارواښاد علامه رشاد صاحب خبري ، دهيواد د تکړه ليکوال څېړونکي او کره کتونکي محمد زرين انځور  او ډاکټر مجاور احمد زيار خبري  .
 
د امريکا ږغ راډيو له خوا د پوهاند استاد رشاد صاحب د مړيني لومړی خبر 
 
د امريکا ږغ راډيو د پوهاند علامه رشاد د مړني په مناسبت  د ښاغلي عبدالله بختياني او محقق محمد معصوم سره خبري کړي دي .
 
د ارواښاد علامه رشاد صاحب د مړيني دوهمه ورځ په کابل کښي په زرګونو تنه دارواښاد مينه وال د هغه دمړي دليدلو کتلو لپاره راغلي وو ، په دې اړه ډاکټر رشاد د بېنوا ويبپاڼي سره په خبرو کښي .
 
( د ارواښاد مړيني دريمه ورځ _ کندهار ) د بي بي سي راډيو پښتوڅانګي سره په کندهار کښي د بېنوا فرهنګي ټولني د مرستيال ښاغلي  عبدالجبار ترنګ مرکه 
 
د ارواښاد علامه رشاد د جنازې  راپور په بي بي سي مازيګرنۍ خپرونه کي 
 
د ارواښاد په ملي ماتم  کي په  جرمني کي د افغان کلتوري ودي ټولني  د ماتم غونډه جوړه کړې وه چي د افغانستان نامتوليکوال او د همدې  ټولني  مشر  ئې بېنوا ويب پاڼي ته داسي توضحات راکوي 
 
بي بي سي خپل ځانګړی اوننيز ادبي پرګرام  د ارواښاد علامه  رشاد لپاره ځانګړی کړی دی 
 
په کندهارکي د ارواښاد علامه رشاد د جنازي راپور د امريکا  په اشنا راډيو کي   
 
د ارواښاد علامه رشاد شاګرد ( د کابل پوهنتون د لوغونپوهني د څانګي پخوانی استاد)  ښاغلي رسول باوري د بېنوا ويبپاڼي سره د خپل ګران استاد د ژوند خاطرې يادي کړي دي . 
 
ای کندهاره  :: د نامتو ليکوالي او شاعري نجيبه سارا بياباني په ږغ کي 
 
د ارواښاد علامه رشاد صاحب خاورو ته د سپارلو او فاتحې د لومړۍ ورځي په اړه دبېنوا فرهنګي ټولني له مشر عبدالاحمد محمديار سره د بېنوا ويبپاڼي مرکه    
 
بېنوا په اروپا کي د افغاني کلتوري اوفرهنګي ټولنو ګډه جرګه د فرانکفورټ په ښار کي يوه پراخه غونډه او د فاتحې مراسم جوړوي !  بېنوا ويبپاڼي د ښاغلي محمد عاشق  غريب سره دغونډي په څرنګوالي په اړه مرکه کړې ده  ، دلته يې واورئ .  
 
د ارواښاد اکاډيميسن پوهاند علامه عبدالشکور رشاد د مړيني په اړه د ازادۍ راډيو هم د يو شمير نورو په شان  يو ساعته  ( تر شنه اسمان لاندي ) ادبي او کلتوري  خپرونه د ارواښاد رشاد صاحب لپاره ځانګړې کړې وه . په دې خپرونه کي چي د ارواښاد رشاد صاحب خاورو ته د سپارلو پر وخت ژوندۍ خپريدل . په دې خپرونه کښي ميلمانه دغه ښاغلي دي : حبيب الله رفيع ( کابل ) عبدالله بختاني ( ننګرهار ) او معصوم هوتک د کاناډا څخه . لومړی نيم ساعت            دوهم نيم ساعت تر پايه     
 
دالمان ږغ راډيو سره د ارواښاد استاد رشاد په اړه د ښاغلي زرين انځور مرکه  تاسو يې خپل کمپيوټر ته هم کښته کولای شئ . 

د هيواد د نوميالي ليکوال ، څېړونکي، کره کتونکي او په اروپا کښي د افغاني کلتوري ټولنو د ګډي جرګې د مشر ښاغلي زرين انځور وينا  
 
د ٢٠٠٤ کال د ډسمبر ١٢مه نېټه ( فرانکفورټ ) ښاغلی عبدالوهاب سرتير په ږغ کښي 
 
دنړۍ په مطبوعاتوکي د علامه رشاد په اړه خپري شوي مرکې او راپورونه په ږغ کښي

دافغانستان دکلتوري ودې ټولنه جرمني
 
د ٢٠٠٤ کال د نومبر ٢٦ جرمني ، د کولن ښار

هغه د افغانستان د ټولو سيمو او د ټول افغان اولس د بچو متوازنې ښوونې او روزنې ته خپله عمده پاملرنه ورواړوله او په دې توګه يې د افغانستان د پوهنې د ودې په تاريخ کې خپل نوم په زرينو کرښو وليکه .
 
د وطن د دغه حقدار خدمتګار يادونه به د وطن د ربښتينو بچو په يادونو او د هېواد د تاريخ په حافظه کې د تل لپاره ژوندي وي .
هغوی ته له لويه خدايه دفردوس جنت  هيله کوو، کورنۍ او د هېواد دمعارف له ټولو منسوبينو سره په دې غم کې ځانونه شريک بولو . 
د افغانستان د کلتوري ودې ټولنې د مشرتابه جرګه

د نوميالي شخصيت ډاکټر علي احمد پوپل د مړينې له کبله د افغانستان د کلتوري ودې ټولنې پيغام

EOD;
}
