<?php

namespace Faker\Provider\ku_IQ;

class Text extends \Faker\Provider\Text
{
    protected static function validStart($word)
    {
        return preg_match('/^\p{Kurdish}/u', $word);
    }

    /**
     *
     * @see https://ckb.wikipedia.org/wiki/%DA%BE%DB%95%D8%B1%DB%8E%D9%85%DB%8C_%DA%A9%D9%88%D8%B1%D8%AF%D8%B3%D8%AA%D8%A7%D9%86
     * @var string
     */
    protected static $baseText = <<<'EOT'
    زاراوەناسی
    کوردستان بە واتای "نیشتمانی کوردان" دێت. چەمکی"کورد" لە وشەی لاتینی Cordueni داتاشراوە کە بە مانای دانیشتوانی پاشایەتی Corduene دێت، کە بوو بە ناوچەیەکی ئیمپراتۆری ڕۆمان لە ٦٦ پ. ز. لە دەستوری عێراقیدا، بە "ھەرێمی کوردستان" ئاماژەی پێکراوە. حکومەتی ھەرێم بە "کوردستان - عێراق"، یان "ھەرێمی کوردستان" ناوی دەبات بەڵام دەستەواژەی "کوردستانی عێراق" بەکارناھێنێت. ناوی حکومەتەکە "حکومەتی ھەرێمی کوردستان"ە کە کورتەکەی لە زمانی ئینگلیزیدا KRG یە. کوردەکان بە کوردستانی باشووریش ناوی دەبەن ئەوەش بەھۆی ھەڵکەوتەی جوگرافییەکەیەوە کە بەشی باشووری کوردستانی گەورەی پێکھێناوە. لە سەردەمی دەسەڵاتی حزبی بەعسدا لە حەفتاکان‌ و ھەشتاکاندا، ھەرێمەکە بە "ھەرێمی ئۆتۆنۆمی کوردستان" ناودەبرا.
    
    مێژوو
    بە درێژایی مێژوو ھەرێمەکە نەتەوەی جیاوازی تیا نیشتەجێ بوون یان حوکمڕانییان کردبووە وەک حورانیەکان، میتانیەکان، ئاشورییەکان، تورکەکان، میدییەکان، فارسەکان، یۆنانییەکان، ڕۆمانییەکان‌ و عەرەب‌ و تادوایی. لە سەدەکانی ناوەڕاستدا لەلایەن میرنشینی نیمچە سەربەخۆوە حوکمڕانی کراوە وەک میرنشینەکانی سۆران، بابان، بادینان‌ و ئەردەڵان کە بە ھەموویان بەشێکی گەورەی خێڵ‌ و تیرە کوردییەکانی ئەمڕۆ پێکدێنن. لە ناوچە جیاجیاکانی کوردستان دەژین‌ و ھەموو خۆیان بە کورد ئەزانن.
    
    ئینتیدابی بریتانی
    لە یەکی کانوونی دووەمی ١٩١٨ لە کۆبوونەوەیەکدا لە سلێمانی لەگەڵ کۆڵۆنێڵ ئارنۆڵد وێڵسن، مەندوبی سیڤیلی میسۆپۆتامیا بە وەکالەت، سەرکردە کوردەکان داوای پاڵپشتیی بریتانیایان کرد بۆ دامەزراندنی کوردستانێکی یەکگرتووو سەربەخۆ لەسایەی پاراستنی بریتانیادا. لە نێوان ساڵانی ١٩١٩ و ١٩٢٢، شێخ مەحمود بەرزنجی کە سەرکردەیەکی کوردی کاریگەر بووە لە سلێمانی، حکومەتێکی کوردیی پێکھێنا‌ و دوو شۆڕشی دژی حوکمی بریتانیا کرد. دوو ساڵی پێچوو تا دەسەڵاتی بریتانی توانی ڕاپەڕینەکانی سەرکوت بکات. یەکەم شۆڕشی لە ٢٢ی مایسی ١٩١٩ دەستی پێکرد‌ و کە تێیدا ئەو کارمەندە بریتانیانەی لە سلێمانی بوون دەستگیرکران‌ و شۆڕشەکە بەخێرایی بە موسڵ‌ و ھەولێردا بڵاوبوووە. بریتانیا بۆ سەرکوت کردنی ڕاپەڕینەکە بۆمبارانی ھەوایی، تۆپباران، شەڕی زەمینی و یەکجاریش گازی کیمیایی بەکارھێنا. بریتانیەکان مەحمودیان دوورخستەوە بۆ ھندستان. لە حوزەیرانی ١٩٢٠، ٦٢ سەرکردەی خێڵەکیی ناوچەکە، داوای سەربەخۆیی کوردستانیان کرد لەژێر سایەی ئینتیدابی بریتانیا. ڕەتکردنەوەی بریتانیەکان بۆ حوکمی سەربەخۆی کوردەکان لەوەوە سەرچاوەی گرت کە سەرکەوتنی حوکمی سەربەخۆی کوردەکان لە ناوچەکەدا وا ئەکات عەرەبەکانی تر لە ھەردوو ناوچەی بەغدا‌و بەسرە داوای سەربەخۆیی بکەن و بەمەش کۆنتڕۆڵی ڕاستەوخۆی بریتانیەکان بەسەر میسۆپۆتامیادا لەناودەچێت. لە ساڵی ١٩٢٢، بریتانیا شێخ مەحمودیان گێڕایەوە سەر دەسەڵات، بەو ھیوایەی شێخ مەحمود کوردەکان ڕێکبخاتەوەو دژایەتی تورکەکان بکات کە داوای موسڵ و کەرکووکیان دەکرد. شێخ مەحمود مەملەکەتی کوردستانی راگەیاند و خۆی وەک مەلیکی کوردستان ناساند، دواتر ڕەزامەندی دەربڕی بە ئۆتۆنۆمییەکی سنووردار لەچوارچێوەی دەوڵەتی عێراقی تازە پێکھێنراودا. لە ساڵی ١٩٣٠ و دوای ڕاگەیاندنی وەرگیرانی عێراق لە "عوسبەتول ئومەم"، شێخ مەحمود سێیەم ڕاپەڕینی دەستپێکرد کە بە ھێزە زەمینی و ئاسمانییە بریتانییەکان سەرکوتکرا.
    
    بە ھاتنی ١٩٢٧، ھۆزی بارزانی بوونە پشتیوانی مافەکانی کورد لە عێراق. لە ساڵی ١٩٢٩، بارزانییەکان داوای ناوچەیەکی کوردییان کرد لە باکووری عێراق. بە پاڵپشتیی ئەم داوایانە، لە ساڵی ١٩٣١ ناسراوەکانی کورد سکاڵایەکیان دایە "عوسبەتول ئومەم"‌و داوای دامەزراندنی حکومەتێکی سەربەخۆی کوردییان لێرد. لەژێر حکومەتی عێراقی و بریتانیەکان، لە ساڵی ١٩٤٥، سەرکردەی ھەرە کاریگەری ھۆزەکە، مستەفا بارزانی ناچار کرا بڕواتە ئێران. دواتر چووە یەکێتی سۆڤێت، ئەمەش دوای ڕووخانی کۆماری مھاباد لە ساڵی ١٩٤٦.
    
    شۆڕشەکانی بارزانی لە ساڵانی ١٩٦٠-١٩٧٥و دواھاتەکانی
    دوای کودەتایەکی سەربازیی لە لایەن عەبدولکەریم قاسمەوە ساڵی ١٩٥٨، بارزانی توانی لە مەنفا بگەڕێتەوە و پارتێکی سیاسیی خۆی دابمەزرێنێت کە پارتی دیموکراتی کوردستانە و لە ساڵی ١٩٦٠ شێوەی فەرمیی وەرگرت. دوای ماوەیەکی کەم، قاسم خێڵی برادۆست و زێباریی دژی بارزانی ھاندا. لە تەموزی ١٩٦١، بارزانی یەکەم شۆڕشی خۆی دژی حکومەتی عێراقی دەستپێکرد بەمەبەستی پارێزگاری لە زامنکردنی حوکمڕانیی کوردی. بەھۆی ئەو پەشێوییەی لە سوپای عێراقدا دروستبوو دوای کودەتاکەی ١٩٥٨، حکومەتەکەی قاسم نەیتوانی شۆڕشەکان سەرکوت بکات. ئەم بنبەستە چەند گروپێکی بەھێزی سوپای توڕەکرد، ئەمەش لەوانەیە یەکێک بووبێت لە ھۆکارە بەھێزەکانی پشت کودەتاکەی بەعس. عەبدولسەلام عارف لە شوباتی ١٩٦٤ ئاگربەستی ڕاگەیاند و ئەمەش بووە ھۆی دابەشبوونی کوردی شارنشینە رادیکاڵەکان لە لایەک و ھێزە تەقلیدییەکانی سەر بە بارزانی لە لایەکی تر. بارزانی ڕازی بوو بە ئاگربەستەکە و رادیکاڵەکانی لە پارتەکەی دەرکرد. سەرەڕای ئەمە، حکومەتی بەغدا ویستی جارێکی تر جوڵانەوەکەی بەرزانی بەھۆی ھێزەوە ببەزێنێت. ئەم ھەڵمەتە لە ساڵی ١٩٦٦ دا سەرکەوتوو نەبوو چونکە ھێزەکانی سوپای عێراق لە نزیک ڕەواندوز لەلایەن ھێزەکانی بارزانییەوە بەزێنران. دوای ئەمە، لە حوزەیرانی ١٩٦٦، عارف بەرنامەیەکی ئاشتی خستەڕوو کە ١٢ خاڵی لەخۆ ئەگرت، کە لەبەر لەکار لادانی عارف بە کودەتای بەعسییەکان جێبەجێ نەکرا. حکومەتی بەعس ھەڵمەتی لەناوبردنی شۆڕشەکانی کوردی دەستپێکرد کە لە ١٩٦٩ ڕاگیرا. ئەمە ئەتوانرێ بەشێکی بخرێتە ئەستۆی ئەو ناکۆکییە ناوخۆییەی بەغدا لەسەر دەسەڵات و ئەو ئاڵۆزییانەی لەگەڵ ئێراندا ھەبوون. سەرەڕای ئەمانە، سۆڤێت فشاری لەسەر عێراق دادەنا بۆ ڕێککەوتن لەگەڵ بارزانی دا. بەرنامەی ئاشتی لە ئازاری ١٩٧٠ خرایە ڕوو کە ئۆتۆنۆمییەکی فراوانتری بۆ کوردەکان لەخۆ دەگرت. پلانەکە کە ڕێگەی بە کوردەکان دەدا لە حکومەتی بەغداش نوێنەر‌و بەشداریان ھەبێت، دەبوو لە چوار ساڵدا جێبەجێ بکرێت. لەگەڵ ئەمەشدا، ھەر لەو کاتەدا حکومەتی عێراقی دەستی کرد بە جێبەجێکردنی بەرنامەی بەعەرەبکردن لە کەرکوک و خانەقین کە بە نەوت دەوڵەمەندن. لە ساڵەکانی دواتردا، حکومەتی بەغدا بەسەر دووبەرەکییە ناوخۆییەکانیدا زاڵ بوو و لە نیسانی ١٩٧٢ ڕێکەوتننامەی دۆستایەتی لەگەڵ یەکێتی سۆڤێت مۆر کرد، ھەروەھا کۆتایی بە تەریکگرتنی خۆی لە وڵاتانی عەرەب ھێنا. لەولاشەوە، کوردەکان ھەر پشتیان بە ھاوکاری سوپای ئێران بەستبوو و توانییان کەمێک ھێزەکانیان بەھێزبکەن.
    
    ڕێکەوتننامەی جەزائیر
    لە ساڵی ١٩٧٤ حکومەتی عێراقی ھەڵمەتێکی شەڕەنگێزی نوێی دژی کوردەکان دەستپێکرد و بەرەو ناوچە سنوورییەکانی ئێران دایماڵین. عێراق بە ئێرانی ڕاگەیاند کە خواستەکانی ئێران بەدی ئەھێنێت بەمەرجێک یارمەتی کوردەکان ڕاگرێت. بە میانگیریی سەرۆکی جەزائیر، ھۆری بۆمدین، ئێران و عێراق گەیشتنە ڕێکەوتنێکی گشتگیر لە ئازاری ١٩٧٥ دا کە بە ڕێکەوتننامەی جەزائیر بەناوبانگە. ئەم ڕێکەوتننامەیە وای کرد کوردەکان بەبێ یارمەتی بمێننەوە و تاران یارمەتییەکانی بزووتنەوەی کوردی نەدات. بارزانی ئاوارەی ئێران بوو، ھەروەھا ژمارەیەکی زۆر لە لایەنگرەکانیشی. ژمارەیەکی زۆریش خۆیان بەدەستەوە دا‌و شۆڕشەکە دوای چەند ڕۆژێک کۆتایی ھات. لە ئەنجامی ئەمەدا حکومەتی عێراقی بووە خاوەنی دەسەڵاتێکی فراوانتر بەسەر ناوچەکانی باکووری عێراقدا لەچاو پانزە ساڵی پێشوویدا و بۆ ئەوەی ئەو کاریگەرییە بپارێزێت، دەستی بە پلانی بە عەرەبکردن کرد ئەویش بە ھێنانی خەڵکی عەرەب بۆ ناوچە نەوتییەکانی کوردستان، بەتایبەتی بۆ ناوچەکانی کەرکوک‌و دەور‌وبەری. دوای ڕێکەوتننامەکەی جەزائیر، ڕێوشوێنی سەرکوتکەرانە لەلایەن حکومەتەوە گیرانە بەر دژی کوردەکان و بووە ھۆی سەرلەنوێ دەستپێکردنەوەی شەڕ لەنێوان سوپای عێراقی و چەکدارە کوردەکان. لە ساڵانی ١٩٧٧، ١٩٧٨‌و ١٩٧٩، ٦٠٠ دێی کوردی خاپوور کران و نزیکەی ٢٠٠٠٠٠ کورد لە ناوچەکانی خۆیان ڕاگوێزران.
    
    شەڕی ئێران - عێراق و ھەڵمەتی ئەنفال
    لە ماوەی جەنگی ئێران - عێراق، حکومەتی عێراقی سیاسەتی دژە کوردیی گرتەبەر و وەک ئەمرێکی واقیعی شەڕێکی ناوخۆی لێکەوتەوە. عێراق کەوتە بەر ئیدانەکردنێکی بەرفراوان لەلایەن کۆمەڵگەی مەدەنییەوە، بەڵام ھەرگیز بەشێوەیەکی جددی سزا نەدرا بەرامبەر ئەو ڕێوشوێنە سەرکوتکارانەیەی گرتنیە بەر، لەوانە بەکارھێنانی چەکی کیمیاوی دژی کوردەکان کە ھەزاران کوژراوی لێ کەوتەوە. ھەڵمەتی ئەنفالیش کۆمەڵکوژییەکی بەرنامە بۆ داڕێژراو بوو دژی کوردەکانی عێراق جێبەجێکرا. لە ٢٩ی ئازاری ١٩٨٧ تا ٢٣ی نیسانی ١٩٨٩، سوپای عێراقی بە فەرماندەیی عەلی حەسەن ئەلمەجید ھەڵمەتی کۆمەڵکوژیی دژی کوردەکانی گرتەبەر کە لە چەند ڕوویەکەوە دژی مافەکانی مرۆڤ بوو، لەوانە: بەکارھێنانی بەرفراوانی چەکی کیمیاوی، خاپوور کردنی نزیکەی ٢٠٠٠ گوندی و کوشتنی نزیکەی ٥٠٠٠٠ دێنشینی کورد، ئەمە بەپێی محافزکارانەترین خەمڵاندن. قەڵادزێی گەورە شارۆچکەی کوردی (کە ٧٠٠٠٠ کەس دانیشتوانەکەیەتی) بە تەواوی خاپوور کرا لەلایەن سوپای عێراقییەوە. ھەڵمەتەکە تەعریبکردنی کەرکووکیشی لەخۆ گرتبوو، ئەویش دەرکردنی کوردەکان بوو لەو ناوچانەی بە نەوت دەوڵەمەندن و نیشتەجێکردنی عەرەبەکانی باشوور و ناوەڕاستی عێراق لە شوێنیان. سەرچاوە کوردییەکان ژمارەی قوربانییانی ئەم ھەڵمەتە بە زیاتر لە ١٨٢ ھەزار ئەخەمڵێنن.
    
    دوای جەنگی کەنداوی فارس
    ھەرێمی کوردستان لە بنەڕەتدا لە ساڵی ١٩٧٠ دا وەک ھەرێمی ئۆتۆنۆمیی کوردی دامەزرا، ئەمەش دوای ئەو ڕێکەوتنە ئۆتۆنۆمییەی لەنێوان سەرکردەکانی حکومەتی عێراقی و سەرکردەکانی کوردە جڤاتی کوردەکانی عێراق مۆر کرا. ئەنجومەنی یاسادانان لە ھەولێر دامەزرێنرا و دەسەڵاتێکی تیۆریی ھەبوو بەسەر پارێزگا کوردنشینەکانی ھەولێر و دھۆک و سلێمانی دا. ھەرچەندە لە ڕاستیدا ئەنجومەنەکە لە ساڵی ١٩٧٠ دا دامەزرێنرا بەڵام ھەر لەژێر کۆنتڕۆڵی سەدام حسێنی سەرۆکی عێراقدا بوو تا ساڵی ١٩٩١ کاتێک دوای کۆتاییھاتنی جەنگی کەنداو ڕاپەڕینی جەماوەریی سازکرا دژی دەسەڵاتەکەی. بایەخدان بە ئارامی و ئاسایشی ئاوارە کوردەکان ئەوکاتە ڕەنگی دایەوە کە ئەنجومەنی ئاسایشی نەتەوە یەکگرتووەکان بڕیاری ٦٨٨ی دەرکرد بۆ پێکھێنانی "سەیڤ ھەیڤن" بۆ کوردەکان بەوەی کە ھێزە ئاسمانییەکانی ئەمریکا‌و بریتانیا پارێزگاری ناوچە کوردییەکانی عێراق بکەن. ناوچەی دژە فڕین دھۆک و ھەولێری دەگرتەوە، بەڵام سلێمانی و کەرکووکی بەجێھێشتبوو. دوای چەند شەڕێکی خوێناوی لەنێوان ھێزە عێراقییەکان و کوردەکاندا، نایەکسانی لە ھێزدا دروستبوو، و حکومەتی عێراقی سوپاکەی و کارمەندەکانی لە ناوچەکە کێشایەوە لە تشرینی یەکەمی ١٩٩١دا. لە ھەمان کاتدا، حکومەتی عێراق ئابڵوقەی ئابووریی خستە سەر ھەرێمەکە، بە کەمکردنەوەی نەوت و خواردەمەنی. بەمەش ھەرێمەکە سەربەخۆییەکی دیفاکتۆی ڕاگەیاند و لەلایەن ھەردوو حزبە گەورەکەوە، پارتی دیموکراتی کوردستا و یەکێتیی نیشتمانیی کوردستان ناوچەکەیان بەڕێوە دەبرد لە دەرەوەی دەسەڵاتی حکومەتەکەی بەغدا. حکومەتەکە ئاڵا‌و سروودی نەتەوەیی خۆی ھەیە.
    
    ھەڵبژاردنەکانی لە تەموزی ١٩٩٢ ئەنجامێکی یەکلانەکەری ھەبوو، لەبەر ئەوەی ئەنجومەنەکە بە نزیکەیی دابەشبوو بەسەر دوو بەشی یەکسان بەسەر دوو پارتە سەرەکییەکە و ھاوپەیمانەکانیان. لەم ماوەیەدا، کوردەکان دوو ئابڵوقەیان چووە سەر، یەکێکیان ئەوەی نەتەوە یەکگرتووەکان بەسەر عێراقدا سەپاندبووی و ئەوەی تر کە سەدام حسێن بەسەر ھەرێمەکەدا سەپاندی. بەھۆی ئەم ئابڵوقانەوە، سەختییەکی ئابووری گەورە دروستبوو و بووە ھۆی درووستبوونی پێکدادان لەنێوان ھەردوو حزبە گەورەکەدا پارتی دیموکراتی کوردستان و یەکێتیی نیشتمانیی کوردستان لەسەر دەستبەسەرداگرتنی جوڵە و سەرچاوەکانی بازرگانی. ئەمە بووە ھۆی کوشتاری ناوخۆ لەنێوان کوردەکان لەنێوان ساڵانی ١٩٩٤ تا ١٩٩٦. دوای ١٩٩٦، ١٣٪ی داھاتی نەوتی حکومەتی عێراق تەرخانکرا بۆ کوردستانی عێراق و ئەمە بووە ھۆی گەشەیەکی ئابووری لە ھەرێمەکەدا. میانگیریی ڕاستەوخۆی ئەمریکا ئاگربەستێکی فەرمیی لە نێوان دوو حزبەکەدا لێکەوتەوە کە بە ڕێکەوتننامەی واشنتۆن بەناوبانگە و لە ئەیلولی ١٩٩٨ دا مۆرکرا. ھەرچەندە بۆچوونی ئەوتۆش ھەیە کە پڕۆگرامی نەوت بە خۆراک -١٩٩٧ کاریگەریی گەورەی ھەبووە لەسەر ڕاگرتنی ناکۆکییەکە. ھێزی حزبە کوردییەکان ھاوکاری ھێزی ھاوپەیمانیان کرد بۆ ڕووخاندنی حکومەتی عێراق لە پڕۆسەی ئازادی عێراقدا لە بەھاری ٢٠٠٣. ھێزی سوپایی کوردستان کە بە پێشمەرگە ناودەبرێن ڕۆڵی سەرەکییان زۆر گەورەیان بینی لە ڕووخاندنی حکومەتی پێشووی عێراق.
    
    پارتی دیموکراتی کوردستان و یەکێتیی نیشتمانیی کوردستان یەکیانگرت و لەگەڵ چەند حزبێکی بچووکتردا ھاوپەیمانێتی کوردییان ڕاگەیاند کە ٥٣ نوێنەری ھەیە لە پەرلەمانی بەغدا، ئەمە لە کاتێکدایە یەکگرتووی ئیسلامی کورد ٥ کورسی ھەیە. سەرکردەی یەکێتیی نیشتمانیی کوردستان، جەلال تاڵەبانی، بۆ سەرۆک کۆماری عێراقی نوێ ھەڵبژێردراوە و مەسعود بارزانیی سەرکردەی پارتی دیموکراتی کوردستان سەرۆکی ھەرێمی کوردستانە.
    
    سیاسەت
    لە ساڵی ١٩٩٢ەوە، حکومەتی ھەرێمی کوردستان دامەزرێنراوە و پایتەختەکەی ھەولێرە. پەرلەمانی ھەرێم بە لایەنگرێکی زۆرەوە ھەڵبژێردرا‌و ناوی ئەنجومەنی نیشتمانیی کوردستانی عێراقە و کابینەیەکی حکومیی لە پارتی و یەکێتی‌و ھاوپەیمانەکانیان (حزبی شیوعی عێراقی و حزبی سۆسیالیستی کوردستان و تاد.) پێکھێنرا. نێچیرڤان ئیدریس بارزانی لە ١٩٩٩ وە سەرۆک وەزیری حکومەتی ھەرێمی کوردستانە.
    
    دوای ڕزگاری عێراق لە ٢٠٠٣، سیاسییەکانی کورد بوونە ئەندام لە ئەنجومەنی حوکمی عێراق. لە ٣٠ی کانونی دووەمی ٢٠٠٥ سێ ھەڵبژرادن ئەنجام درا ١) بۆ ئەنجومەنی نیشتمانی ئینتیقالی ٢) بۆ ئەنجومەنی نیشتمانی کوردستانی عێراق و ٣) بۆ ئەنجومەنی پارێزگاکان. یاسای بەڕێوەبردنی دەوڵەتی عێراق بۆ سەردەمی ئینتیقالی، حکومەتی ھەرێمی کوردستانی ئۆتۆنۆم-ی سەلماند بە "سەروەریی تەواو"‌و ڕێزگرتن لە دەستووری ھەمیشەیی. حکومەتی ھەرێمی کوردستان دەسەڵاتی دەستووری ھەیە بەسەر پارێزگاکانی ھەولێر، دھۆک و سلێمانی و چەند ناوچەیەکی دیالە و نەینەوا و کەرکووک.
    
    ڕیزبەندیی ڕووداوە سەرەکییەکان بەپێی ساڵەکانی ڕوودانیان
    سـاڵی ١٩١٨ دوای ڕووخانی ئیمپراتۆریەتی عوسمانی لە پاش جەنگی جیھانی یەکەم، ئینگلیزەکان ئەو ناوچانەیان داگیر کرد کە دەوڵەمەند بوو بە نەوت و ناوچەی ویلایەتی موسڵی دایە دەست دەوڵەتی عوسمانی، بەمەش کورد دەسەڵاتی فراوانتر بوو لەوکاتەی کەوتە ژێر حوکمی ئینگلیز.
    سـاڵی ١٩١٩ ویلایەتی موسڵ خرایە پاڵ عێراق کە دەوڵەتێک بوو تازە دروست بوو بوو. کە ڕاستەوخۆ دوای داگیرکاریەکەی ئینگلیز ھات.
    سـاڵی ١٩٢٠پەیمانی سیڤەر، کە لەلایەن دەوڵەتی عوسمانی ڕووخاوەوە واژوو کرا، بە ڕەزامەندی (کۆمەڵەی گەلان) تێیدا ئاماژە بە دەوڵەتی کورد دەدات و بە پێی ماددەی ٦٤ی پەیماننامەکە ھەڵبژاردن دەخاتە بەردەم کوردەکان کە لەگەڵ ویلایەتی موسڵدا بمێننەوە یان پێکھێنانی دەوڵەتێکی سەربەخۆ لە داھاتوودا.
    سـاڵی ١٩٢١ مەلیک فەیسەڵی پاشا ھاتە سەر تەختی عێراق و موسڵیشی خستە سەر دەسەڵاتی خۆی لە عێراق.
    سـاڵی ١٩٢٣ کوردەکان بە سەرکردایەتی (شێخ مەحمود بەرزنجی) کودەتایەکی لە دژی دەسەڵاتی ئینگلیزەکان بەرپا کرد، بانگەشەی کوردستانی سەربەخۆی کرد لە باکووری عێراق
    سـاڵی ١٩٢٣ کەمال ئەتاتورک ڕەزامەندی بەدەست ھێنا لە پێکھێنانی دەوڵەتێکی کۆماری لە تورکیا بە پێی پەیماننامەی لۆزان. پەرلەمانی تورکیا پابەندی بەرامبەر پەیماننامەی سیڤەریان نەنواند و پەیماننامەکەی شکاند.
    سـاڵی ١٩٢٤ کورد لە دەست ئینگلیزەکان ڕزگاری بوو.
    سـاڵی ١٩٣٢ کوردەکان لە ناوچەی بارزانەوە ڕاپەڕینێکیان بەرپا کرد دژ بە دەوڵەتی عێراقی چونکە چوونە پاڵ کۆمەڵەی گەلان. کە ئەم ھەنگاوە مافی کوردەکانی پێشێل کرد لە داوای خود موختاری کردنی خۆیان.
    سـاڵی ١٩٤٣ مەلا موستەفای بارزان سەرکردایەتی ڕاپەڕینێکی تری نوێی کرد، سەرکەوتنی بەدەست ھێنا لە ئازاد کردنی ناوچەکانی ھەولێر و بادینان.
    سـاڵی ١٩٤٦ لە مانگی ئابدا، ھێزەکانی ئینگلیز بۆردومانی ڕاپەڕینی کوردەکانی کرد لە ناوچەکانی ڕۆژھەڵات کە بە سەرکردایەتی (قازی محمد) بەرپا کرا، و قازی محمدیش کۆماری مھابادی سەربەخۆی پێکھێنا.
    سـاڵی ١٩٤٦ پاش لەناو چوونی کۆماری مھاباد بە دەستی حکومەتی ئێرانی مەلا موستەفا بارزانی لە ماوەی چەند مانگێکی کەمدا پارتی دیموکراتی کوردستانی پێکھێنا لە کۆنگرەی یەکەمیدا کە لە مەھاباد بەسترا خۆشی سەرکردایەتی ئەو پارتە نوێی گرتە دەست. و پاشتر بارزانی بەرەو یەکێتی سۆڤیەت ڕۆیشت.
    سـاڵی ١٩٥١ نەوە نوێیەکانی کورد لە بەشی باشووری کوردستان لە عێراق سەر لەنوێ پارتی دیموکراتی کوردستانیان زیندوو کردەوە و مەلا موستەفایان بە سەرکردە ھەڵبژاردەوە کە ئەوکات نەفی کرابوو لە یەکێتی سۆڤیەت، سەرۆکایەتی ئەم پارتە ئیبراھیم ئەحمەد گرتیە دەست. کە پەیوەندیەکی پتەوی لەگەڵ حیزبی شیوعی عێراقیدا ھەبوو.
    سـاڵی ١٩٥٨ سیستمی مەلیکایەتی عێراق ڕێگای بە کوردەکان دا کە خۆیان ئاشکرا بنوێنن پاش چەند ساڵ سەرکوت کردنیان و ڕێگای بە بارزانی سەرکردەشدا لە مەنفا بگەڕێتەوە.
    سـاڵی ١٩٦٠ پەیوەندی نێوان کوردەکان و حکومەتی عێراق ئاڵۆزی تێکەوت. کوردەکان ناڕازی بوون بە دەمکوت کردنیان و ماف زەوتکردنیان.
    سـاڵی ١٩٦١ کوردەکان لە باکووری عێراق کودەتایەکیان دژ بە دەسەڵاتی حکومەتی عێراق بەرپاکرد. پێشنیاری مافی خود موختاری پێشکەش بە حکومەتی عێراقی کرد.
    لە مانگی ئاداری ساڵی ١٩٧٠ کوردەکان پەیماننامەیەکیان لەگەڵ حکومەتی عێراقی مۆرکرد. کە حکومەتی عێراقی ڕەزامەندی لەسەر خود موختاری نواند. کە لە پەیماننامەکەدا زمانی کوردی بە شێوەیەکی فەرمی دانی پێدانرا. و لە دەستووری عێراقیشدا ئاماژە بەوە درا کە عێراق لە دوو نەتەوەی سەرەکی پێکھاتووە کە ئەوانیش (کورد و عەرەب) ن.
    لە مانگی ئابی ساڵی ١٩٧١ پەیوەندی نێوان حکومەتی عیراقی و کوردەکان پشێوی تێکەوتەوە، بە مەبەستی یارمەتیدان و ھاوکاری کردن مەلا موستەفای بارزان پەنای بردە بەر ویلایەتە یەکگرتووەکانی ئەمریکا بۆ بە ھاناوە ھاتن.
    لە مانگی ئاداری ساڵی ١٩٧٤ حکومەتی عێراقی ڕێکەوتننامەیەکی فەرز کرد بەسەر کوردەکان کرد سەبارەت بە مافی خودموختاری بوو، ماوەی دوو ھەفتەی دا بە کوردەکان تا وەڵامی ڕەشنووسی ڕێکەوتننامەکە بدەنەوە. بارزانی ناڕازی بوو لەبەر ئەو خاڵەی تێیدا ھاتبوو کە کەرکوک بە کێلگە نەوتیەکانیشیەوە لە ژێر دەسەڵاتی عێراقدا بن نەک کوردەکان. و بارزانیش ڕاپەڕینێکی نوێی بەرپا کرد.
    لە ساڵی ١٩٧٥ پەیماننامەی جەزائیر کە لە نێوان ئێران و عێراقدا واژوو کرا، تیێیدا ئێران کۆتایی بە ھاوکاریکردنی خۆی بۆ ڕاپەڕینی کوردی ھێنا و پاڵپشتی حکومەتی عێراقی کرد، مەلا موستەفاش پاشەکشەی لە ژیانی سیاسی کرد.
    لە مانگی حوزەیرانی ساڵی ١٩٧٦ جەلال تاڵەبانی کە ئەندامێکی باڵای پارتی دیموکراتی کوردستان بوو، پارتێکی سیاسی نوێی دامەزراند بە ناوی (یەکێتی نیشتمانی کوردستان) بە سەرکردایەتی خۆی لە دیمەشق.
    ساڵی ١٩٧٨ ناکۆکی نێوان پارتی دیموکراتی کوردستان و یەکێتی نیشتمانی کوردستان ڕێژەیەکی زۆر کوژراوی لێکەوتەوە.
    سـاڵی ١٩٧٩ مەلا موستەفا کۆچی دوایی کرد و مەسعود بارزانی کوڕی سەرکردایەتی پارتەکەی گرتە دەست.
    ساڵی ١٩٨٠ جەنگ لە نێوان عێراق و ئێراندا ھەڵگیرسا، ھێزەکانی پارتی دیموکراتی کوردستان پەیوەندی پتەویان لەگەڵ ئێران ھەبوو، بەڵام یەکێتی نیشتمانی کوردستان ھاوکاری تارانی دەکرد.
    ساڵی ١٩٨٣ ھێرشی ئێران بۆ سەر عێراق لە باکوورەوە لە ناوچە کوردیەکانەوە دەستی پێکرد. بە ھاوکاری شۆڕشگێڕەکانی پارتی دیموکراتی کوردستان. و ھێزەکانی ئێران توانیان دەست بەسەر شارۆچکەی حاجی ئۆمەراندا گرت. و ڕێکخراوەکانی مافی مرۆڤ دەڵێن ھێزەکانی عێراق لە سزای ئەمە نزیکەی ٨٠٠٠ ھاوڵاتی لە ناوچەی سەرکردەی پارتی دیموکراتی کوردستان (ناوچەی بارزان) کوشت.
    ساڵی ١٩٨٣ یەکێتی نیشتمانی کوردستان کۆتایی بە ناکۆکی خۆی ھێنا لەگەڵ حکومەتی عێراقی و دەستیان بە ڕێککەوتن کرد لەسەر حوکمی زاتی بۆ کورد.
    ساڵی ١٩٨٥ فشارێکی زۆر کەوتە سەر عێراق بۆ ڕاگرتنی شەڕ و حکومەتیش لە ڕووخاندا بوو، بەڵام میلیشیاکانی حکومەتی عێراقی براکەی جەلال تاڵەبانی و دوو کچەکەشی کوشت.
    ساڵی ١٩٨٦ حکومەتی ئێران سەرپەرستی دانوستانی نێوان پارتی دیموکراتی کوردستان و یەکێتی نیشتمانی کوردستانی کرد. لەبەر ئەوەی ھەردوو پارتە سیاسیەکە لە تارانەوە پشتیوانیان دەکرا.
    ساڵی ١٩٨٧ مەسعود بارزانی و جەلال تاڵەبانی ڕێککەوتن لەسەر یەکخستنی ھێزەکانیان و یەکگرتنیان لەگەڵ چەند ھێزێکی بچووکی تری ناوچەکە بۆ سەر خستنی شۆڕشی نوێ.
    ساڵی ١٩٨٨ وادەی شەڕی نێوان ئێران ـ عێراق نزیک بووەوە، حکومەتی عێراقی پرۆسەی ئەنفالی بەسەر کوردەکاندا جێ بە جێ کرد. و تێیدا ھەزارەھا خەڵکی سڤیل و شۆڕشگێڕ لەناو چوون، سەدان ھەزار کەس نەفی کران ھەموو ئەمانە لەبەر پووکانەوەی شۆڕشی کوردی بەرپاکرا.
    لـــە ١٦/٣/١٩٨٨ حکومەتی عێراق بە نامرۆڤانەترین شێوە و بە چەکی کیمیایی شارۆچکەی ھەڵەبجەی کوردستانی خاپوور کرد، دڕندانەترین کۆمەڵکوژی ڕوویدا بەھۆی گازی ژەھراویەوە کە تێیدا و دەستبەجێ ٥٠٠٠ کوردی بێ گوناە لە مناڵ و پیر و لاو تیاچوون. پاشتریش ھەزارەھا کەم ئەندام بوون بەھۆی تێکچوونی جیناتەکانیان.
    لــە ئــاداری سـاڵی ١٩٩١ پاش دەرکردنی ھێزەکانی عێراق لە کوەیت لە ھەمان ساڵدا، ھەندێ لە کوردەکان (جاشەکان) لە ھەردوو پارتەکە (پارتی دیموکراتی کوردستان و یەکێتی نیشتمانی کوردستان) ھەڵگەڕانەوە و وەک زمانحاڵی حکومەتی عێراقیکاریان دەکرد، بەڵام گەلی کورد و بە پاڵپشتی ویلایەتە یەکگرتووەکانی ئەمریکا ڕاپەڕینێکی گەورەی بەرپا کرد بێ گوێدان بە ھەڵگەڕاوەکان و تێیدا زیاتر لە(١٥٠٠٠٠٠) یەک میلیۆن و نیو کورد ئاوارە و سەرگەردانی وڵاتە دراوسێکان بوون، بەڵام وڵاتی تورکیا لەو کاتەدا سنووری خۆی داخست ئەمەش بووە ھۆی ئەوەی سەدان ھەزار کەس ئاوارەی کێو و چیاکان بن لە نێو چیا و دۆڵەکاندا بۆ ژیان و سەربەستی و ئازادی بگەڕێن.
    ناوچەی ئاسایش سەقامگیر:
    
    لە بەھاری ساڵی ١٩٩١ ھێزە ھاوپەیمانەکان بانگەشەی ناوچەیەکی ئازاد کراو و ئارام و ئاسایشیان کرد کە سنووری بە سنووری دەسەڵاتی حکومەتی عێراقیەوە بوو و چەندەھا ڕێکخراو دەزگا پشتیوانی و ھاوکاریان پێشکەش بە ئاوارەکانی ئەو ناوچەیە کرد، سەر لە نوێ مەسعود بارزانی و جەلال تاڵەبانی کەوتنە گفتوگۆ و دانوستانن لەگەڵ سەدام حسێنی سەرۆک کۆماری عێراق لەسەر مافی خود موختاری – ئۆتۆنۆمی.
    لــە تەمموزی ســاڵی ١٩٩١ دانیشتنەکان لەگەڵ حکومەتی بەغداد درێژەی کێشا، بەڵام ھێزەکانی پێشمەرگە توانیان ھەردوو پارێزگای سلێمانی و ھەولێر بە تەواوی کۆنترۆڵ بکەن و لە بەغدادی جیا بکەنەوە. کە تەحەدایەک بوو بۆ دەسەڵاتی حکومەتی عێراقی.
    لـە تشرینی یەکەمی سـاڵی ١٩٩١ شەڕی نێوان شۆڕشی کوردی و حکومەتی عێراقی ھەڵگیرسا، حکومەتی عێراقی سنوورەکانی باکووری عێراقی بە تەواوی توند کرد و ئابڵووقەی ئابووری بەسەر کوردەکاندا سەپاند.
    لــە ئایاری ساڵی ١٩٩٢ ھەڵبژاردنێکی پەرلەمانی سەرتاسەری لە ناوچەکە کراو، پارتی دیموکراتی کوردستان ڕێژەی ٥٠٫٨٪ ی دەنگەکانی بردەوە و یەکێتی نیشتمانی کوردستان ٤٩٫٢٪ی دەنگەکانی بەدەستھێنا، و حکومەتی نوێی کوردیان بە ڕێژەی یەکسان (٥٠٪) پێکھێنا.
    لە مانگی ئەیلوولی سـاڵی ١٩٩٢ کۆنگرێسی نیشتمانیی عێراقیی (INC) پێکھات کە کۆمەڵێکی زۆری لە نەیارەکان لەخۆ گرتبوو. لە ھاوینەھەواری سەڵاحەدین کە لە ژێر دەسەڵاتی کوردەکان بوو کۆدەبوونەوە. پارتی دیموکراتی کوردستان و یەکێتی نیشتمانی کوردستان نوێنەری بەشدار بووان بوون.
    لە ئایاری سـاڵی ١٩٩٤ دا ناکۆکیەکانی نێوان پارتی دیموکراتی کوردستان و یەکێتی نیشتمانی کوردستان شەڕی ناوخۆی لێکەوتەوە. یەکێتی نیشتمانی کوردستان ھەردوو شارۆچکەی شەقڵاوە و چەمچەماڵی لە دەسەڵاتی پارتی دیموکراتی کوردستان سەند.
    لە ئایاری سـاڵی ١٩٩٦ حکومەتی عێراقی لەگەڵ نەتەوە یەکگرتووەکان ڕێککەوت لەسەر پرۆگرامی (نەوت بەرامبەر بە خۆراک)، و ڕێژەی ١٣٪ی بڕی نەوتەکە بۆ باکوری عێراق بوو کە زۆربەی لە ژێر دەسەڵاتی ھەردوو پارتە کوردیەکەدا بوو.
    لە ئابی سـاڵی ١٩٩٦ مەسعود بارزانی داوای کۆمەکی لە حکومەتی عێراقی کرد بۆ سەرکەوتن بەسەر یەکێتی نیشتمانی کوردستاندا.
    لە ئەیلوولی سـاڵی ١٩٩٦دا پارتی دیموکراتی کوردستان بە یارمەتی حکومەتی عێراقی توانی ھەولێر لە دەسەڵاتی یەکێتی بسەنێتەوە و کۆنترۆڵی بکات. و سلێمانیشی لە ژێر دەسەڵاتی یەکێتینیشتمانی کوردستاندا دەرکرد، پارتی دیموکراتی کوردستان حکومەتێکی نوێی لە پەرلەمانی ھەولێر پێکھێنا.
    لە تشرینی یەکەمی سـاڵی ١٩٩٦ یەکێتی نیشتمانی کوردستان سلێمانی گرتەوە.
    لــە کانوونی دووەمی ساڵی ١٩٩٧ یەکێتی نیشتمانی کوردستان حکومەتێکی نوێی پێکھێنا کە بنکەکەی سلێمانی بوو. بەم شێوەیە باکووری عێراق بە تەواوی کەوتە کۆتنرۆڵی ھەردوو پارت (پارتی دیموکراتی کوردستان و یەکێتی نیشتمانی کوردستان) ەوە.
    لــە مانگی ئەیلوولی سـاڵی ١٩٩٨ ھەردوو سەرۆک پارتەکە (مەسعود بارزانی و جەلال تاڵەبانی) ڕێکەوتننامەیەکی ئاشتیانەیان ئیمزا کرد لە واشینگتۆن. لەگەڵ ئەوەشدا ناوچەکە وەکو خۆی مایەوە لەژێر دەسەڵاتی ھەردوو حکومەتەکە.
    لــە تشرینی دوومی ســاڵی ٢٠٠٠ یەکێتی نیشتمانی کوردستان نامەیەکی ئاڕاستەی ئەمینداری گشتی نەتەوە یەکگرتووکان کرد و تێیدا سکاڵای حکومەتی عێراقی کردبوو لە ڕاگواستن و دەرکردنی کوردەکانی پارێزگای کەرکووک.
    لە ئەیلوولی سـاڵی ٢٠٠١ شەڕێک بەرپا بوو لە ناوچەکانی سنووری سلێمانی لە نێوان یەکێتی نیشتمانی کوردستان و گروپێک بە ناوی جنود لئیسلام (جند ڕلاسلام), کە دواتر ناوەکەیان بوو بە ئەنێار و لئیسلام- ڕنێار الاسلام
    بەرەو یەکخستنەوەی نیشتمانی
    
    لە حوزەیرانی ساڵی ٢٠٠٢ پارتی دیموکراتی کوردستان و یەکێتی نیشتمانی کوردستان لەگەڵ ھەموو ئەو گروپە عێراقیانەدا دانیشتنیان سازدا کە بە نیاز بوون ھاوکاری ھێرشە عەسکەریەکەی نەتەوە یەکگرتوەکان بکەن لە ڕووخانی حکومەتی بەعسی عێراقی.
    لــە تشرینی یەکەمی ساڵی ٢٠٠٢ دانیشتنی ھاوبەش لە نێوان دیموکراتی کوردستان و یەکێتی نیشتمانی کوردستان دەستی پێکرد لە پەرلەمانی ھەولێر بۆ پێکھێنانی حکومەتێکی ھاوبەشی ئینتیقالی تــا وادەی ھەڵبژاردنێکی نوێ.
    لــە شوباتی ساڵی ٢٠٠٣ وەزیری دەرەوەی ئەمریکا (کۆڵن پاوڵ) گروپی ئەنسارو لئیسلامی بەوە تۆمەتبار کرد کە دەوریان ھەبووە لە پەیوەندی نێوان ئوسامە بن لادنی سەرۆکی ڕێکخراوی ئەلقاعیدە و حکومەتی عێراقی.
    لــە شوباتی ســاڵی ٢٠٠٣ سەرکردایەتی کورد ئەو پێشنیارەیان رەتکردەوە کە ھێزی عەسکەری تورکیا لە خاکی کوردستانەوە بێت و شانبەشانی ھێزەکانی نەتەوە یەکگرتووەکان لە ڕووخانی سەدام حسێن بەشدار بن و بۆ ئەم مەبەستەش ھەموو کوردستانیانی باکووری عێراق گەورەترین ڕێپێوانیان کرد دژ بەم پێشنیازە.
    لــە شوباتی ســاڵی ٢٠٠٣ لە پەرلەمانی کوردستان بە پرۆژە یاسایەک ئەو پلانەیان ڕەتکردەوە کە تێیدا ھاتبوو کە ھێزەکانی نەتەوە یەکگرتووەکان لە خاکی تورکیاوە ھێرش بکاتە سەر عێراق بۆ کردنەوەی دەروازەی بــاکوور.
    لــە٣/ ئاداری/ ٢٠٠٣ پارتی دیموکراتی کوردستان و یەکێتی نیشتمانی کوردستان سەرکردایەتیەکی ھاوبەشیان پێکھێنا بۆ سەرۆکایەتی ھەردوو سکرتێری پارتەکە مەسعود بارزانی و جەلال تاڵەبانی.
    لــە٢٠/ ئاداری/ ٢٠٠٣ ھێزە ھاوپەیمانەکان بە سەرکردایەتی نەتەوە یەکگرتووەکان ھێرشیان بۆ سەر عێراق دەستی پێکرد بە ھێرشی ئاسمانی و ھەردوو پارێزگای (کەرکووک و موسڵ) کە سنووریان بە ھەرێمی کوردستانەوەیە ڕووبەڕووی بۆردومانێکی چڕ بوونەوە.
    لــە٢٢/ ئاداری/ ٢٠٠٣ ھێزی کروزی ھاوپەیمانەکان بە ھێرشی ئاسمانی ساروخ توانیان لە گروپی بەناو ئەنسارو لئیسلام بدەن کە بارەگایان لە ناوچەی خورماڵ بوو بە سەدان کوژراوی لێکەوتەوە.
    لــە٢٧/ ئاداری/ ٢٠٠٣ سەدان مارێنزی ئەمریکی لە باکووری ھەولێر بە پەرەشووت نیشتنەوە و داخڵی خاکی کوردستان بوون. بەم شێوەیە دەروازی باکوور بۆ ھێزە ھاوپەیمانەکان کرایەوە تا بتوانن ھێرش بکەنە سەر حکومەتی عێراقی.
    لــە ٩/ نیسانی/ ٢٠٠٣ ھێرشی ھێزە ھاوپەیمانەکان بۆ سەر خاکی عێراق دەستی پێکرد و دەسەڵاتی حکومەت شکێنرا لە ناو شاری بەغداد، حکومەتی ھەرێمی کوردستانیش بە ھاوکاری ھێزە ھاوپەیمانەکان کۆنترۆڵی شاری کەرکوک و موسڵ بکەن.
    لــە حوزەیرانی ساڵی ٢٠٠٣ ئەنجومەنی حکومەتی ئینتیقالی بۆ یەکەمجار کۆبوونەوە, ھەردوو کوڕەکەی سەدام حسێن (عودەی و قوسەی) لە ھێرشێکی چەکداریدا کوژران.
    لــە ١/ شوبات / ٢٠٠٤ لە دوو ھێرشی خۆ کوژیدا سەدان کەس لە ھەردوو بارەگای لقی دووی پارتی دیموکراتی کوردستان و مەڵبەندی سێی ڕێکخستنەکانی یەکێتی نیشتمانی کوردستان کە بووە ھۆی کوشتنی زیاتر لە ٥٦ کەس و بریندار بوونی زیاتر لە ٢٠٠کەس، کە لەناویاندا چەند کەسایەتیکی ناسراوی تێدا بوو کە خاوەن پلەی بڵند بوون لە ھەردوو پارتەکەدا.
    لــە کانوونی دووەمی سـاڵی ٢٠٠٥ یەکەم ھەڵبژاردنی سەرتاسەری لە دوای ڕووخانی حکومەتی بەعسی عێراق کراو ھاپەیمانی کوردستانیش پلەی دووەمی لەو ھەڵبژاردنەدا بەدەستھێناو ٧٧ کورسی پەرلەمانی بەدەستھێنا.
    لە مانگی نیسانی ٢٠٠٥ دا جەلال تاڵەبانی سکرتێری یەکێتی نیشتمانی کوردستان بە سەرۆک کۆماری عێراق ھەڵبژێردرا لەلایەن پەرلەمانی کاتیی عێراقەوە.
    لــە مانگی ئایاری سـاڵی ٢٠٠٥ لە ھێرشێکی خۆ کوژیدا زیاتر لە ٥٠٠ پۆلیس و ئەفسەر شەھید بوون.
    
    پەرلەمانی کوردستان
    لــە حوزەیرانی سـاڵی ٢٠٠٥ دا یەکەم خولی پەرلەمانی لە ھەولێر پێکھێنرا و مەسعود بارزانی بە سەرۆکی ناوچەی ئۆتۆنۆمی ھەڵبژێردرا.
    لــە کانونی دووەمی سـاڵی ٢٠٠٥ کۆمپانیایەکی بیانی دەستی بە دەرھێنانی نەوت کرد لە باکووری عێراق (لە سنووری دەسەڵاتی حکومەتی ھەرێم) , ئەم ھەنگاوەش بووە ھۆی دروست بوونی ترس و دڵە ڕاوکێ لە دڵی سەرکردایەتی کوتلەی سوننی لە عێراق. دواتر حکومەتی ھەرێمی کوردستان راپۆرتێکی ئاشکرا کرد لەسەر بوونی بیرێکی گەورەی نەوت لە باکوور.
    لە تشرینی یەکەمی سـاڵی ٢٠٠٦ سەرۆک بارزانی داوای گۆڕینی ئاڵای عێراقی کرد بۆ ئاڵایەک کە گوزارشت لە ھەموو پێکھاتەو نەتەوەکانی عێراق بکات و وتیشی بەھیچ جۆرێک ئەو ئاڵایە لە خاکی کوردستان ھەڵنادرێت, بەڵام نوری مالیکی ووتی ئەم ئاڵایەی ئێستا ئاڵای عێراقە و دەبێت لە ھەموو گۆشەیەکی عێراق ھەڵبدرێت.
    لە تشرینی یەکەمی سـاڵی ٢٠٠٦ لە پێنج کردەوەی خۆکوژی لە کەرکووک ڕوویدا کە یەکێکیان لە ئۆتۆمبێلێکی بار ھەڵگر و ئەوانیتریش ئۆتۆمبێلی بچووک بوون بووە ھۆی کوشتنی زیاتر لە ٢٣ ھاوڵاتی.
    لە کەناڵی (BBC) دابەزێنرا کە تێیدا ھاتووە ھێزە کوردیەکان لەلایەن ھێزە ئیسرائیلیەکان بە نھێنی مەشقیان پێ کراوە لەسەر چۆنێتی بەرەنگار بوونەوەی تیرۆر و پارێزگاری کردنی فرۆکەخانەی نێودەوڵەتی.
    لــە نیسانی ســاڵی ٢٠٠٧ دا سەرۆکی سوپای تورکیا وتی پێویستە تورکیا ھێرش بکاتە سەر ھێزە کوردە ھەڵگەراوەکانی باکووری عێراق – گەریلاکان.
    لــە ئایاری ســاڵی ٢٠٠٧ دا ھێزە کوردیەکان ئاسایشی ھەرسێ پارێزگای (دھۆک , ھەولێر، سلێمانی) لە ھێزە ھاوپەیمانەکان وەرگرتەوە.
    لــە تەمموزی ســاڵی ٢٠٠٧ ڕێکخراوی مافی مرۆڤی جیھانی ڕاپۆرتێکی لەسەر خراپی گوزەران و ژیانی بەندیخانەکانی ژێر دەسەڵاتی کوردەکان لە باکووری عێراق بڵاو کردەوە.
    لــە ئابــی ســاڵی ٢٠٠٧ لە چەند کردەوەیەکی خۆکوژی بە نارنجۆکی دەستی بووە ھۆی کوشتنی زیاتر لە ٣٠٠ کەس لە یەزیدیەکان لە باکووری عێراق.
    لــە ئەیلوولی ســاڵی ٢٠٠٧ ئێران بۆردوومانی ناوچە سنووریەکانی باکووری عێراقی کرد. ئێران سنوورەکانی لەگەڵ حکومەتی ھەرێمی کوردیتان داخست بە بیانووی ئەوەی ھاوڵاتیە ئێرانیەکان لەلایەن ھێزە کانی نەتەوە یەکگرتووەکان دەستگیر دەکرێن.
    ھێرشەکانی تــورکیــا
    لــە تشرینی یەکەمی ســاڵی ٢٠٠٧ پەرلەمانی تورکیا ئیشارەتی سەوزی بۆ ھێزی سوپا ھەڵکرد بۆ ھێرش کردنە سەر کوردە ھەڵگەڕاوەکانی باکووری عێراق، تورکیا فشاری نێودەوڵەتی خرایەسەر بەوەی ھێرش دەکاتە سەر سنوور.
    لــە کانوونی یەکەمی ســاڵی ٢٠٠٧ تورکیا بە ھێرشی ئاسمانی بۆردومانی ھێزەکانی پارتی کرێکارانی کوردستانی کرد لەناو خاکی عێراق.
    لــە شوباتی ســاڵی ٢٠٠٨ تورکیا ھێرشی سوپایی کردە سەر ھێزەکانی پارتی کرێکارانی کوردستانی کرد لەناو خاکی عێراق.
    لــە ئەیلوولی ســاڵی ٢٠٠٨ پەرلەمانی عێراق پرۆژە یاسای ھەڵبژاردنی پارێزگاکانی عێراقی پەسەند کرد. بەڵام کەرکووکی لەناو پارێزگاکانداجیا کردەوە، چونکە کوردەکان دەیانبردەوە.
    لــە نیسانی ســاڵی ٢٠٠٩ تورکیا بە فرۆکە جەنگیەکانی ھێرشی کردەوە سەر پارتی کرێکارانی کورستان بە بیانووی ئەوەی پارتی کرێکاری کوردستان لە دوو ھێرشدا بوونەتە ھۆی کوشتنی سەربارزانی تورک.
    لــە حوزەیرانی ســاڵی ٢٠٠٩ حکومەتی ھەرێمیکوردستان نەوتی ھەناردەی بازاڕەکانی دەرەوە کرد، بڕی ٩٠٬٠٠٠ بۆ ١٠٠٬٠٠٠ بەرمیل لە ڕۆژێکدا لەکێڵگەکانی کوردستانەوە بەرەو تورکیا دەنێررێت. حکومەتی ناوەندی بە مەرجی وەرگرتنەوەی ڕێژەی یاسایی لە حکومەتی ھەرێم مۆڵەتی دەرکردنی نەوتی داوە.
    لــە تەمموزی ســاڵی ٢٠٠٩ مەسعود بارزانی بۆ جارێکی تر بە سەرۆکی ھەرێمی کوردستانی فیدراڵ ھەڵبژێردرایەوە, و لیستی ھاوپەیمانی کوردستان کە پێکھاتووە لە (پارتی دیموکراتی کوردستان و یەکێتی نیشتمانی کوردستان) زۆرینەی دەنگەکانیان بەدەست ھێنا و لیستێکی نوێش بە ناوی گۆڕان توانی ڕێژەی ٢٥ کورسی پەرلەمان لە کۆی ١١١ کورسی بەدەست بھێنێت.
    لــە شوباتی ســاڵی ٢٠١١ خۆپیشاندان دژی ئەو گەندەڵیانە سازدرا کە لەلایەن ھەردوو (پارتی دیموکراتی کوردستان و یەکێتی نیشتمانی کوردستان) وە دەکرێت لە سلێمانی , و گروپی گۆڕان ڕێکخەری خۆپیشاندانەکەبوو، و تێیدا دوو خۆپیشاندەر کوژران.
    
    ئابووری
    ئابووری ھەرێمی کوردستان پشت ئەبەستێت بە داھاتی نەوت، کشتوکاڵ‌ و گەشتیاری. بەھۆی ئەو سەقامگیرییە ڕێژەییەی کوردستان، ھەرێمەکە لە ڕووی ئابوورییەوە لە ناوچەکانی تری عێراق پێشکەوتووترە.
    
    پێش لابردنی سەدام حسێن، حکومەتی ھەرێمی کوردستان نزیکەی ١٣٪ی داھاتی پڕۆگرامی نەوت بە خۆراکی عێراقی وەردەگرت. بە ھاتنی ٢٠٠٣‌و ئازادکردنی عێراق لەلایەن ئەمریکاوە، پڕۆگرامەکە ٨٫٣٥ میلیارد دۆلاری لە کوردستاندا خەرج کردبوو. ئاسایشی خۆراکی کوردستانی عێراق وایکرد کە زۆرینەی داھاتەکان لە پڕۆژەی گەشەسەندن دا سەرف بکرێن وەک لە ناوچەکانی تری عێراق. بە کۆتاییھاتنی پڕۆگرامەکە لە کۆتایی ٢٠٠٣ دا، ٤ میلیارد دۆلار لە داھاتی نەوت بە خۆراکی حکومەتی ھەرێمی کوردستان بە خەرجنەکراوی مابووەوە.
    
    دوا بەدوای لابردنی حکومەتەکەی سەدام حسێن‌ و زنجیرە توند‌وتیژییەکەی بەدوایداھات، سێ پارێزگاکەی ژێر دەسەڵاتی حکومەتی ھەرێمی کوردستان تەنھا سێ پارێزگای عێراقیی بوون کە سوپای ئەمریکی بە "ئارام" پۆلینیان کردبوو. ئەو ئارامییە رێژەییەی ھەرێمەکە رێی دا حکومەتی ھەرێمی کوردستان چەند گرێبەستێکی وەبەرھێنان لەگەڵ کۆمپانیا بیانییەکاندا مۆر بکات. لە ٢٠٠٦ دا، یەکەم بیرە نەوت لە دوای ئازادکردنی عێراقەوە لە ھەرێمی کوردستان لێدرا لەلایەن کۆمپانیایەکی وزەی نەرویجییەوە بەناوی "دی. ئێن. ئۆ". لە سەرەتادا وا دەرکەوت کە کێڵگە نەوتییەکە لانی کەم ١٠٠ میلیۆن بەرمیل نەوتی تیا بێت‌و لە سەرەتای ٢٠٠٧ دا رۆژانە ٥٠٠٠ بەرمیل نەوتی لێ دەربھێنرێت. حکومەتی ھەرێمی کوردستان رێکەوتننامەی گەڕانیان مۆرکردووە لەگەڵ دوو کۆمپانیای تری نەوت دا، "وێسترن ئۆیەڵ ساندس"ی کەنەدی‌و "ستێرلین ئینرجی" بریتانی. سەقامگیرییەکەی ھەرێمی کوردستان بووەتە ھۆی ئەوەی لە بەشەکانی تری عێراق پێشکەوتنی زیاتر بەخۆوە ببینێت. لە ٢٠٠٤ داھاتی تاکەکەس لە ھەرێم بە رێژەی ٢٥٪ لە ناوچەکانی تری عێراق زیاتر بوو. دوو فڕۆکەخانەی نێودەڵەتی لە ھەولێر‌و سلێمانی ھەیە کە بە گەشتی ئاسمانیی بەستراونەتەوە بە وڵاتانی خۆرەڵاتی ناوەڕاست‌و ئەوروپاوە. حکومەتەکە بەردەوامە لە وەرگرتنی داھاتی ھەناردەکردنی نەوتی عێراق، و بەم زووانەش یاسایەکی یەکخراو بۆ وەبەرھێنانی بیانی دەردەکات. حکومەتی ھەرێمی کوردستان پلانی بۆ دروستکردنی شارێکی میدیایی لە ھەولێر‌و چەند ناوچەیەکی بازرگانیی ئازاد لە نزیک ناوچە سنوورییەکان لەگەڵ ئێران‌و تورکیادا بنیاد بنێت.
    
    لە ساڵی ٢٠٠٣ وە، ھێزە ئابوورییە بەھێزەکەی کوردستان زیاتر لە ٢٠٠٠٠ کرێکاری عەرەبی لە ناوچەکانی تری عێراقەوە راکێشاوە. بە وتەی جەلال تاڵەبانی سەرۆک کۆماری عێراق، لە ٢٠٠٣وە ژمارەی میلیۆنێرەکانی شاری سلێمانی لە ١٢ەوە بووە بە ٢٠٠٠، ئەمەش دەرخەری گەشەی ئابووری ھەرێمەکەیە.
    
    جوگرافیا
    OOjs UI icon article-ltr.svg وتاری سەرەکی: جوگرافیای ھەرێمی کوردستان
    کوردستانی عێراق بە گشتی ناوچەیەکی شاخاوییە کە لە بەرزترین خاڵدا ٣٦١١ مەتر لە ئاستی دەریا بەرزە، ناوچەکە بە "چیکەدار" ناودەبرێت. چەندین ڕووبار بەنێو شاخەکاندا تێدەپەڕن‌و ناوچەکە تایبەتمەند ئەکەن بە زەوی بەپیت‌و ئاوی زۆر‌و سروشتێک کە لە وێنە بچێت.
    
    سروشتە شاخاوییەکەی کوردستان، جیاوازیی پلەی گەرما لە ناوچە جیاجیاکانی‌و دەوڵەمەندییەکەی بە سامانی ئاو وا لە کوردستان ئەکەن ببێت بە ناوچەیەکی کشتوکاڵی‌و گەشتیاری. سەرەڕای ئەمانە، چەند کانزایەک، بەتایبەت نەوت، کە بۆ ماوەیەکی درێژ لەرێگەی ھێڵی بۆرییەوە لە کوردستان دەردەھێنرا.
    
    گەورەترین دەریاچەی ھەرێم دەریاچەی دوکانە و زێی بچوک لە تەق تەق.
    
    دەستەواژەی "باکوری عێراق" ناڕوونییەکی جوگرافی لە بەکارھێنانیدا ھەیە. "باکور" بەگشتی بۆ ئاماژەکردن بە ھەرێمی کوردستان بەکاردەھێنرێت. "ناوەڕاست"‌و "باشوور" یان "ناوەڕاست- باشوور" بە تایبەت بۆ ئەو ناوچانەی عێراق بەکاردێن کە ھەرێمی کوردستانی لێ بەدەر کرابێت. زوربەی سەرچاوەکانی راگەیاندن زۆر جار "باکور" و "باکوری عێراق" بۆ ھەر ناوچەیەک بەکاردەھێنن کە بکەوێتە باکوری بەغداوە.
    
    کەش و ھەوا
    تێکرای گەرمی مانگی کانوونی دووەم کەساردترین مانگی ساڵە لەھەرێمدا لەنێوان (٣٫١) پلەی سەدیدایە لەوێستگەی سەڵاحەدین، (٩٫٩) سەدیە لەخانەقین، بەگشتی چەند بەرەو باکورو باکوری رۆژھەڵاتی ھەرێم بڕۆین پلەی گەرمی دادەبەزێت لەبەرئەوەی چەند بەرەوە باکورو باکوری رۆژھەڵات بچین زەوییەکە بەرزو بڵند دەبێت، لایەکانی باکووری ھەرێم دەکەونە ئەو ناوچانەی کەلەکەمەرەی زەوییەوە دورترن کە دەبێتە ھۆی کورتی رۆژ لەنیوەی زستانی ساڵدا و کەمبوونەوەی گۆشەی تیشکی ھەتاو کەوتن. کەمی لاربوونەوەی گۆشەی کەوتنی تیشکی ھەتاو ھەروەھا رۆژ درێژی و ساماڵ و تۆپەڵی ھەوایی کیشوەری وشک کە لەھاویناندا ھەرێم دەگرێتەوە، یاریدەی بەرزبوونەوەی پلەکانی گەرما دەدەن لەو وەرزەدا. تێکڕاکانی گەرمای مانگی تەمووز کەگەرمترین مانگی ساڵە لەھەرێمدا لە ٣٠ پلەی سەدی پترە. جیاوازییەکی زۆر لەبڕی باران بارین لەھەرێمدا ھەیە ناوەندی بارانی ساڵانە لەھەرێمدا لەنێوان ٣٢٨ ملم دایە لەخانەقین و زیاتر لە ٧٠٢ملم لە زاخۆ و لەرواندز٦٩٦ ملم و لەئاکرێ ١٠٠٨ ملم و لەپێنجوێن ١٢٦٣ ملم، بەگشتی لەبارەی بڕی بارانی داباریو لەھەرێمدا دەتوانین بڵێین کەبارانی ھەرێم تابەرەو باکورو باکوری رۆژھەڵات بڕۆین پتر دەبێت، ئەمەش لەبەر ھۆکاری بەرزی و نزمی لەلایەک گوزەرکردنی ژمارەیەکی زۆرتر لە نەوراییەکانی کەش وھەوا بە ھەرێمدا جگە لەوەی کە جۆری نەوراییەکانیش تا بەرەو باکوور بڕۆین قوڵتر دەبن، لەڕووی بارانەوە دەتوانین ھەرێم بۆ دوو ھەرێمی لاوەکی دابەش بکەین کەبریتیە لە
    
    ھەرێمی بارانی مسۆگەر
    ھەرێمی بارانی نامسۆگەر
    ھەرێمی بارانی مسۆگەر
    ئەم ھەرێمە بەشەکانی باکوور و باکووری رۆژھەڵاتی ھەرێمی کوردستانی عیراق دەگرێتەوە و سنوورەکانی باشوری لەگەڵ سنوری باشوری ناوچەی شاخاوی لەھەرێمدا دەڕۆن ئەم ھەرێمە بەزۆری رێژەی بارانەکەی جیادەکرێتەوە کەناوەندی ساڵانەی باران ٥٠٠ملم کەمتر نییە، بۆیە کشتوکاڵی زستانە لەم ھەرێمەدا ساڵانە ئەم ھەرێمە دەتوانێت بەتەواوی پشت بەباران ببەستێت.
    
    ھەرێمی بارانی نامسۆگەر
    ئەم ھەرێمە ناوچە نیمچە شاخاوییەکان دەگرێتەوە کەبەرێژە بارانی کەمە (ساڵانە لە ٥٠٠ملم) کەمترە، ئەم ھەرێمە لاوەکییە دیسان بەوە ناسراوە کەبڕی بارانی مانگانە و ساڵانە و وەرزانە ھەڵبەز و دابەزێکی گەورە بەخۆیەوە دەبینێت بەبەراورد کردن لەگەڵ ھەرێمی پێشوودا، بۆیە کشتوکاڵی زستانەی بەتایبەتی لەبەشەکانی باشورو باشوری رۆژئاوادا رەنگە روبەڕوی ھەڕەشەی وشکی ببێتەوە.
    
    پارێزگاکان
    کوردستانی عێراق دابەش کراوە بەسەر ٧ پارێزگادا کە ئێستا سیانیان لەژێر دەسەڵاتی حکومەتی ھەرێمی کوردستاندان.
    ئەو پارێزگایانەی کە بەتەواوی لەژێر دەسەڵاتی حکومەتی ھەرێمی کوردستاندان ئەمانەن:
    
    سلێمانی
    ھەولێر
    دھۆک
    ئەو پارێزگایانەی کە حکومەتی ھەرێمی کوردستان داوای بەشێکی یان تێکڕای دەکات:
    
    کەرکوک (تێکڕا)
    دیالە - خانەقین و کفری
    نەینەوا- ئاکرێ و شێخان و شەنگال
    سەڵاحەدین - توز
    واست
    پلان بۆ ڕاپرسییەک دانرا لە ١٥ی تشرینی دووەمی ٢٠٠٧ بۆ بڕیاردان لەسەر گەڕانەوە یان نەگەڕانەوەی پارێزگاکان یان بەشەکانیان بۆ ژێر دەسەڵاتی حکومەتی ھەرێمی کوردستان. ئەم ریفراندۆمە دەیویست ھەموو ناوچەکانی پارێزگای کەرکوک، خانەقین‌ و کفری لە پارێزگای دیالە، توزخورماتی لە پارێزگای سەڵاحەدین، ئاکرێ‌ و شێخان لە پارێزگای نەینەوا بگرێتەوە. ئەم راپرسییە دواخرا بۆ ٣١ی کانوونی یەکەمی ٢٠٠٧، و دواتر بۆ شەش مانگی تر درێژکرایەوە. کوردەکان پێداگری لە ھەرچیزووتر جێبەجێکردنی راپرسییەکە دەکەن.
    
    شارە گەورەکان
    
    ھەولێر
    سلێمانی
    دھۆک
    کەلار
    زاخۆ
    قەڵادزێ
    دیمۆگرافیا
    ژمارەی دانیشتوانی ھەرێم نزیکەی ٥-٦ میلیۆن کەسە کە ٩٥٪ کوردی موسوڵمانن‌و سەر بە مەزهەبی سوننەن. ژمارەیەکی بەرچاوی ئێزیدی و کاکەیی، جولەکە و مەسیحییش ھەن. لە ڕووی نەتەوەییەوە کوردەکان زۆرینەی ناوچەکە (نزیکەی ٩٥٪) پێک دێنن‌ و ئەوی تر لە تورکمانی عێراق و ئاشووریی و ئەرمەن‌ و عەرەبەکانی پێکھاتووە کە بە گشتی لە نیشتەجێ‌ی بەشی خۆراوای ھەرێمەکەن.
    
    زاراوەی بابانی لە سلێمانی و زاراوەی ھەولێری لە ھەولێر قسەی پێ دەکرێ. زاراوەی ھەولێری وێکچونێکی زۆری لەگەڵ زاراوەی موکریانی دا ھەیە کە لە مەڵبەندی موکریان و شارەکانی پیرانشار و مەھاباد دا قسەی پێ دەکرێ. ھەروەھا زاراوەی بابانی وێکچونێکی زۆری لەگەڵ زاراوەی جافی دا ھەیە کە لە مەڵبەندی کرماشان دا قسەی پێ دەکرێ.
    
    ژمارەی دانیشتوان
    بەپێی سەرژمێرییەکانی ساڵانی ١٩٢٧-١٩٨٧ بەمجۆرە بووە:
    
    لەساڵی ١٩٢٧ ژمارەی ئەم بەشەی کوردستان ٦١٣٫٣٤٧ کەس بووە
    ساڵی ١٩٣٧ رێژەکەی گەیشتۆتە ١٫٠١٠٫٩٠٥کەس.
    لە ساڵی ١٩٤٧ گەیشتۆتە ١٫٢٨٢٫٣٧٨ کەس.
    لە ساڵی ١٩٥٧ ژمارەی دانیشتوانەکەی گەیشتۆتە ١٫٨٢٢٫٣٩٠کەس.
    لە ١٩٦٥ گەیشتۆتە ٢٫٢١٧٫١٠٩کەس.
    بەپێی سەرژمێرییەکەی ساڵی١٩٧٧ ی گەیشتە ٣٫٣٠٣٫٣٠٠ کەس.
    لەساڵی ١٩٨٧ یش گەیشتە٤٫٤٨٦٫٦٩٧ کەس.
    

EOT;
}
