<?php
namespace Faker\Provider\fa_IR;

class Address extends \Faker\Provider\Address
{
    protected static $country = array(
        'آذربایجان', 'آفریقای جنوبی', 'آفریقای مرکزی', 'آلمان', 'آنتیگوا و باربودا', 'آندورا', 'آنگولا', 'آرژانتین', 'آلبانی',
        'اتریش', 'اتیوپی', 'اردن', 'ارمنستان', 'اریتره', 'ازبکستان', 'اسپانیا', 'استرالیا', 'استونی', 'اسلوواکی', 'اسلوونی', 'افغانستان', 'الجزایر', 'السالوادور', 'امارات متحده عربی', 'امریکا', 'اندونزی', 'اوروگوئه', 'اوگاندا', 'اوکراین', 'اکووادور', 'ایتالیا', 'ایران', 'ایرلند', 'ایسلند',
        'باربادوس', 'باهاما', 'بحرین', 'برزیل', 'برونئی', 'بریتانیا', 'بلاروس', 'بلژیک', 'بلغارستان', 'بلیز', 'بنگلادش', 'بنین', 'بوتان', 'بوتسوانا', 'بوروندی', 'بورکینافاسو', 'بولیوی',
        'پاپواگینه نو', 'پاراگوئه', 'پاناما', 'پاکستان', 'پرتغال', 'پرو',
        'تاجیکستان', 'تانزانیا', 'تایلند', 'ترکمنستان', 'ترکیه', 'ترینیداد و توباگو', 'توگو', 'تونس', 'تونگا', 'تووالو', 'تایوان-چین تایپه',
        'جامائیکا', 'جزایر سلیمان', 'جیبوتی',
        'جمهوری جزایر مارشال', 'جمهوری چک',
        'چاد', 'چین',
        'دانمارک', 'دومنکن', 'دومنیکا',
        'روآندا', 'روسیه', 'رومانی',
        'زئیر-جمهوری کنگو', 'زامبیا', 'زلاندنو', 'زیمباوه',
        'ژاپن',
        'سائوتومه و پرنسیپ', 'ساحل عاج-کوت دیوار', 'ساموای غربی', 'سان مارینو', 'سریلانکا', 'سشیل', 'سنت لوسیا', 'سنت وینست و گرنادین', 'سنت کیتس و نویس', 'سنگاپور', 'سنگال', 'سوئد', 'سوئیس', 'سوازیلند', 'سودان', 'سورینام', 'سوریه', 'سومالی', 'سیرالئون',
        'شیلی',
        'صربستان و مونته نگرو',
        'عراق', 'عربستان', 'عمان',
        'غنا',
        'فرانسه', 'فنلاند', 'فیجی', 'فیلیپین',
        'قبرس', 'قرقیزستان', 'قزاقستان', 'قطر',
        'کاستاریکا', 'کامبوج', 'کامرون', 'کانادا', 'کرواسی', 'کرۀ جنوبی', 'کرۀ شمالی', 'کلمبیا', 'کنیا', 'کوبا', 'کویت', 'کیپ ورد', 'کیریباس',
        'گابون', 'گامبیا', 'گراندا', 'گرجستان', 'گواتمالا', 'گویان', 'گینه', 'گینۀ استوائی', 'گینۀ بیسائو',
        'لائوس', 'لاتوی', 'لبنان', 'لسوتو', 'لهستان', 'لوکزامبورک', 'لیبریا', 'لیبی', 'لیتوانی', 'لیختن اشتاین',
        'ماداگاسکار', 'مالاوی', 'مالت', 'مالدیو', 'مالزی', 'مالی', 'مجارستان', 'مصر', 'مغرب- مراکش', 'مغولستان', 'مقدونیه', 'موریتانی', 'موریس', 'موزامبیک', 'مولدووا', 'موناکو', 'مکزیک', 'میانمار(برمه)', 'میکرونوزی',
        'نائورو', 'نامبیا', 'نپال', 'نروژ', 'نیجر', 'نیجریه', 'نیکاراگوئه',
        'واتیکان', 'وانواتو', 'ونزوئلا', 'ویتنام',
        'هائیتی', 'هلند', 'هندوراس', 'هندوستان',
        'یمن', 'یونان'
    );
    protected static $state = array(
        'آذربایجان شرقی', 'آذربایجان غربی', 'اردبیل', 'اصفهان', 'البرز', 'ایلام', 'بوشهر', 'تهران', 'چهارمحال بختیاری', 'خراسان جنوبی', 'خراسان رضوی', 'خراسان شمالی', 'خوزستان', 'زنجان', 'سمنان', 'سیستان و بلوچستان', 'فارس', 'قزوین', 'قم', 'کردستان', 'کرمان', 'کرمانشاه', 'کهکیلویه و بویراحمد', 'گلستان', 'گیلان', 'لرستان', 'مازندران', 'مرکزی', 'هرمزگان', 'همدان', 'یزد'
    );
    protected static $city = array(
        'ابرکوه', 'ابهر', 'ابوموسی', 'اراک', 'اردبیل', 'اردستان', 'اردکان', 'اردکان', 'اردل', 'ارسنجان', 'ارومیه', 'ازنا', 'استهبان', 'اسدآباد', 'اسفراین', 'اسکو', 'اسلام آباد غرب', 'اسلامشهر', 'اشتهارد', 'اشکذر', 'اشکنان', 'اشنویه', 'اصفهان', 'اقلید', 'البرز', 'الشتر', 'الیگودرز', 'املش', 'امیدیه', 'انبارآلوم', 'اندیمشک', 'انگهران', 'اهر', 'اهرم', 'اهواز', 'اوز', 'ایج', 'ایذه', 'ایرانشهر', 'ایزد خواست', 'ایلام', 'اینچه برون', 'ایوان', 'ایوانکی',
        'آب بر', 'آبادان', 'آباده', 'آباده طشک', 'آبپخش', 'آبدانان', 'آبیک', 'آذر شهر', 'آران و بیدگل', 'آزاد شهر', 'آسارا', 'آستارا', 'آستانه اشرفیه', 'آشتیان', 'آشخانه، مانه و سمرقان', 'آق قلا', 'آمل',
        'باب انار', 'بابک', 'بابل', 'بابلسر', 'بازرگان', 'باغ بهادران', 'باغ ملک', 'بافت', 'بافق', 'بالاده', 'بانه', 'بجستان', 'بجنورد', 'برازجان', 'بردسکن', 'بردسیر', 'بروجرد', 'بروجن', 'بستان', 'بستان آباد', 'بستک', 'بسطام', 'بشرویه', 'بلده', 'بم', 'بناب', 'بنارویه', 'بندر جاسک', 'بندر دیر', 'بندر دیلم', 'بندر شرفخانه', 'بندر کنگان', 'بندر گز', 'بندر گناوه', 'بندر لنگه', 'بندر ماهشهر', 'بندرامام خمینی', 'بندرانزلی', 'بندرعباس', 'بهار', 'بهبهان', 'بهشهر', 'بهمن', 'بوانات', 'بوشهر', 'بوکان', 'بومهن', 'بوئین زهرا', 'بیجار', 'بیرجند', 'بیرم', 'بیضا', 'بیله سوار',
        'پارس آباد', 'پارسیان', 'پاکدشت', 'پاوه', 'پل سفید', 'پلدختر', 'پلدشت', 'پیرانشهر',
        'تازه آباد', 'تاکستان', 'تایباد', 'تبریز', 'تربت جام', 'تربت حیدریه', 'ترکمن', 'تسوج', 'تفت', 'تفرش', 'تکاب', 'تنکابن', 'تنگستان', 'تهران', 'تویسرکان', 'تیران',
        'جاجرم', 'جزیره خارک', 'جغتای', 'جلفا', 'جلین', 'جم', 'جنت شهر', 'جهرم', 'جوانرود', 'جویبار', 'جوین', 'جیرفت',
        'چابهار', 'چالوس', 'چلگرد', 'چناران', 'چهاردانگه',
        'حاجی آباد', 'حاجی آباد',
        'خاش', 'خان ببین', 'خاوران', 'خرامه', 'خرم آباد', 'خرم آباد', 'خرمدره', 'خرمشهر', 'خشت', 'خضری', 'خفر', 'خلخال', 'خلیل آباد', 'خمام', 'خمین', 'خمینی شهر', 'خنج', 'خواف', 'خوانسار', 'خور', 'خورموج', 'خوسف', 'خوی',
        'داراب', 'دامغان', 'درگز', 'دره شهر', 'دزفول', 'دشتستان', 'دشتی', 'دلوار', 'دلیجان', 'دماوند', 'دهاقان', 'دهبارز', 'دهدشت', 'دهگلان', 'دهلران', 'دورود', 'دوگنبدان', 'دولت آباد', 'دیواندره',
        'راسک', 'رامسر', 'رامشیر', 'رامهرمز', 'رامیان', 'راور', 'رزن', 'رستم کلا', 'رشت', 'رشتخوار', 'رضوان شهر', 'رفسنجان', 'رود سر', 'رودبار', 'رودهن', 'رونیز علیا', 'ری',
        'زابل', 'زاهدان', 'زاهدشهر', 'زرقان', 'زرند', 'زرین آباد', 'زرین شهر', 'زنجان', 'زیباشهر',
        'ساری', 'سامان', 'ساوه', 'سبزوار', 'سپید دشت', 'سده', 'سر پل ذهاب', 'سراب', 'سرابله', 'سراوان', 'سرایان', 'سرباز', 'سربیشه', 'سرخس', 'سرخس کلاته', 'سرخه', 'سردشت', 'سرعین', 'سروستان', 'سعادت شهر', 'سقز', 'سلماس', 'سلمانشهر', 'سمنان', 'سمیرم', 'سنقر کلیائی', 'سنندج', 'سواد کوه', 'سورمق', 'سوسنگرد', 'سی سخت', 'سیاهکل', 'سیرجان', 'سیمین شهر', 'سیمینه', 'سیه چشمه',
        'شادگان', 'شازند', 'شاهرود', 'شاهین دژ', 'شاهین شهر', 'شبستر', 'شریف آباد', 'ششده', 'شفت', 'شهر جدید هشتگرد', 'شهر رباط کریم', 'شهر شهریار', 'شهرضا', 'شهرکرد', 'شهمیرزاد', 'شوش', 'شوشتر', 'شوط', 'شیراز', 'شیروان', 'شیروان چرداول',
        'صحنه', 'صغاد', 'صفاشهر', 'صوفیان', 'صومعه سرا',
        'طالقان', 'طبس', 'طبس', 'طرقبه',
        'عجبشیر', 'عسلویه', 'علاء مرودشت', 'علی آباد کتول', 'عنبر',
        'فارسان', 'فاروج', 'فاضل آباد', 'فراشبند', 'فردوس', 'فریدن', 'فریدون شهر', 'فریدون کنار', 'فریمان', 'فسا', 'فشم', 'فلاورجان', 'فولاد شهر', 'فومن', 'فیروز آباد', 'فیروزکوه',
        'قادر آباد', 'قائم شهر', 'قائمیه', 'قائن', 'قدس', 'قره آغاج', 'قروه', 'قزوین', 'قشم', 'قصر شیرین', 'قطب آباد', 'قم', 'قهدریجان', 'قوچان', 'قیدار', 'قیر',
        'کازرون', 'کاشان', 'کاشمر', 'کامیاران', 'کبودر اهنگ', 'کرج', 'کردکوی', 'کرمان', 'کرمانشاه', 'کلات', 'کلاچای', 'کلاله', 'کلیبر', 'کمیجان', 'کنار تخته', 'کندوان', 'کنگاور', 'کهریزک', 'کهنوج', 'کوار', 'کوهدشت', 'کیش', 'کیوی',
        'گالیکش', 'گچساران', 'گراش', 'گرگان', 'گرمسار', 'گرمی', 'گلپایگان', 'گلدشت اصفهان', 'گلدشت مرکزی', 'گلستان تهران', 'گلوگاه', 'گمیش تپه', 'گناباد', 'گنبد کاووس', 'گیلان غرب',
        'لار', 'لالی', 'لامرد', 'لاهیجان', 'لپوئی', 'لردگان', 'لطیفی', 'لنگرود', 'لواسان بزرگ', 'لوشان',
        'ماسال', 'ماسوله', 'ماکو', 'ماهنشان', 'مبارک آباد دیز', 'مبارکه اصفهان', 'محلات', 'محمود آباد نمونه', 'محمودآباد', 'مراغه', 'مراوه تپه', 'مرزن آباد', 'مرند', 'مرودشت', 'مریوان', 'مسجد سلیمان', 'مشکان', 'مشگین شهر', 'مشهد', 'مصیر', 'مغان', 'ملارد', 'ملایر', 'ملکان', 'ممقان', 'منجیل', 'منوجان', 'مهاباد', 'مهاباد', 'مهدیشهر', 'مهر فارس', 'مهران', 'مهریز', 'میاندوآب', 'میانه', 'میبد', 'میرجاوه', 'میمند', 'میناب', 'مینو دشت',
        'نایین', 'نجف آباد', 'نطنز', 'نظرآباد', 'نقده', 'نکا', 'نگین شهر', 'نمین', 'نهاوند', 'نهبندان', 'نوبندگان', 'نودان', 'نوده خاندوز', 'نور', 'نورآباد', 'نورآباد', 'نوشهر', 'نوکنده', 'نی ریز', 'نیر', 'نیشابور', 'نیکشهر',
        'هادیشهر', 'هرات', 'هرسین', 'هرند', 'هریس', 'هشتپر', 'هشترود', 'هشتگرد', 'همدان', 'هندیجان', 'هویزه',
        'ورامین', 'ورزقان',
        'یاسوج', 'یزد',
    );

    protected static $streetPrefix = array(
        'آزادراه', 'اتوبان', 'بزرگراه', 'تقاطع', 'جاده', 'چهارراه', 'خیابان', 'خیابان شهید', 'فرعی', 'نبش', 'کوچه', 'کوچه شهید', 'بن بست',
    );
    protected static $buildingNamePrefix = array(
        'آپارتمان', 'ساختمان', 'مجتمع مسکونی', 'مجتمع اداری', 'مجتمع', 'مغازه', 'منزل'
    );
    protected static $buildingNumber = array('###', '##', '#');

    protected static $postcode = array('##########', '#####-#####');

    protected static $buildingNameFormat = array(
        '{{buildingNamePrefix}} {{firstName}}',
    );
    protected static $cityFormats = array(
        '{{firstName}}‌{{citySuffix}}',
    );
    protected static $streetNameFormats = array(
        '{{streetPrefix}} {{firstName}}',
        '{{streetPrefix}} {{lastName}}',
    );
    protected static $streetAddressFormats = array(
        '{{streetName}} - {{streetName}}',
        '{{streetName}} - {{streetName}} - {{buildingName}}',
    );
    protected static $addressFormats = array(
        "{{city}} - {{streetAddress}} - کد پستی {{postcode}}",
        "{{city}} - {{streetAddress}} - پلاک {{buildingNumber}}",
        "{{city}} - {{streetAddress}} - واحد {{buildingNumber}}",
    );
    /**
     * @example 'مجتمع'
     * @return string
     */
    public static function buildingNamePrefix()
    {
        return static::randomElement(static::$buildingNamePrefix);
    }
    /**
     * @example 'منزل '
     * @return string
     */
    public function buildingName()
    {
        $format = static::numerify(static::randomElement(static::$buildingNameFormat));
        return $this->generator->parse($format);
    }
    /**
     * @example 'اصفهان'
     * @return string
     */
    public static function state()
    {
        return static::randomElement(static::$state);
    }
    /**
     * @example 'تهران'
     * @return string
     */
    public static function province()
    {
        return static::state();
    }
    /**
     * @example 'کوچه'
     * @return string
     */
    public static function streetPrefix()
    {
        return static::randomElement(static::$streetPrefix);
    }
    /**
     * @example 'مازندران'
     * @return string
     */
    public function city()
    {
        return static::randomElement(static::$city);
    }
}
