<?php

namespace Faker\Provider\fa_IR;

class Color extends \Faker\Provider\Color
{
    protected static $safeColorNames = array(
        'سیاه', 'سفید', 'سبز', 'نارنجی', 'قرمز',
        'بنفش', 'قهوه ای', 'صورتی', 'آبی', 'نقره ای',
        'خاکستری', 'زرد', 'نیلی', 'فیروزه ای', 'سرمه ای'
    );

    protected static $allColorNames = array(
        'جگری', 'بژ تیره', 'حنایی روشن', 'قهوه‌ای حنایی',
        'کرم نارنجی', 'قرمز', 'زرشکی', 'شرابی',
        'عنابی تند', 'صورتی', 'صورتی پررنگ', 'شرابی روشن',
        'سرخابی', 'شفقی', 'ارغوانی', 'نارنجی کرم',
        'نارنجی', 'نارنجی سیر', 'نارنجی پررنگ', 'قرمز گوجه‌ای',
        'قرمز-نارنجی', 'شیری', 'شیرشکری', 'لیمویی روشن',
        'هلویی روشن', 'هلویی', 'هلویی پررنگ', 'نخودی',
        'خاکی', 'زرد', 'کهربایی باز', 'ماشی',
        'مغزپسته‌ای', 'سبز روشن', 'مغزپسته‌ای پررنگ', 'مغزپسته‌ای',
        'سبز کمرنگ', 'سبز کدر', 'یشمی سیر', 'یشمی کمرنگ',
        'سبز لجنی', 'سبز چمنی', 'خزه‌ای', 'خزه‌ای پررنگ',
        'شویدی', 'سبز', 'سبز ارتشی', 'زیتونی',
        'زیتونی سیر', 'سبز آووکادو', 'سبز دریایی', 'سبز دریایی تیره',
        'سبز کبریتی روشن', 'سبز کبریتی تیره', 'سبز دودی', 'فیروزه‌ای',
        'آبی آسمانی', 'فیروزه‌ای کدر', 'آبی دریایی', 'یشمی',
        'سبز دریایی روشن', 'فیروزه‌ای تیره', 'فیروزه‌ای سیر', 'آبی کبریتی روشن',
        'بنفش مایل به آبی', 'آبی کبریتی', 'آبی آسمانی سیر', 'آبی روشن',
        'آبی کمرنگ', 'آبی کدر', 'نیلی متالیک', 'آبی لجنی',
        'آبی متالیک روشن', 'نیلی', 'فیروزه‌ای فسفری', 'آبی',
        'آبی سیر', 'سرمه‌ای', 'لاجوردی', 'آبی نفتی',
        'نیلی کمرنگ', 'بادمجانی روشن', 'بنفش کدر', 'بنفش روشن',
        'سرخابی', 'سرخابی روشن', 'ارکیده', 'ارکیده سیر',
        'آبی بنفش', 'آبی فولادی', 'آبی-بنفش سیر', 'بنفش باز',
        'ارکیده بنفش', 'مخملی', 'بنفش', 'آبی دودی',
        'نیلی سیر', 'کاهی', 'کاهگلی', 'کرم',
        'کرم سیر', 'گندمی', 'خاکی', 'برنزه کدر',
        'بادمجانی', 'هلویی سیر', 'خردلی', 'ماشی سیر',
        'بادامی سیر', 'عسلی پررنگ', 'کاکائویی', 'قهوه‌ای متوسط',
        'قهوه‌ای', 'آلبالویی', 'سفید', 'صورتی محو',
        'یشمی محو', 'سفید نعنائی', 'آبی محو', 'نیلی محو',
        'سفید بنفشه', 'خاکستری محو', 'بژ باز', 'بژ روشن',
        'پوست پیازی', 'استخوانی', 'بژ تیره', 'کتانی',
        'صورتی مات', 'بژ', 'خاکستری مات', 'نقره‌ای',
        'توسی', 'خاکستری سیر', 'خاکستری', 'دودی',
        'سربی', 'سربی تیره', 'لجنی تیره', 'سیاه',
    );
}
