<?php

namespace Faker\Provider\fa_IR;

class Color extends \Faker\Provider\Color
{
    /**
     * @link https://fa.wikipedia.org/wiki/%D9%81%D9%87%D8%B1%D8%B3%D8%AA_%D8%B1%D9%86%DA%AF%E2%80%8C%D9%87%D8%A7
     */
    protected static $allColorNames = array(
        'آبی', 'آبی آسمانی', 'آبی درباری', 'آبی دریایی', 'آبی كاربنی', 'آبی لجنی', 'آبی نفتی', 'آجری', 'آل', 'آلبالویی', 'اُخرایی', 'ارغوانی', 'استخوانی',
        'بادمجونی', 'برگ سنجدی', 'برنجی', 'برنزی', 'بژ', 'بنفش',
        'پرکلاغی', 'پوست پیازی', 'پوست گرگی',
        'تاج خروسی', 'تریاکی',
        'جگری',
        'حنایی',
        'خاکستری', 'خاکی', 'خردلی', 'خرمایی',
        'دارچینی', 'دودی', 'دوغی',
        'روناسی',
        'زرد', 'زرد كهربائی', 'زرشکی', 'زعفرانی', 'زغالی', 'زیتونی',
        'سبز', 'سبز ایرانی', 'سبز چمنی', 'سبز درباری', 'سبز کاهویی', 'سبز كلخنگی', 'سبز لجنی', 'سدری', 'سربی', 'سرخ', 'سرخ آتشی', 'سرخ گلی', 'سرخابی', 'سرمه‌ای', 'سفید', 'سفید یخچالی', 'سیاه',
        'شرابی',
        'شفقی',
        'شكلاتی',
        'شنگرفی',
        'شیرشکری', 'شیری',
        'صورتی',
        'طلایی', 'طوسی',
        'عنابی',
        'فندقی', 'فولادی', 'فیروزه‌ای', 'فیلی',
        'قرمز', 'قرمز ایرانی', 'قرمز فالونی', 'قهوه‌ای',
        'کرم', 'کله غازی',
        'گردویی', 'گلبهی', 'گیلاسی',
        'لاجوردی', 'لجنی', 'لیمویی',
        'ماشی', 'مرجانی', 'مسی', 'مشکی', 'مغزپسته ای',
        'نارنجی', 'نخودی', 'نقره‌ای', 'نوک مدادی', 'نیلی', 'نیلی سیر',
        'هلویی',
        'یاسی', 'یاقوتی', 'یخی', 'یشمی',
    );
}
