<?php

namespace Faker\Provider\fa_IR;

class Color extends \Faker\Provider\Color
{
    /**
     * @link https://fa.wikipedia.org/wiki/%D9%81%D9%87%D8%B1%D8%B3%D8%AA_%D8%B1%D9%86%DA%AF%E2%80%8C%D9%87%D8%A7
     */
    protected static $safeColorNames = array(
        'سیاه', 'آلبالویی', 'سبز', 'آبی دریایی', 'زیتونی',
        'صورتی', 'آبی فیروزه ای', 'سبز لیمویی', 'آبی', 'نقره ای',
        'خاکستری', 'زرد', 'قرمز', 'آبی آسمانی', 'سفید'
    );

    protected static $allColorNames = array(
        'آبی','آبی آسمانی','آبی ایرانی','آبی درباری',
        'آبی دریایی','آبی زنگاری','آبی سیر','آبی کاربنی',
        'آبی لجنی','آبی نفتی','آبی فیروزه ای','آل',
        'آلبالویی','اُخرایی','ارغوانی','ارکیده',
        'استخوانی','بادمجانی','برگ سنجدی','برنجی',
        'برنزی','بژ','بلوطی','بنفش','پرتقالی','پرکلاغی',
        'پوست‌پیازی','پوست‌گرگی','تاج‌خروسی','تریاکی',
        'تمشکی','توسی','جگری','چیریکی','حنایی','خاکستری',
        'خاکی','خردلی','خرمایی','دارچینی','دودی',
        'دوغی','دلفینی','روغنی','روناسی','رز ایرانی',
        'زرد','زرد کهربایی','زرد قناری','زرشکی','زعفرانی',
        'زغالی','زیتونی','سبز','سبز ارتشی','سبز آووکادو',
        'سبز ایرانی','سبز چمنی','سبز درباری','سبز سیدی',
        'سبز کاهویی','سبز کبریتی','سبز لجنی','سبز مغزپسته‌ای',
        'سبز میشی','سدری','سربی','سرخ','سرخ آتشی','سرخ گلی',
        'سرخابی','سرمه‌ای','سفید','سفید یخچالی','سیاه','شرابی',
        'شفقی','شکلاتی','شنگرفی','شیرشکری','شیری','صدفی',
        'صورتی','صورتی ایرانی','طلایی','عسلی','عنابی','فسفری',
        'فندقی','فولادی','فیروزه‌ای','فیلی','قرمز','قرمز ایرانی',
        'فالونی','قهوه‌ای','قهوه ای سوخته','کاراملی','کاکائویی',
        'کاهی','کاهگلی','کبود','کرِم','کله‌غازی','گردویی','کَهَر',
        'گلبهی','گندمی','گوجه ای','گیلاسی','لاجوردی','لجنی',
        'لیمویی','ماشی','ماهگونی','مرجانی','مسی','مشکی',
        'نارنجی','نخودی','نسکافه ای','نقره‌ای','نوک‌مدادی',
        'نیلی','نیلی سیر','هلی','هلویی','یاسی','یاقوتی','یخی','یشمی'
    );
}
