<?php

namespace Faker\Provider\fa_IR;

class Lorem extends \Faker\Provider\Lorem
{
    protected static $wordList = array(
        'آنچنان','ابزارهای','ارائه','از','اساساً','است','استفاده','اصلی','امید','اهل','ای','ایپسوم','ایجاد','این','آینده','با',
        'برای','بلکه','به','بهبود','بیشتری','پایان','پیشرو','پیوسته','تا','تایپ','تکنولوژی','تمام','تولید','جامعه','جوابگوی','چاپ',
        'چاپگرها','حال','حروفچینی','خلاقی','داشت','در','درصد','دستاوردهای','دشواری','دنیای','را','راهکارها','رایانه','رسد','روزنامه',
        'زبان','زمان','زیادی','ساختگی','سادگی','ستون','سخت','سطر','سه','سؤالات','شامل','شرایط','شصت','شناخت','صنعت','صورت','طراحان',
        'طراحی','علی‌الخصوص','فارسی','فراوان','فرهنگ','فعلی','قرار','کاربردهای','کاربردی','کتابهای','کرد','که','گذشته','گرافیک','گیرد',
        'لازم','لورم','متخصصان','متن','متنوع','متون','مجله','موجود','مورد','می‌باشد','می‌توان','می‌طلبد','نامفهوم','نرم‌افزارها','نیاز','هدف','و'
    );
}
