<?php

namespace Faker\Provider\fa_IR;

class Lorem extends \Faker\Provider\Lorem
{
	protected static $wordList = array(
		'لورم', 'ایپسوم', 'متن', 'ساختگی', 'با',
		'تولید', 'سادگی', 'نامفهوم', 'از', 'صنعت',
		'چاپ', 'با', 'استفاده', 'از',
		'طراحان', 'گرافیک', 'است', 'چاپگرها',
		'متون', 'بلکه', 'روزنامه', 'مجله',
		'در', 'ستون', 'سطرآنچنان', 'که',
		'لازم', 'است', 'برای', 'شرایط',
		'فعلی', 'تکنولوژی', 'مورد', 'نیاز',
		'کاربردهای', 'متنوع', 'با', 'هدف', 'بهبود',
		'ابزارهای', 'کاربردی', 'می‌باشد', 'کتابهای',
		'زیادی', 'در', 'شصت', 'سه',
		'درصد', 'گذشته', 'حال', 'آینده',
		'شناخت', 'فراوان', 'جامعه', 'متخصصان',
		'را', 'می‌طلبد', 'تا', 'با', 'نرم',
		'افزارها', 'شناخت', 'بیستری', 'را', 'برای',
		'طراحان', 'رایانه', 'ای', 'فرهنگ',
		'پیشرو', 'در', 'زبان', 'فارسی', 'ایجاد',
		'کرد', 'در', 'این', 'صورت', 'می‌توان',
		'امید', 'داشت', 'که', 'تمام',
		'دشواری', 'موجود', 'در', 'ارائه', 'راهکارها',
		'شرایط', 'سخت', 'تایپ', 'به',
		'پایان', 'رسد', 'وزمان', 'مورد', 'نیاز',
		'شامل', 'حروفچینی', 'دستاوردهای', 'اصلی', 'و',
		'جوابگوی', 'سوالات', 'پیوسته', 'اهل', 'دنیای',
		'موجود', 'طراحی', 'اساسا', 'مورد', 'استفاده',
		'قرار', 'گیرد'
	);
}