<?php

namespace Faker\Provider\th_TH;

class Person extends \Faker\Provider\Person
{
    protected static $maleNameFormats = array(
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{titleMale}} {{firstNameMale}} {{lastName}}',
    );

    protected static $femaleNameFormats = array(
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{titleFemale}} {{firstNameFemale}} {{lastName}}',
    );

    /**
     * Male first names below are extracted from soap drama characters.
     * @see https://th.wikipedia.org/wiki/%E0%B8%A3%E0%B8%B2%E0%B8%A2%E0%B8%8A%E0%B8%B7%E0%B9%88%E0%B8%AD%E0%B8%A5%E0%B8%B0%E0%B8%84%E0%B8%A3%E0%B9%82%E0%B8%97%E0%B8%A3%E0%B8%97%E0%B8%B1%E0%B8%A8%E0%B8%99%E0%B9%8C%E0%B9%84%E0%B8%97%E0%B8%A2
     */
    protected static $firstNameMale = array(
        // ก ข ฃ ค
        'ก้องภพ', 'กำจร', 'เกริกไกร', 'ไกรยุทธ์', 'คำรณ',
        // ฅ ฆ ง จ
        'โฆษิต', 'จุมพล', 'เจนศักดิ์',
        // ฉ ช ซ ฌ
        'ชานนท์', 'ชัชชัย', 'เชิดชาย', 'ชาญรบ', 'ชนะศึก', 'ชิษณุพงศ์', 'สุบรรณ',
        // ญ ฎ ฏ ฐ
        // ฑ ฒ ณ ด
        'ณรงค์', 'ณัฐพงศ์', 'ดุลยศักดิ์', 'ดนัย',
        // ต ถ ท ธ
        'ต้นกล้า', 'ไตรภพ', 'ทีปกร', 'ทัดภูมิ', 'ธวัชชัย', 'ธัญวิทย์', 'ธานินทร์', 'ธรรมศักดิ์',
        // น บ ป ผ
        'นพเดช', 'นรสิงห์', 'บัณฑิต', 'บุญส่ง', 'ประเสริฐ', 'บันลือศักดิ์', 'บุญโชค', 'เป็นต่อ', 'ประชา', 'ปิติ', 'ปานศักดิ์', 'เผ่าเทพ',
        // ฝ พ ฟ ภ
        'พันธ์พงษ์', 'พีรเทพ', 'ไพศาล', 'พิพัฒน์', 'พลภัทร', 'พิริยะศักดิ์', 'ภาคิน', 'ภูวดล', 'ภัทร',
        // ม ย ร ล
        'มานะ', 'มงคล', 'โยธิต', 'ยุทธการ', 'เรวัติ', 'ราเชน', 'เรืองโรจน์',
        // ว ศ ษ ส
        'วิชาญ', 'วิบูลย์', 'วิชาญ', 'วรเทพ', 'วรพจน์', 'วิทวัส', 'ศักดา', 'ศุภกิจ', 'สมชาย', 'สมศักดิ์', 'สุทธิพงษ์', 'แสงโชติ',
        // ห ฬ อ ฮ
        'อรรคพล', 'อานนท์', 'อรรณพ', 'โอฬาร', 'อารักษ์',
    );

    /**
     * Female first names below are extracted from soap drama characters.
     * @see https://th.wikipedia.org/wiki/%E0%B8%A3%E0%B8%B2%E0%B8%A2%E0%B8%8A%E0%B8%B7%E0%B9%88%E0%B8%AD%E0%B8%A5%E0%B8%B0%E0%B8%84%E0%B8%A3%E0%B9%82%E0%B8%97%E0%B8%A3%E0%B8%97%E0%B8%B1%E0%B8%A8%E0%B8%99%E0%B9%8C%E0%B9%84%E0%B8%97%E0%B8%A2
     */
    protected static $firstNameFemale = array(
        // ก ข ฃ ค
        'กิ่งกาญจน์', 'กมลา', 'กัลยา', 'กัลยาณี', 'กุสุมา', 'กิ่งแก้ว', 'เขมิกา', 'ขวัญตา', 'คำหยาด',
        // ฅ ฆ ง จ
        'จรรยา',
        // ฉ ช ซ ฌ
        'ฉวีผ่อง', 'ไฉววงศ์', 'ฉัตราภรณ์', 'ชงโค', 'ชนกนันท์',
        // ญ ฎ ฏ ฐ
        // ฑ ฒ ณ ด
        'ณัฐชา', 'ดารณี', 'ดาวเรือง', 'ดวงแข', 'ดุจดาว', 'ดารินทร์',
        // ต ถ ท ธ
        'ทัดดาว', 'ทองปลิว', 'ธิดารัตน์', 'ธัญรัตน์',
        // น บ ป ผ
        'นันทนา', 'นภา', 'นาถสุดา', 'นิชา', 'บุษบา', 'บุหลัน', 'ปัทมา', 'ปรียา', 'ปรางทิพย์', 'ประภัสสร', 'ปาริฉัตร',
        // ฝ พ ฟ ภ
        'พรรณทิพย์', 'พิศมัย', 'พวงผกา', 'พิมลภา', 'พิมพ์อัปสร', 'เภตรา', 'ภารวี', 'ภาวินี', 'ภัทรลดา',
        // ม ย ร ล
        'มาลินี', 'มินตรา', 'ยุพา', 'รัชนี', 'เลอลักษณ์', 'ลำดวน', 'ไลลา',
        // ว ศ ษ ส
        'วีณา', 'วลัยสมร', 'วรรณพร', 'สมหญิง', 'สมพร', 'สมศรี', 'สุนิสา', 'แสงจันทร์', 'สาวิตรี', 'เสาวรส', 'ศันสนีย์',
        // ห ฬ อ ฮ
        'ไอริณ', 'อรนุช', 'อรชร', 'อรพิม', 'อลิน', 'อาภรณ์', 'อัญชลิกา', 'อรณิชา', 'อินตรา',
    );

    /**
     * Last names below are extracted from soap drama characters.
     * @see https://th.wikipedia.org/wiki/%E0%B8%A3%E0%B8%B2%E0%B8%A2%E0%B8%8A%E0%B8%B7%E0%B9%88%E0%B8%AD%E0%B8%A5%E0%B8%B0%E0%B8%84%E0%B8%A3%E0%B9%82%E0%B8%97%E0%B8%A3%E0%B8%97%E0%B8%B1%E0%B8%A8%E0%B8%99%E0%B9%8C%E0%B9%84%E0%B8%97%E0%B8%A2
     */
    protected static $lastName = array(
        // ก ข ฃ ค
        'กำธรเจริญ', 'กาญจนวิภู', 'กิจจานุรักษ์', 'กมลานันท์', 'กติยา', 'กองการ', 'กิตติธร', 'เกิดงามพริ้ง',
        // ฅ ฆ ง จ
        'ครองจินดา', 'จุฑาเทพ ณ อยุธยา', 'จันทร์ประดับ', 'เจนพานิชย์สกุล', 'จิตสะอาด', 'จิตประสงค์', 'จิตมานะ', 'เจริญเดช', 'จิรามณี',
        // ฉ ช ซ ฌ
        'ไชยวัฒนา',
        // ญ ฎ ฏ ฐ
        // ฑ ฒ ณ ด
        'ดิเรกวิทยา', 'ดำรงลาวรรณ',
        // ต ถ ท ธ
        'ตะลุมพุก', 'เทพทัต', 'ทวิพักตร์',
        // น บ ป ผ
        'นิมิตนาม', 'นทีพิทักษ์', 'เบี้ยวสกุล', 'ปืนครก', 'ประจัญบาน', 'ประภาพร',
        // ฝ พ ฟ ภ
        'พิชัยรณรงค์', 'พงศ์พิทักษ์', 'พรรณาราย', 'พิทักษ์ไทย', 'พจน์จำเนียร', 'พุ่มฉัตร',
        // ม ย ร ล
        'มนูญศักดิ์', 'ยอดยาใจ', 'รุจิอาภรณ์', 'รัตนเดชากร', 'รัตนามิรา', 'รักธรรม',
        // ว ศ ษ ส
        'วรเลิศรัตน์', 'วาทะศรัทธา', 'วิทยเขตปภา', 'วงศ์สินวิเศษ', 'วรรณดำรง', 'วิไลสักดิ์', 'ศิวาวงศ์',
        'สัมพันธ์พงษ์', 'สันตติวงศ์', 'สุรบดินทร์', 'แสนชล', 'สมุทรเทวา', 'สันต์สิริศักดิ์',
        // ห ฬ อ ฮ
        'หงส์แก้ว', 'เหนือกาล', 'อัศวเรืองฤทธิ์', 'อัศวรัช', 'อดุสาระดี', 'อาจฤทธิ์',
    );

    protected static $maleNicknames = array(
        // ก ข ฃ ค
        'กล้า', 'ก้อง', 'กัปตัน', 'เคน', 'คิว', 'คิง', 'เค',
        // ฅ ฆ ง จ
        'จุก', 'โจ', 'โจ้', 'แจ๊ค', 'เจมส์', 'จุ้ย',
        // ฉ ช ซ ฌ
        'ชาญ', 'ช้าง', 'ชัย', 'โชค', 'แซม',
        // ญ ฎ ฏ ฐ
        // ฑ ฒ ณ ด
        'โด่ง', 'เดช', 'ดอน', 'แดน', 'โดม',
        // ต ถ ท ธ
        'ตี๋', 'ต่อ', 'ตั้ม', 'เต้นท์', 'ตุ้ย', 'เต้', 'ตังกวย', 'ตั้ม', 'เทพ', 'ทัศน์', 'ท็อป',
        // น บ ป ผ
        'นนท์', 'นัท', 'บิ๊ก', 'ไผ่', 'บูม', 'โบ๊ต', 'เปรม', 'โปเต้', 'โปรด', 'โป้ง', 'ป่าน', 'ปุ่น',
        // ฝ พ ฟ ภ
        'พอล', 'เพชร', 'ภาค', 'ฟอร์ด', 'ฟิล์ม', 'ภูมิ',
        // ม ย ร ล
        'แมน', 'เมฆ', 'เม่น', 'มาร์ค', 'ยอด', 'โรม', 'เรย์', 'ลีซอ',
        // ว ศ ษ ส
        'ว่าน', 'วิน', 'วัฒน์', 'วิทย์', 'ศร', 'ศักดิ์', 'เสือ',
        // ห ฬ อ ฮ
        'ใหญ่', 'โอ', 'แอ๊ด', 'อาร์ต', 'โอ๊ต', 'เอก', 'อาร์ม',
    );

    protected static $femaleNicknames = array(
        // ก ข ฃ ค
        'กิ๊ปซี่', 'แก้ว', 'กระแต', 'กระต่าย', 'กิฟท์', 'เกศ', 'ข้าว', 'เข็ม', 'ขวัญ', 'คิม',
        // ฅ ฆ ง จ
        'แจ๋ว', 'จอย', 'จุ๊บแจง', 'เจน', 'จิน', 'แจน', 'จูน',
        // ฉ ช ซ ฌ
        'ชะเอม', 'เชอร์รี่',
        // ญ ฎ ฏ ฐ
        // ฑ ฒ ณ ด
        'ดาว', 'ดรีม', 'เดือน',
        // ต ถ ท ธ
        'เตย', 'ตูน', 'แตน', 'แตงกวา', 'เต้ย', 'ทิพย์',
        // น บ ป ผ
        'นา', 'นุช', 'น้ำ', 'เนม', 'นุ่ม', 'นก', 'บี๋', 'โบว์', 'เบลล์',
        'ปลา', 'ปาหนัน', 'ปู', 'แป้น', 'ปุ๊กปิ๊ก', 'ปุยฝ้าย', 'ผกา',
        // ฝ พ ฟ ภ
        'ฝ้าย', 'พลอย', 'แพร', 'แพท', 'พราว', 'พิม', 'พิน', 'ฟ้า', 'เฟย์', 'ฟาง',
        // ม ย ร ล
        'มุก', 'มินท์', 'มีมี่', 'โม', 'มิว', 'มะลิ', 'เมย์', 'มนต์', 'แยม', 'มายด์', 'มด', 'ลูกหมี', 'ลูกแก้ว',
        // ว ศ ษ ส
        'แวว', 'วิว', 'ส้ม', 'ส้มโอ', 'ส้มลิ้ม', 'สีรุ้ง',
        // ห ฬ อ ฮ
        'หวาน', 'เหมียว', 'หญิง', 'หลิว', 'หมิง', 'แอนนา', 'เอม', 'ออย', 'อีฟ', 'เอย',
    );

    /**
     * @example 'โอ'
     */
    public static function nickname()
    {
        return static::randomElement(array_merge(static::$maleNicknames, static::$femaleNicknames));
    }

    /**
     * @example 'โอ'
     */
    public static function maleNickname()
    {
        return static::randomElement(static::$maleNicknames);
    }

    /**
     * @example 'พลอย'
     */
    public static function femaleNickname()
    {
        return static::randomElement(static::$femaleNicknames);
    }
}
