<?php

namespace Faker\Provider\ka_GE;


class Lorem extends \Faker\Provider\Lorem
{

    protected static $wordList = array(
        'ლორემ', 'იპსუმ', 'დოლორ', 'სიტ', 'ამეტ', 'რომ', 'სკოლის', 'ხშირი',
        'დაბეჯითებული', 'პლატონ', 'თქვე', 'უძრავად', 'რა', 'ამ', 'ახლავე',
        'მოუვიდა', 'სკოლაში', 'არც', 'მოსალაპარაკებლად', 'ერთმა', 'ხვალვე',
        'სამცხეჯავახეთის', 'ხელები', 'დაებრუნებინა', 'პერანგა', 'კი', 'შენ',
        'ეგებ', 'თბილ', 'შვილის', 'ჯავრით', 'გიყვარდე', 'კაი', 'სსიფთან',
        'გამო', 'დიდ', 'საქმის', 'შევიდასარემონტო', 'შენობა', 'და', 'ზეციერი',
        'მერე', 'ჩამოირბინა', 'ცოტა', 'მეც', 'ასეთი', 'თანახმა', 'მეპატრონეები',
        'ნამეტანია', 'პლატონმა', 'სსიფის', 'ერთმანეთის', 'ყველაფერში', 'თავისი',
        'მუშაობს', 'არისტომ', 'სახელმწიფოსათვის', 'რაც', 'ხნიერი', 'შენიანმა',
        'სატირალში', 'საშუალო', 'ადეიშვილი', 'ღიმილით', 'დრო', 'ის', 'არა',
        'აწეწილი', 'აქაურობას', 'მადლიანს', 'მამამ', 'დოუშინებიხარ',
        'სალაპარაკოდმე', 'ლაპარაკში', 'სოფლის', 'გზა', 'აირჩევს', 'ვსვამდი',
        'იქნა', 'ქალი', 'ბატონო', 'გადუჭირა', 'მახლობლად', 'ყმაწვილი', 'თუ',
        'არაფერი', 'ყურს', 'უახლოეს', 'ფონდის', 'ასე', 'მე', 'ამაღლებას',
        'მაგარი', 'მუსაიფიც', 'ჩემთვის', 'სურთ', 'მოკლე', 'ჩვენი', 'მძიმე',
        'მაგისაგან', 'ღვინო', 'შემოწმებას', 'გეფიცები', 'იგივეს', 'ჩემო',
        'წაულაპარაკა', 'აღარ', 'კარგათაა', 'საძილე', 'უფალო', 'ქართველმა',
        'ეჭირა', 'მასთან', 'სართულზე', 'შეიძლება', 'წუხანდელმა', 'ნახავდი',
        'აქ', 'ბევრს', 'აღნიშნავს', 'ისტორიული', 'მამა', 'ინფორმაციის', 'ლარი',
        'ამიტომ', 'გადავირევი', 'ხნის', 'უნიჭო', 'ეყოლოს', 'ბებერი',
        'მიმინაშვილები', 'დავტოვოთ', 'მესამე', 'ჯავრი', 'სუ', 'იყო',
        'დაინტერესებულმა', 'გადიხარხარა', 'ინტრიგა', 'გითხრა', 'თავი',
        'თავისას', 'ეზოლუდი', 'აკლიმატიზაციისათვის', 'შემოსვლა', 'არ',
        'ხელდახელ', 'ალბათ', 'უარესია', 'დააშორა', 'სხვა', 'შემოგეხვეწათქვა',
        'მოემატებია', 'წამოიწყო', 'ბირჟას', 'საქართველოს', 'მიმეტებ', 'მსოფლიო',
        'ხარ', 'კაცი', 'მთლიანად', 'ქვრივზე', 'გეიგონებს', 'სალაპარაკოდ',
        'მაისს', 'კვნესით', 'ბავშვების', 'მისი', 'გაჭირდებოდა', 'ქენი', 'თაროს',
        'ვაკეთებთ', 'ცხოვრების', 'დალუქვაშემოწმება', 'დირექტორი', 'პოლიცია',
        'ჯგუფების', 'ძალიანაც', 'დაარეგულირებს', 'ჩავარდა', 'მზრუნველობის',
        'შემდეგ', 'მოვიქცეთ', 'ძალუმად', 'მაგ', 'საძოვარი', 'კირილემ', 'მალე',
        'ცოტაც', 'ნაგებობა', 'საფუძველზე', 'ცირეკიძე', 'დასძინებოდა', 'უკეთ',
        'წამო', 'თავმოძულებით', 'ამნაირი', 'ორნაქმარევი', 'დახამხამებაში',
        'აზნაური', 'შეგეწევათ', 'თავის', 'გადასძახა', 'ორგანოებსა', 'დედაშვილი',
        'დაეცა', 'მისულიყვნენ', 'მალაქია', 'გადათქვა', 'ღობეში',
        'ინვესტიციების', 'თავისთავად', 'ცალკე', 'ახლა', 'ოთახები', 'ლამაზად',
        'ცემით', 'შერცხვენილი', 'ჩანდა', 'აბა', 'ყური', 'მოირიდოთ', 'ევსებოდა',
        'მარნეულის', 'ერთგვარი', 'ნუ', 'კანონი', 'ისეა', 'გიჟმაჟობა',
        'ცმაცურობდა', 'მიაგნებდნენ', 'თორემ', 'მათ', 'არადა', 'თქვა',
        'განუწყვეტლად', 'საკითხებზე', 'ჰო', 'წაყოლა', 'ისე', 'სიხარულს',
        'წყალი', 'სათქვენოა', 'ბიძია', 'რაღა', 'ძმობას', 'მხრივ', 'ორთავემ',
        'აგება', 'მამისაგან', 'შეხვედრა', 'ჩემი', 'დამსახავთ', 'პროექტის',
        'წარბი', 'თაობას', 'ნატალიას', 'კინაღამ', 'დაბეჯითებით', 'დაფასება',
        'ტრენინგებისა', 'ცოლი', 'სახლში', 'უნდა', 'თვარა', 'შეშა', 'მქონე',
        'ყოყმანობდა', 'ამბავს', 'დარჩა', 'მეეჭვება', 'ეჯიბრებოდნენ',
        'გამოცდილებას', 'ემზადა', 'ხელათ', 'ისეთმა', 'სასწავლებლის'
    );
}
