<?php

namespace Faker\Provider\el_CY;

class Person extends \Faker\Provider\Person
{
    /**
     * @var array
     * @link http://www.mof.gov.cy/mof/cystat/statistics.nsf/populationcondition_22main_gr/populationcondition_22main_gr?OpenForm&sub=2&sel=2
     */
    protected static $firstNameMale = array(
        'Άγγελος',
        'Αλέξανδρος',
        'Αναστάσιος',
        'Ανδρέας',
        'Αντώνης',
        'Βασίλης',
        'Γιώργος',
        'Δημήτρης',
        'Ηλίας',
        'Θεόδωρος',
        'Ιάκωβος',
        'Ιωάννης',
        'Κυριάκος',
        'Κώστας',
        'Λουκάς',
        'Λοϊζος',
        'Μάριος',
        'Μαρίνος',
        'Μιχάλης',
        'Νεόφυτος',
        'Νικόλας',
        'Πέτρος',
        'Παναγιώτης',
        'Παντελής',
        'Παύλος',
        'Σάββας',
        'Σπυρίδωνας',
        'Στέφανος',
        'Σταύρος',
        'Στυλιανός',
        'Σωτήρης',
        'Φίλιππος',
        'Χαράλαμπος',
        'Χρίστος',
        'Χριστόδουλος',
        'Χριστόφορος',
    );

    /**
     * @var array
     * @link http://www.mof.gov.cy/mof/cystat/statistics.nsf/populationcondition_22main_gr/populationcondition_22main_gr?OpenForm&sub=2&sel=2
     */
    protected static $firstNameFemale = array(
        'Άννα',
        'Αγγέλα',
        'Αθηνά',
        'Αλεξάνδρα',
        'Αναστασία',
        'Ανδρούλα',
        'Αντωνία',
        'Βασιλική',
        'Γεωργία',
        'Δέσποινα',
        'Δήμητρα',
        'Ειρήνη',
        'Ελένη',
        'Ελισάβετ',
        'Ζωή',
        'Θεοδώρα',
        'Ιωάννα',
        'Κατερίνα',
        'Κυριακή',
        'Κωνσταντίνα',
        'Λουκία',
        'Μαρία',
        'Μαρίνα',
        'Μαργαρίτα',
        'Μαριάννα',
        'Μιχαέλλα',
        'Νίκη',
        'Ναταλία',
        'Νικολέττα',
        'Παναγιώτα',
        'Παρασκευή',
        'Ραφαέλα',
        'Σοφία',
        'Σταυρούλα',
        'Στυλιανή',
        'Σωτηρούλα',
        'Φωτεινή',
        'Χαραλαμπία',
        'Χριστίνα',
        'Χριστιάνα',
        'Χρυστάλλα',
    );

    /**
     * @var array
     * @link http://www.mof.gov.cy/mof/cystat/statistics.nsf/populationcondition_22main_gr/populationcondition_22main_gr?OpenForm&sub=2&sel=2
     */
    protected static $lastName = array(
        'Αλεξάνδρου',
        'Αναστασίου',
        'Ανδρέου',
        'Αντωνίου',
        'Βασίλη',
        'Γεωργίου',
        'Δημήτρίου',
        'Ηλία',
        'Θεοδώρου',
        'Ιακώβου',
        'Ιωάννη',
        'Κυριάκου',
        'Κωνσταντίνου',
        'Λουκά',
        'Λοϊζου',
        'Μαρίνου',
        'Μιχαήλ',
        'Νεοφύτου',
        'Νικολάου',
        'Πέτρου',
        'Παναγιώτη',
        'Παντελή',
        'Παύλου',
        'Σάββα',
        'Σπυρίδωνος',
        'Στέφανου',
        'Στυλιανού',
        'Σωτηρίου',
        'Χαραλάμπους',
        'Χριστόδουλου',
        'Χριστόφορου',
    );

    protected static $titleMale = array('κος.', 'κ.');
    protected static $titleFemale = array('δις.', 'δνις.', 'κα.');
}
