<?php

namespace Faker\Provider\ar_DZ;

class Address extends \Faker\Provider\Address
{

    protected static $cityPrefix = array(
        'عين', 'بو', 'بن', 'حاسي', 'باب', 'آيت', 'سيدي', 'وادي', 'واد', 'راس',
    );
    protected static $streetSuffix = array(
        'شارع', 'حي', 'طريق', 'ممر', 'زقاق',
    );
    protected static $buildingNumber = array('####', '###', '##');

    protected static $cityName = array(
        "الخروب", "المغير", "عين وسارة", "العلمة", "عين يوسف", "وادي سلي", "حاسي بحبح",
        "سور الغزلان", "باب الواد", "خراطة", "الادريسية", "يسر", "عين الذهب", "بومدفع", "بوكرم",
        "تاكسلانت", "واد الزناتي", "ثنية الاحد", "الرحية", "الماء الابيض",
        "وادي النجاء", "عين أدن", "سيدي عون", "سيدي قادة", "آفلو",
    );

    protected static $wilayas = array(
        "ادرار", "الشلف", "الأغواط", "أم البواقي", "باتنة", "بجاية", "بسكرة", "بشار", "البليدة",
        "البويرة", "تمنراست‎", "تبسة‎", "تلمسان‎", "تيارت‎", "ثيزي وزو", "الجزائر", "الجلفة", "جيجل", "سطيف",
        "سعيدة‎", "سكيكدة", "سيدي بلعباس", "عنّابة‎", "قالمة‎‎", "قسنطينة", "المدية", "مستغانم", "المسيلة", "معسكر",
        "ورقلة", "وهران", "البيض", "اليزي", "برج بوعريريج", "بومرداس", "الطارف", "تندوف", "تيسمسيلت", "الوادي",
        "خنشلة", "سوق أهراس", "تيبازة", "ميلة", "عين الدفلى", "النعامة", "عين تموشنت", "غرداية", "غليزان",
    );

    protected static $postcode = array(
        '1000', '2000', '3000', '4000', '5000', '6000', '7000', '8000', '9000', '10000',
        '11000', '12000', '13000', '14000', '15000', '16000', '17000', '18000', '19000',
        '20000', '21000', '22000', '23000', '24000', '25000', '26000', '27000', '28000', '29000',
        '30000', '31000', '32000', '33000', '34000', '35000', '36000', '37000', '38000', '39000',
        '40000', '41000', '42000', '43000', '44000', '45000', '46000', '47000', '48000');

    protected static $country = array(
        'الكاريبي', 'أمريكا الوسطى', 'أنتيجوا وبربودا', 'أنجولا', 'أنجويلا', 'أندورا', 'اندونيسيا', 'أورجواي', 'أوروبا', 'أوزبكستان', 'أوغندا', 'أوقيانوسيا', 'أوقيانوسيا النائية', 'أوكرانيا', 'ايران', 'أيرلندا', 'أيسلندا', 'ايطاليا',
        'بابوا غينيا الجديدة', 'باراجواي', 'باكستان', 'بالاو', 'بتسوانا', 'بتكايرن', 'بربادوس', 'برمودا', 'بروناي', 'بلجيكا', 'بلغاريا', 'بليز', 'بنجلاديش', 'بنما', 'بنين', 'بوتان', 'بورتوريكو', 'بوركينا فاسو', 'بوروندي', 'بولندا', 'بوليفيا', 'بولينيزيا', 'بولينيزيا الفرنسية', 'بيرو',
        'تانزانيا', 'تايلند', 'تايوان', 'تركمانستان', 'تركيا', 'ترينيداد وتوباغو', 'تشاد', 'توجو', 'توفالو', 'توكيلو', 'تونجا', 'تونس', 'تيمور الشرقية',
        'جامايكا', 'جبل طارق', 'جرينادا', 'جرينلاند', 'جزر الأنتيل الهولندية', 'جزر الترك وجايكوس', 'جزر القمر', 'جزر الكايمن', 'جزر المارشال', 'جزر الملديف', 'جزر الولايات المتحدة البعيدة الصغيرة', 'جزر أولان', 'جزر سليمان', 'جزر فارو', 'جزر فرجين الأمريكية', 'جزر فرجين البريطانية', 'جزر فوكلاند', 'جزر كوك', 'جزر كوكوس', 'جزر ماريانا الشمالية', 'جزر والس وفوتونا', 'جزيرة الكريسماس', 'جزيرة بوفيه', 'جزيرة مان', 'جزيرة نورفوك', 'جزيرة هيرد وماكدونالد', 'جمهورية افريقيا الوسطى', 'جمهورية التشيك', 'جمهورية الدومينيك', 'جمهورية الكونغو الديمقراطية', 'جمهورية جنوب افريقيا', 'جنوب آسيا', 'جنوب أوروبا', 'جنوب شرق آسيا', 'جنوب وسط آسيا', 'جواتيمالا', 'جوادلوب', 'جوام', 'جورجيا', 'جورجيا الجنوبية وجزر ساندويتش الجنوبية', 'جيبوتي', 'جيرسي',
        'دومينيكا',
        'رواندا', 'روسيا', 'روسيا البيضاء', 'رومانيا', 'روينيون',
        'زامبيا', 'زيمبابوي',
        'ساحل العاج', 'ساموا', 'ساموا الأمريكية', 'سانت بيير وميكولون', 'سانت فنسنت وغرنادين', 'سانت كيتس ونيفيس', 'سانت لوسيا', 'سانت مارتين', 'سانت هيلنا', 'سان مارينو', 'ساو تومي وبرينسيبي', 'سريلانكا', 'سفالبارد وجان مايان', 'سلوفاكيا', 'سلوفينيا', 'سنغافورة', 'سوازيلاند', 'سوريا', 'سورينام', 'سويسرا', 'سيراليون', 'سيشل',
        'شرق آسيا', 'شرق افريقيا', 'شرق أوروبا', 'شمال افريقيا', 'شمال أمريكا', 'شمال أوروبا', 'شيلي',
        'صربيا', 'صربيا والجبل الأسود',
        'طاجكستان',
        'عمان',
        'غامبيا', 'غانا', 'غرب آسيا', 'غرب افريقيا', 'غرب أوروبا', 'غويانا', 'غيانا', 'غينيا', 'غينيا الاستوائية', 'غينيا بيساو',
        'فانواتو', 'فرنسا', 'فلسطين', 'فنزويلا', 'فنلندا', 'فيتنام', 'فيجي',
        'قبرص', 'قرغيزستان', 'قطر',
        'كازاخستان', 'كاليدونيا الجديدة', 'كرواتيا', 'كمبوديا', 'كندا', 'كوبا', 'كوريا الجنوبية', 'كوريا الشمالية', 'كوستاريكا', 'كولومبيا', 'كومنولث الدول المستقلة', 'كيريباتي', 'كينيا',
        'لاتفيا', 'لاوس', 'لبنان', 'لوكسمبورج', 'ليبيا', 'ليبيريا', 'ليتوانيا', 'ليختنشتاين', 'ليسوتو',
        'مارتينيك', 'ماكاو الصينية', 'مالطا', 'مالي', 'ماليزيا', 'مايوت', 'مدغشقر', 'مصر', 'مقدونيا', 'ملاوي', 'منغوليا', 'موريتانيا', 'موريشيوس', 'موزمبيق', 'مولدافيا', 'موناكو', 'مونتسرات', 'ميانمار', 'ميكرونيزيا', 'ميلانيزيا',
        'ناميبيا', 'نورو', 'نيبال', 'نيجيريا', 'نيكاراجوا', 'نيوزيلاندا', 'نيوي',
        'هايتي', 'هندوراس', 'هولندا', 'هونج كونج',
        'وسط آسيا', 'وسط افريقيا',
    );

    protected static $cityFormats = array(
        '{{city}}',
    );

    protected static $streetNameFormats = array(
        '{{streetSuffix}}',
    );

    protected static $streetAddressFormats = array(
        '{{buildingNumber}} {{secondaryAddress}} {{streetName}}',
    );

    protected static $addressFormats = array(
        "{{streetAddress}} - {{city}}",
    );

    protected static $secondaryAddressFormats = array(
        'باب رقم ##', 'بناية  رقم ##',
    );

    /**
     * @example 'حاسي'
     */
    public static function cityPrefix()
    {
        return static::randomElement(static::$cityPrefix);
    }
    /**
     * @example 'بناية رقم 001'
     */
    public static function secondaryAddress()
    {
        return static::numerify(static::randomElement(static::$secondaryAddressFormats));
    }

    /**
     * @example 'حاسي بحبح'
     */
    public function city()
    {
        return static::randomElement(static::$cityName);
    }

    /**
     * @example 'الجلفة'
     */
    public static function state()
    {
        return static::randomElement(static::$wilayas);
    }

    /**
     * @example '17000'
     */
    public static function postcode()
    {
        return static::randomElement(static::$postcode);
    }
}
