<?php

namespace Faker\Provider\dv_MV;

class Text extends \Faker\Provider\Text
{
    protected static function validStart($word)
    {
        return preg_match('/^[ހށނރބޅކއވމފދތލގޏސޑޒޓޔޕޖޗ]/', $word);
    }

    /**
     * License: Attribution-ShareAlike 3.0 Unported (CC BY-SA 3.0)
     *
     * Title: ދިވެހިރާއްޖެ
     * Language: Dhivehi
     *
     * @see https://dv.wikipedia.org/wiki/%DE%8B%DE%A8%DE%88%DE%AC%DE%80%DE%A8%DE%83%DE%A7%DE%87%DE%B0%DE%96%DE%AC
     * @var string
     */
    protected static $baseText = <<<'EOT'
ދިވެހިރާއްޖެ، ރަސްމީ ގޮތުން ދިވެހިރާއްޖޭގެ ޖުމްހޫރިއްޔާ އަކީ ދެކުނު އޭޝިޔާގެ ހިންދު މާކަނޑު ގެ ތެރޭގައި، އޮޅުދޫ ކަރައިގެ ހުޅަނގު ފަރާތުން ހައްތުސްތަވާ މަތީގައި އުތުރުން ދެކުނަށް ފެތުރިފައި އޮންނަ ކުޑަ ޖަޒީރާ ޤައުމެކެވެ. ދިވެހިރާއްޖޭ ގައި އޮތީ ޤުދުރަތީ ގޮތުން 26 އަތޮޅު ކަމުގައި ވިޔަސް ދައުލަތް ހިންގުމަށް ފަސޭހަ ކުރުމުގެ ގޮތުން އިދާރީ ގޮތުން 20 އަތޮޅަށް ސަރުކާރުން މިއަތޮޅުތައް ބައްސަވާލައްވާފައިވެއެވެ. ދިވެހިރާއްޖޭގެ ބިމުގެ ބޮޑުމިނަކީ، 298 ކިލޯމީޓަރެވެ. އެއީ، 115 ކިލޯމޭލެވެ. ދިވެހިރާއްޖެއަކީ ދުނިޔޭގައިވާ މިނިވަންވެފައި ބޮޑު ސަރަހައްދަކަށް ފެތުރިފައިވާ އެއް ޤައުމެވެ. އަދިހަމައެއާއެކު 427,756ގެ ކުޑަ އާބާދީ އަކާއެކީ ދިވެހިރާއްޖެއަކީ އޭޝިޔާގައިވާ އެންމެ ކުޑަ ޤައުމުވެސްމެއެވެ.
އިތިހާސީ ފޮތްތަކުގައި ވަރަށް ކުޑަކޮށް ލިޔެފައިވި ނަމަވެސް، ރާއްޖޭގައި 1400 އަހަރަށް ދެމިގެންދިޔަ ބުދިސްޓު ޒަމާނަކީ ރާއްޖޭގެ އިތިހާސްގެ ބިންގަލެވެ. އެއީ މިޒަމާނާއި ހަަމައަށް ދެމިގެން އައިސްފައިވާ ދިވެހި ބަހާއި ސަގާފަތް އުފެދިގެން އައީ މިޒަމާނުގައިވާތީއެވެ. ދިވެހިބަހާއި، ފުރަތަމައަށް ދިވެހިބަސް ލިޔަން ގެންގުޅުނު އެވޭލާ އަކުރު، އަދި ދިރިއުޅުން ފެށުނީ ރާއްޖޭގައި ބުދިސްޓު ރަސްކަން އޮތްވައެވެ.

ދިވެހިރާއްޖެއަށް ބުދިޒަމްގެ ދީން ފެތުރިގެން އައީ ހިންދުކަރައިގެ ރަދުން އަޝޯކާގެ ރަސްކަމުގައި މީލާދީ ސަނަތުން 3ވަނަ ގަރުނު ބީސީއީ ގައި ކަމަށް ބެލެވެއެވެ. އޭރު ދިވެހީންގެ ތެރޭގައި ބުދިޒަމް އާންމުވެ ރާއްޖޭގެ 1400 އަހަރުގެ ބުދިސްޓު ޒަމާން ފެށުނެވެ.
ޖިއޮލޮގިކަލް ގޮތުން ދިވެހިރާއްޖޭ ގެ އަތޮޅުތަކާއި ރަށްތަކާއި ފަރުތައް އުފެދިފައިވާ ގޮތާއި އެ ތަންތަނުގެ ހަގުދޮށިކަން އެންމެ ފުރިހަމަ ގޮތުގައި ހޯދި ބެލިފައިވާ ކަމެއް އެނގިފައެއް ނެތެވެ. މިކަމަށް ދިރާސާއެއް ފުރަތަމަ ކުރެއްވި ކަމަށް ވަނީ ރޮބަރޓްސް މޮރެސްބީއެވެ. އެއީ 1834 މ. އިން 1836 މ. އަށެވެ. އެއީ ރާއްޖޭގެ ކަނޑުތައް ސަރވޭކޮށް ޗާޓުކުރެހުމަށް އޭނާ އުޅުނު ދުވަސްވަރުއެވެ. އޭގެ ފަހުން ޖޭ.އިސްޓެންލީ ގަރޑިނަރ އެވެ. އެއީ 1899 މ. ވަނަ އަހަރުގައެވެ. އޭގެ ފަހުން 1902 މ. ވަނަ އަހަރު އުސްތާޒު އޭ. އެގަޒީސް އެވެ. މީގެ ފަހުންވެސް ބައެއް ހޯދުންތެރިން ކޮންމެ ވެސް ވަރެއްގެ ހޯދުންތަކެއް ހޯދާފައިވެއެވެ. މި ހޯދުންތަކުގެ ތެރޭގައި މިސުރުގެ އަލްމަބާޙިޘްގެ ޓީމު ގެ މަސައްކަތާއި ޔުނެސްކޯ ގެ ބެލުމުގެ ދަށުން ބައިނަލްއަގުވާމީ ގޮތުން ހިންދު ކަނޑު ސާވޭ ކުރަން ފެށިފައިވާ މަސައްކަތް ހިމެނެއެވެ. އެ ސާވޭ ފުރިހަމަ ވާއިރު ދިވެހިރާއްޖެ އާ ބެހޭ ވަރަށް ގިނަ ހޯދުންތައް ހޯދި ފުރިހަމަ ވެފައި ވާނެ ކަމަށް ފެނެއެވެ.

ރާއްޖޭގެ އަތޮޅު ތަކާއި ރަށްތައް އުފެދިފައިވާ ގޮތާ މެދު މަހާއިލްމުވެރިއެއް ކަމަށްވާ ޑަރވިން ނަޒަރިއްޔާ ތަކެއް ފައުލޫކޮށްފައިވެއެވެ. އެކަމާ މެދު ޖިއޮލޮގިސްޓުންނާއި އިލްމުދާނުންގެ މެދުގައި ތަފާތު ހިޔާލުތައް އުފެދިފައިވެއެވެ. އެބައެއްގެ ނަޒަރުގައި އަތޮޅުތަކާއި ރަށްތައް އުފެދިފައި އޮތީ ވަރަށް ކުރީ ޒަމާނެއްގައި ހިންދު ކަނޑު އޮތް ބޮޑު އަތޮޅަކަށް މެދުވެރިވި ޖިއޮލޮޖިކަލް ހާދިސާ އަކަށް ފަހު ދެން އައި ޒަމާނެއްގައި އެ އަތޮޅު ގިރެމުން ގޮސް އަތޮޅުގެ ބައެއް ތަންތަން ކަނޑުގެ ސަތުހުން އަޑިއަށް ގެނބިފައިވަނިކޮށް އެ އަތޮޅުގެ ބެޑްރޮކުގައި އަލުން މުރަކަ ހެދި ދިރެމުން ބޮޑުވަމުން އައިސް އެކިއެކި ސިފައިގެ ގިރި ފަޅުތައް މައްޗަށް އުފުލި އެ ތަންތާގައި ރަށްތައް އުފެދި އަތޮޅުތަކަށް ވީއެވެ.

އަނެއް ބައެއްގެ ނަޒަރުގައި ކަނޑުގެ އަޑީގެ ބެޑްރޮކް ގިނިފަރުބަދީ ހަރަކާތްތަކަކުން އުފުލި ކަނޑުގެ ސަތުހުން މައްޗަށް އެރި ތަންތާގައާއި ދެ ފެންދޭތެރެއަށް އުފުލުނު ތަންތަނުގައި މުރަކަ ފަދަ ތަކެތި އުފެދި ދިރެމުން އައިސް ފަރު (ރިންގް) އުފެދި އެ ފަރުތަކުގެ ދުނީގައާއި ރިންގު ތަކުގެ އެތެރޭ ބައިގާ (އަތޮޅުތެރެ) ރަށްރަށް އުފެދި އަތޮޅުތައް އުފެދޭ ގޮތް ވީއެވެ.

ތިންވަނަ ބައެއްގެ ނަޒަރުގައި ދުނިޔޭގެ އައިސްއޭޖުގައި ކަނޑުގެ ލޮނުގަނޑު މާބޮޑަށް ފިނިގަނޑުވުމުގެ ސަބަބުން ކަނޑުގެ ލޮނުގަނޑުގެ ލެވެލް ތިރިވެގެން ދިޔަދިއުމުގައި ކުރީގައި އުފެދިފައި ހުރި ފަރުތަކުގެ މުރަކަތައް މަރުވެ ރާޅާއި ވައިގެ ހަރަކާތުން ގިރިގެން ގޮސް ސިފަ ގެއްލިފައި ވަނިކޮށް ކަނޑުގެ ލޮނުގަނޑު އަލުން ހޫނު ވަމުން އައިސް އެތަންތާގައި އަލުން މުރަކައިގެ ވައްތަރުތައް ހެދި ދިރެމުން ގޮސް އަތޮޅުތަކާއި ރަށްތައް އުފެދުނީ އެވެ.
ކަނޑާއި ރަށްތައް އޮންނަލެއް ކައިރި ކަމުން އާންމު ގޮތެއްގައި ރާއްޖޭގެ ވައިގެ ތެތްކަން ހުންނަނީ ވަރަށް މަތީގައެވެ. މީގެ ސަބަބުން މުޅި އަހަރު ތެރޭގައިވެސް ފިނިހޫނު މިނަށް މާބޮޑު ބަދަލުތަކެއް ނާދެއެވެ. ދިވެހިރާއްޖޭގެ އެވަރެޖު ފިނިހޫނުމިނަކީ ގާތްގަނޑަކަށް °30 ސެލްސިއަސްގައެވެ. އެންމެ ގިނައިން ވާރޭވެހޭކަމަށް ފާހަގަ ކުރެވިފައިވަނީ ޖޫން މަހާއި ނޮވެމްބަރުމަހާ ދެމެދުގައެވެ.
ދިވެހިރާއްޖޭގެ އާބާދީ ކަމުގައި 2003 ވަނަ އަހަރު ރެކޯރޑް ކުރެވިފައިވަނީ 329684 މީހުންނެވެ. އެވަރެޖު ގޮތެއްގައި އަކަ ކިލޯމީޓަރަކަށް ޖެހޭ މީހުންގެ އަދަދު ނުވަތަ އާބާދީގެ އަކަބުރަ އަކީ ގާތްގަނޑަކަށް 1106 މީހުންނެވެ. ދިވެހިރާއްޖޭގައި އޮތް އެންމެ އާބާދީ ބޮޑު ރަށަކީ، ދިވެހިރާއްޖޭގެ ވެރިކަންކުރާ ރަށް ކަމުގައިވާ ފުރަމާލެއެވެ. 1999 ވަނަ އަހަރު މާލޭގެ އާބާދީ ކަމުގައި ބެލެވިފައިވަނީ 72000 މީހުންނެވެ. މާލޭގެ އިތުރުން އެންމެ އާބާދީ ބޮޑު ހިސާބުތަކަކީ ސުވައިދީބާއި (ދެކުނުގެ ހަތަރުއަތޮޅު ނުވަތަ ބޮޑުދެކުނާއި) ބޮޑުތިލަދުންމައްޗެވެ. ދިވެހިންގެ ނަސްލަކީ މަސްހުނި ނަސްލެކެވެ. ދިވެހިންގެ ނަސްލު ބިނާވެފައިވަނީ އިންޑިޔާ ދަރިކޮޅާއި އަރަބި ދަރިކޮޅާއި އެފްރިކާ ދަރިކޮޅާއި މެލޭދަރިކޮޅުގެ މައްޗަށެވެ. މަދުމަދުން ޔޫރަޕުގެ ނަސްލާއި މަސްހުނިވެފައިވާ މީހުންވެސް މިރާއްޖެއިން ފެނެއެވެ.
ރާއްޖެ އިސްލާމްވިގޮތާމެދު އަޅުގަނޑުގެ ޚިޔާލު

ދިވެހިރާއްޖެ އިސްލާމްވިކަމަށް ބެލެވިފައިވަނީ ހިޖުރައިން 6 ވަނަ ޤަރުނުގެ ކުރީކޮޅުގައެވެ. އެއީ މީލާދީން 12 ވަނަ ޤަރުނުގެ ކުރީކޮޅެވެ. ރަސްމީ ގޮތުން ދިވެހިރާއްޖެ އިސްލާމްވި ދުވަހުގެ ގޮތުގައި ފާހަގަކުރަނީ ދިވެހިރާއްޖޭގެ އެއިރުގެ ރަދުން އިސްލާމް ދީނަށް ވެދެވަޑައިގަތް ދުވަސްކަމުގައި ބެލެވޭ ދުވަހެވެ. އެ ދުވަހަކީ 2 ރަބީޢުލް އާޚިރު 548 ހ. (26 ޖޫން 1153 މ.) ވީ ހުކުރުދުވަހެވެ.

ދިވެހިރާއްޖެ އިސްލާން ކުރެއްވި ބޭފުޅަކާމެދު ތާރީޚު ލިޔުއްވާ ބޭފުޅުންގެ މެދުގައި ޚިޔާލު ތަފާތުވުން އުފެދިފައިވެއެވެ. އަލްއަމީރު މުޙައްމަދު އަމީން ދޮށިމޭނާ ކިލެގެފާނު ދެކެވަޑައިގަންނަވާ ގޮތުގައި ދިވެހިރާއްޖެ އިސްލާން ކުރެއްވީ މައުރިބުކަރައިގެ ބޭފުޅެއް ކަމުގައިވާ މައުލާނަލް ޙާފިޡް އަބުލް ބަރަކާތު ޔޫސުފުލް ބަރުބަރީއެވެ. އަދި މެދުޒިޔާރަތުގައި ފަސްދާނުލެވިފައިވަނީ އެމަނިކުފާނުކަމުގައި މުޙައްމަދު އަމީން ވިދާޅުވަނީ މައުރިބުކަރައިގެ ދަތުރުވެރިއެއް ކަމުގައިވާ އިބުނި ބަޠޫޠާ ގެ ދަތުރުނާމާ ގެ މައްޗަށް ބުރަވެ ވަޑައިގެންނެވެ. މިދަތުރުނާމާ ލިޔުއްވާފައިވަނީ ބަޠޫޠާގެ ހަނދާނުގެ މައްޗަށް ބުރަ ކުރައްވައިގެން، އެ ދަތުރުތައް ކޮށް ނިމުނުތާ އެތައް ދުވަހެއް ފަހުން، ކަމަށް އިބުނި ބަޠޫޠާގެ ދަރިވަރެއް ކަމުގައިވާ އިބުނި ޖަރޒީ އިއުތިރާފުން ސާބިތު ވެއެވެ.

ދިވެހި ތާރީޚު ޢިލްމުގެ ބައްޕަ ކަމުގައި ބެލެވޭ އަލްޤާޟީ ޙަސަން ތާޖުދީނު، އޭނާގެ ތާރީޚުގައި ދިވެހިރާއްޖެ އިސްލާން ކުރެއްވި ކަމަށް ލިޔުއްވާފައި ވަނީ މައުލާނައް ޝައިޚް ޔޫސުފް ޝަމްސުއްދީނު އައްތަބްރޭޒީ ނަމަކަށްކިޔާ ފާރިސީއެކެވެ. ޙަސަން ތާޖުއްދީނުގެ މި ބަހުގެ ބިންގަލަކީ ހުކުރު މިސްކިތު މިހުރާބުގޭ ބިތުގައި ލިޔެވިފައިވާ ލިޔުމާއި ހުކުރު މިސްކިތުގައި ބެހެއްޓިފައި ހުރި ތާރީޚީ ފިލައެވެ. އަދި ހަމަ އެހެންމެ މައްޝޫރު ތާރީޚު ޢިލްމުވެރިޔާ އަލްއުސްތާޛުލް މަރްޙޫމް މުޙައްމަދު އިބްރާހީމް ލުޠުފީ ވެސް ބުރަވެވަޑައިގަންނަވާ ގޮތުގައި ދިވެހިރާއްޖެ އިސްލާން ކުރެއްވީ މައުލާނަލް ޙާފިޡް ޔޫސުފު އައްތަބްރޭޒީ އެވެ.

އެހެން ބޭފުޅަކު މި ސައިޓުގައި ލިޔުއްވާފައިވާ ފަދައިން އަޅުގަނޑަށްވެސް ބުރަ ވެވެނީ ދިވެހިރާއްޖެ އިސްލާމް ކުރެއްވީ ފާރިސީއެއް ކަމަށެވެ. ސަބަބަކީ މިދެންނެވި ބޭފުޅާވެސް ލިޔުއްވާފްއިވާ ފަދައިން، ދިވެހިރާއްޖެ އިސްލާން ކުރެއްވީ މައުރިބުގެ ބޭފުޅެއް ކަމުގައި ވިދާޅުވެފައިވަނީ ހަމަ އެ މައުރިބުގެ ބޭފުޅާ ކަމުގައި ވެފައި، ދިވެހިރާއްޖޭގެ ތާރީޚު އިލްމުވެރީން ވިދާޅުވަމުން އައީ ރާއްޖެ އިސްލާމް ކުރެއްވީ ފާރިސްކަރައިގެ ބޭފުޅެއް ކަމަށްވާތީއެވެ. (މަޣްރިބު (މޮރޮކޯ) އަކީ އެފްރިކާގެ ހުޅަނގުބިތުގައި ޔޫރަޕު ބައްރާ އެންމެ ކައިރީގައި އޮންނަ ގައުމެވެ. އަރަބިބަހުން ވާހަކަދައްކާ އަރަބި ގައުމެކެވެ. ފާރިސްކަރަ (އީރާން) އަކީ މެދުތެރޭ އޭޝިޔާގެ ގައުމެކެވެ.) އަރަބި ގައުމެއްގެ މީހަކު ދިވެހިރާއްޖެ އިސްލާން ކުރެއްވި ނަމަ ދިވެހިބަހުގައި ހުރި ދީނީ އިސްތިލާހުގެ ތެރޭގައި ހިމެނޭ އެންމެ އަސާސީ އިސްތިލާހުތައް ހުރީހީ އަރަބި ބަހުން ކަން ކަށަވަރެވެ. ތިރީގައި އެވަނީ އެފަދަ އިޞްތިލާޙުތައް ދިވެހި، ޢަރަބި އަދި ފާރިސީ ބަހުން ބޭނުންކުރާގޮތެވެ.

މިސާލު: ނަމާދު (ދިވެހި)، ނަމާޒު (ފާރިސީ)، ޞަލާތު( އަރަބި). ރޯދަ (ދ)، ރޯޒާ (ފ)، ޞިޔާމް (އ). ބަންގި (ދ)، ބަންގި (ފ)، އާޛާން (އ)

މިހުރިހާ ކަމަކުން ވެސް ސާބިތުވަނީ ދިވެހިރާއްޖެ އިސްލާން ކުރެއްވީ ފާރިސްކަރައަށް ނިސްބަތްވާ ބޭފުޅެއް ކަމެވެ. ކޮންމެ އަކަސް އިބުނި ބަޠޫޠާގެ ދަތުރުނާމާ ދިވެހިން ދުށުމުގެ ކުރީގައި ދިވެހިރާއްޖޭގައި ކޮންމެ އަހަރަކުވެސް ތަބްރޭޒީގެފާނުގެ އަހަރުމަތިފުޅު ފާހަގަ ކުރުން އޮތެވެ. އިބުނި ބަޠޫޠާގެ ދަތުރުނާމާ ދިވެހިންނަށް ލިބޭ ގޮތް ވުމުން އިބުނި ބަޠޫޠާ އަކީ އަރަބިންގެ މީހަކަށް ވާތީ އޭނާގެ ވާހަކަ ޒަމާނުއްސުރެ އެންމެހައި ދިވެހިން ތަވާތުރުގެ މަގުން ރިވާ ކުރަމުން އައި ވާހަކަ އަށް ވުރެ އިބުނި ބަޠޫޠާގެ ވާހަކަ އަށް އިސްކަމެއް ދިނުމަކީ މުހިއްމު ކަމެއްގެ ގޮތުގައި އެއިރު ތިއްބެވި އިސްވެރީންނަށް ފެނުނީއެވެ. ބަހަވީ ހަމައަކުން ވިސްނާއިރު ދިވެހިރާއްޖެ އިސްލާން ކުރެއްވީ އަރަބި އަސްލަށް ނިސްބަތްވާ އަރަތްބެއް ނޫންކަން ވަރަށް ސާފުކޮށް އެނގެއެވެ.
މަސްވެރިކަން
ދިވެހިރާއްޖޭގެ އިޤްތިޞާދު ބިނާވެފައިވަނީ މަސްވެރިކަމުގެ މައްޗަށެވެ. 1999 ވަނަ އަހަރުގެ ތެރޭގައި ދިވެހިރާއްޖެއަށް ބާނާފައިވަނީ 133547 މެޓްރިކް ޓަނެވެ. މަހުގެ ތެރެއިން އެންމެ އަގު ބޮޑު ވައްތަރަކީ ކަޅުބިލަމަހެވެ. މުރަކަތަކާއި ބޮލިތައް ވެސް ނެގެއެވެ. ދިވެހިރާއްޖޭގެ މައިގަނޑު ޤުދުރަތީ ވަޞީލަތަކީ ވަށައިގެންވާ ކަނޑުން ލިބޭ ކަނޑުރޯއްޖެވެ.

ސިނާޢަތު
ކާރުޚާނާތަކުގެ މަސައްކަތް މަޙްދޫދުކުރެވިފައިވަނީ ހެދުމާއި މަސްވެރިކަމުގެ މައްޗަށެވެ.

ފަތުރުވެރިކަން
ފަތުރުވެރިކަމުގެ ދާއިރާދަނީ ތަރައްޤީވަމުންނެވެ. 2006 ވަނަ އަހަރު ދިވެހިރާއްޖެއަށް 601923 ފަތުރުވެރިން ޒިޔާރަތްކޮށްފައިވެއެވެ. ފަތުރުވެރިކަން ދިވެހިރާއްޖޭގެ އިގްތިސާދުގެ 27% ޙިއްސާކުރޭ. ފަތުރުވެރިކަން ދިވެހިރާއްޖޭއަށް ބޭރުފައިސާގެ 70% ޙިއްސާކުރޭ.

ފަތުރުވެރިކަމުން ސީދާގޮތުން 25000 މީހުންނަށްވުރެ ގިނަ ފަރާތްތަކަށް ވަޒީފާގެ ފުރުސަތު ލިއްބައިދޭ.

ދިވހިރާއްޖޭގެ ފަތުރުވެރިކަމުފެ ދާއިރާގައި މިހާރު 90 ރިޒޯރޓު، 123 ސަފާރި ބޯޓު، 10 ހޮޓާ އަދި 273 އަށްވުރެގިނަ ޓްރެވަލް އެޖެންޓުން 2006 ވަނައަހަރު މަސައްކަތްކުރޭ.

ދިވެހިރާއްޖޭގެ ޓޫރިޒަމް ދާއިރާގައި އާންމުންނަށް ހިއްޞާ ވިއްކާގޮތަށް އުފެއްދި ފުރަތަމަ ކުންފުނި މޯލްޑިވްސް ޓޫރިޒަމް ޑިވެލޮޕްމަންޓް ކޯޕަރޭޝަން (އެމް.ޓީ.ޑީ.ސީ) ރަޖިސްޓްރީ ކޮށްފައިވަނީ 9 އެޕްރީލް 2006 ގައެވެ. ކުންފުނީގެ ފުރަތަމަ ޗެއަރމަން އަކީ އަލްފާޟިލް ޙުސައިން ޢަފީފް، މ. ޗަމްޕާ ސްޓަރ އެވެ. މެނެޖިންގ ޑިރެކްޓަރަކީ އަލްފާޟިލް މުޙައްމަދު ޞާލިޙް، މ. ޝުއާޒް އެވެ. ކުންފުނީގެ ސެކެޓްރީއަކީ އަލްއުސްތާޛް އިސްމާޢީލް ޔާސިރު، ހ. ގޯބިލިގެއެވެ.

ކެޕިޓަލްގެ ގޮތުގައި ސަތޭކަމިލިޔަން ދިވެހިރުފިޔާ ހޯދުމަށްޓަކަައި ހިއްސާވިއްކުމަށް ކުންފުނީގެ ބޯޑުން 3 ޖޫން 2006 ގައި ފާސްކޮށް، 15 ޖޫން 2006 ގެ ތާރީޚުގައި ހިއްޞާގެ ބަޔާނެއް ނެރެފައިވެއެވެ. ކުންފުނިން ވިއްކަން ހަމަޖެއްސީ 100 ރުފިޔާގެ 1،000،000 ހިއްސާއެވެ. ހިއްސާއަށް އެދޭފަރާތްތަކުގެ ލިސްޓް ހުޅުވާލީ 2 ޖުލައި 2006 ގެ ހެދުނު 10:00 ގައެވެ. އާންމުފަރުދުންނަށް ގަނެވޭގޮތަށް ވިއްކި ހިއްސާ ވިއްކީ އެއްފަރާތަކަށް ގިނަވެގެން 100 ހިއްސާއަށްވުރެ އިތުރަށް ނުގަނެވޭ ގޮތަށެވެ.
ދަނޑުވެރިކަން
ދިވެހިރާއްޖޭގައި މައިގަނޑު ގޮތެއްގައި ހެދެނީ، ދިވެހިރުކާއި، ބަނބުކޭލާއި، ހިރުނދާއި، ކާންޏާއި ފުނައިގެ އިތުރުން މިދިއްޔާއި ނިކައެވެ. ދަނޑުވެރިކަމަށް ރަނގަޅުކަމުގައި ބޮޑަށް ފާހަގަ ކުރެވިފައިވަނީ އަތޮޅު އުފެދިފައި އޮންނަ ގޮތުން އަތޮޅުގެ އިރުމަތީބިތުގައި ހުންނަރަށްރަށެވެ. އެންމެ މައިގަނޑު ދަނޑުވެރިކަމުގެ ބާވަތަކީ ކާއްޓެވެ. ކާބޯތަކެތީގެ ތެރެއިން ގިނަ ބާވަތްތައް ޖެހެނީ ބޭރު ޤައުމުތަކުން ރާއްޖެއަށް އެތެރެކުރާށެވެ.
ބޭރުގެ ދަތުރު ފަތުރު
ކާގޯ އުޅަނދު ފަހަރު
ދިވެހި ރާއްޖެއަށް މުދާ އެތެރެކޮށް ބޭރުކުރަނީ އާންމު ގޮތެއްގައި ކާގޯ އުޅަނދު ފަހަރު ނުވަތަ މުދާ އުފުލާ ބޮޑެތި ބޯޓް ފަހަރު ގެ އެހީގައެވެ. ދިވެހި ރާއްޖެއާއި ދުނިޔޭގެ އެތައް ގައުމު ތަކާއި ދެމެދު މުދާ އުފުލުމުގައި ހަރަކާތްތެރިވާ ދިވެހިރާއްޖޭގައި ރަޖިސްޓްކުރެވިފައިވާ މިފަދަ 9372 އުޅަނދު ވެއެވެ.

ކޮންޓޭނަރު އުފުލާ އުޅަނދު ފަހަރު
ކޮންޓޭނަރުތަކުގައި މުދާ އުފުލައިގެން ގެނެސް މާލޭ ވިޔަފާރި ބަނދަރަށް މުދާ ހުސްކުރުމުގެ މަސައްކަތް ފެށިފައިވަނީ 1980ގެ އަހަރުތަކުގެ ކުރީކޮޅުގައެވެ. މިއަދު ވިޔަފާރި ބަނދަރު ވަނީ ގެންނަ މުދާ އެކަށޭނަ ވަރަށް ނުބޭޅުމުގެ ދަތިކަން ކުރިމަތި ވެފައެވެ. އެއީ ބޯޓްތަކުން ބާލާ މުދާ ކޮންޓޭނަރުތައް ޖަހާނެ ޖާގަ ނެތުމުގެ ސަބަބުންނެވެ.

ޝިޕިންގ ކޮމްޕެނީތަކާއި، އެޖެންސީތައް
ދިވެހި ރާއްޖޭގައި ރަޖިސްޓްރީ ކުރެވި ޚިދުމަތްދޭ އެންމެ ބޮޑު އަދި އެންމެ ފުޅާ ދާއިރާއެއްގައި މަސައްކަތް ކުރާ ޝިޕިންގ ކުންފުންޏަކީ ސަރުކާރުގެ ޝިޕިންގ ކޮމްޕެނީ މޯލްޑިވްސް ނޭޝަނަލް ޝިޕިންގ މެނޭޖްމަންޓް ލިމިޓެޑް ނުވަތަ އެމްއެސްއެމްއެންއެލް އެވެ. މީގެ އިތުރުން އަމިއްލަ ވަރަށް ގިނަ ޝިޕިން ކުންފުނިތައް ވެސް މިދާއިރާގައި ހަރަކާތްތެރި ވެއެވެ.

އަތޮޅު ތަކުގެ ތެރޭގައި ކުރެވޭ ދަތުރު ފަތުރު
ދޯނި
ރާއްޖެތެރޭގެ އެއް ރަށުން އަނެއް ރަށަށް އަދި ރަށްފުށުން ވެރިރަށް މާލެއަށް އައުމަށް އަދިވެސް ބޭނުންކުރެވޭ އެންމެ އާންމު އެއް ވަޞީލަތަކީ ދޯންޏެވެ. ދޯނި ކުރިން ބަދެ މުޅިން ވެސް އުޅުނީ ރުކުގެ ލަކުޑިން ކަމަށް ވިޔަސް މިއަދު ދޯނި ބަނުމަށް ބޭރުން ގެނެސްފައި ހުންނަ ލަކުޑި ބޭނުންކުރާކަން ފާހަގަ ކުރެވެއެވެ. ޒަމާންތަކެއް ވަންދެން ދިވެހިން ބަންނަމުން ދިޔަ ދޯނިތަކުގެ ސިފަޔަށް ބަދަލު ނައިސް ހުއްޓަސް ޒަމާނާއެކު މިހާރު ތަފާތު ގޮތްގޮތަށް ބަދެފައި ހުންނަ ދޯނި ފަހަރު ފެނެއެވެ.
ބައްތެލި
ބައްތެއްޔަކީ ރާއްޖެތެރޭގެ އެއް ރަށުން އަނެއް ރަށަށް ދިއުމަށް ބޭނުންކުރާ ކަނޑުދަތުރު ކުރާ އުޅަނދެކެވެ. އަދި މާލެ ދަތުރު ކުރުމަށް ވެސް ބައްތެލި ބޭނުން ކުރެއެވެ.

އޮޑި
އޮޑި އަކީ ބަންނަމުންދާ ދޯނި ފަހަރަށް ކިޔައި އުޅޭ ނަމެކެވެ.

އިންޖީނު އެޅި އުޅަނދު ފަހަރު
ސަރުކާރުގެ ފަރާތުން ހިންގަން ފެށި މަޝްރޫޢެއްގެ ދަށުން ބަދެވުނު ފުރަތަމަ އިންޖީނުލީ އުޅަނދު ބަދެ ނިމި ބޭނުންކުރަން ފެށުނީ 1974 ވަނަ އަހަރު އެވެ. މިއަދު ރާއްޖޭގައި ބޭނުންކުރާ ކަނޑު ދަތުރުކުރާ އުޅަނދު ފަހަރު 99 އިންސައްތަ އަކީ އިންޖީނު އެޅި އުޅަނދު ފަހަރެވެ.

ސްޕީޑް ލޯންޗު
ބޭނުން ބަޔަކު ދަތުރު ކުރުމަށް ސްޕީޑް ލޯންޗުގެ ޚިދުމަތް އަގަށްދޭ ކުންފުނިތައް ރާއްޖޭގައި ހުރެއެވެ. މިފަދަ ލޯންޗުތަކުގެ އެހީގައި އެކި އެކި ޢީދު ތަކާއި މުނާސަބާތަކުގައި ރާޢްޖެތެރެއަށް ދަތުރުކުރެއެވެ.

މާލޭ ވިޔަފާރި ބަނދަރު
މާލޭ ވިޔަފާރި ބަނދަރު ރަސްމީކޮށް ހުޅުވައިދެއްވީ 15ސެޕްޓެމްބަރު 1986 ގައި ރައީސުލް ޖުމްހޫރިއްޔާ އަލް އުސްތާޛު މައުމޫން ޢަބުދުލް ގައްޔޫމް އެވެ. މިހާރު މިބަނދަރުގައި މުދާ ބޭލުމަށް 101 މީޓަރުގެ ދިގު،10.84 މީޓަރުގެ ފުޅާ މަގަތު ފާލަމެއް އޮވެއެވެ. ވިޔަފާރި ބަނދަރަކުން ރައްޔިތުންނަށް ލިބެން ޖެހޭ ހުރިހާ ޚިދުމަތްތަކެއް މިބަނދަރުން ލިބެން ހުރެއެވެ.
EOT;
}
