<?php


namespace Faker\Provider\ar_EG;

/**
 * This class provides a list of most of the colors that is used in the Egyptian streets.
 *
 * Class Color
 * @package Faker\Provider\ar_EG
 */
class Color extends \Faker\Provider\Color
{
    protected static $safeColorNames = array(
        'احمر', 'ابيض', 'اسمر', 'ازرق',
        'اصفر', 'لبني', 'كحلي', 'رصاصي',
        'فضي', 'ذهبي', 'برتقالي', 'بني',
        'رمادي', 'ازرق داكن', 'وردي', 'ارجواني'
    );

    /**
     * @link https://ar.wikipedia.org/wiki/%D9%82%D8%A7%D8%A6%D9%85%D8%A9_%D8%A7%D9%84%D8%A3%D9%84%D9%88%D8%A7%D9%86_(%D9%85%D8%AA%D8%B6%D8%A7%D9%85%D8%A9)
     */
    protected static $allColorNames = array(
         'أبيض', 'أبيض الشبح', 'أبيض زهوري', 'أبيض عتيق', 'أحمر داكن', 'أحمر طوبي',
        'أحمر نحاسي', 'أخضر', 'أخضر تفاحي', 'أخضر تمويهي', 'أخضر داكن', 'أخضر مزرق',
        'أرجواني فوشي', 'أزرق', 'أزرق اردوازي داكن', 'أزرق داكن', 'أزرق رمادي', 'أزرق سماوي داكن',
        'أسود', 'أشقر', 'أصفر الكناري', 'أصفر برونزي', 'أصفر داكن', 'أصفر ذهبي', 'أصفر مخضر',
        'أصفر موزي', 'أفوكادوي', 'ألماسي', 'باذنجاني', 'برتقالي الجزر', 'برتقالي داكن', 'برتقالي محروق',
        'برونزي', 'بنفسجي داكن', 'بنفسجي مزرق', 'بني داكن', 'بني ذهبي', 'بني كاكاوي', 'بني (تقليدي)',
        'ترابي', 'تربي داكن', 'تربي محروق', 'خرنوبي', 'خزامي داكن', 'خزامي مضيء', 'خوخي عميق',
        'ذهبي', 'رماد الأخشاب', 'رمادي', 'رمادي دافي', 'رمادي داكن', 'رمادي بارد', 'رمادي خافت',
        'رمادي مزرق', 'زبرجدي', 'زرنيخي', 'زعفراني عميق', 'زمردي', 'زمردي مضيء', 'زنجبيلي',
        'زهري داكن', 'زهري مرجاني', 'زيتوني أسود', 'سلموني داكن', 'سيان', 'سيان داكن',
        'شوكولاتي (تقليدي)', 'صحراوي', 'صفروي', 'صوفي', 'طوبي', 'طيني نضيج داكن', 'عاجي',
        'عنبي', 'عنبي بري', 'فحمي', 'فوشي', 'فوشي عميق', 'فيروزي داكن', 'فيروزي مضيء', 'قرطبي',
        'قرفي', 'قرمزي', 'قشدي', 'قطيفي', 'قهوي', 'قهوي عميق', 'كتاني', 'كرزي', 'كرزي عميق',
        'لازوردي', 'لهيبي', 'لوزي', 'لوزي مبيض', 'ليموني عميق', 'مائي', 'مرجاني', 'مرجاني داكن',
        'مشمشي', 'مصفر', 'نحاسي', 'نحاسي أصفر', 'نحاسي عتيق', 'نيلي', 'وردي فوشي',
        'وردي مضيء', 'ياسميني', 'ياقوتي أزرق', 'ياقوتي عتيق', 'يوسفي داكن', 'يوسفي ذري',
    );
}
