<?php


namespace Faker\Provider\ar_EG;

use Faker\Calculator\Luhn;

/**
 * Provides a random generated male/female names that is popular in Egypt.
 *
 * Class Person
 * @package Faker\Provider\ar_EG
 */
class Person extends \Faker\Provider\Person
{
    protected static $maleNameFormats = array(
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{firstNameMale}} {{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{firstNameMale}} {{firstNameMale}} {{lastName}} {{lastName}}',
        '{{titleMale}} {{firstNameMale}} {{lastName}}',
    );

    protected static $femaleNameFormats = array(
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{firstNameMale}} {{lastName}}',
        '{{firstNameFemale}} {{firstNameMale}} {{firstNameMale}} {{lastName}}',
        '{{firstNameFemale}} {{firstNameMale}} {{firstNameMale}} {{lastName}} {{lastName}}',
        '{{titleFemale}} {{firstNameFemale}} {{lastName}}',
    );

    /**
     * @link https://www.7srey.com/names-boys-meaning/
     */
    protected static $firstNameMale = array(
        'آدم', 'أبراهيم', 'أحمد', 'أدهم', 'أسامة', 'أسعد', 'أشرف', 'أكرم', 'أمجد', 'أمين', 'أنس', 'أنور', 'أيمن', 'إبراهيم', 'إسلام', 'إسماعيل', 'إلياس', 'إياد', 'إيهاب', 'ابان', 'ابراهيم', 'احسان', 'احمد', 'ادم', 'ادهم', 'اديب', 'اسامة',
        'اسحاق', 'اسحق', 'اسعد', 'اسلام', 'اسماعيل', 'اسيد', 'اشراف', 'اشرف', 'اكرم', 'الحسين', 'امجد', 'امير', 'امين', 'أنس', 'انور', 'انيس', 'اياد', 'اياس',
        'ايمن', 'باسل', 'باسم', 'باهر', 'بدر', 'بسام', 'بشار', 'بشر', 'بشير', 'بكر', 'بلال', 'بليغ', 'بهاء', 'توفيق', 'جابر', 'جاسر', 'جاسم', 'جبر', 'جعفر', 'جلال', 'جمال', 'جميل', 'جهاد',
        'جواد', 'حاتم', 'حارث', 'حازم', 'حافظ', 'حامد', 'حبيب', 'حذيفة', 'حسام', 'حسان', 'حسن', 'حسني', 'حسين', 'حكم', 'حمد', 'حمدان', 'حمدي', 'حمزة', 'حمود', 'حميد', 'خالد', 'خضر', 'خلف', 'خليفة', 'خليل', 'خميس', 'داوود', 'ذياب', 'رأفت', 'رؤوف', 'رئاد',
        'رائد', 'راجح', 'راشد', 'راضي', 'راغب', 'رافت', 'رافع', 'رافي', 'رامز', 'رامي', 'رامين', 'ربيع', 'رجائي', 'رجب', 'رزق', 'رسلان', 'رشاد', 'رشيد', 'رضا', 'رضوان', 'رغد', 'رغيد', 'ركان', 'رماح', 'رياض', 'ريان', 'زاهر', 'زاهي', 'زايد',
        'زكريا', 'زهير', 'زياد', 'زيد', 'زيدان', 'زين', 'زين العابدين', 'سالم', 'سامح', 'سامر', 'سامي', 'ساهر', 'سعد', 'سعود', 'سعيد', 'سفيان', 'سليم', 'سليمان', 'سمعان', 'سميح', 'سند', 'سهل', 'سهم',
        'سيف', 'شادي', 'شافع', 'شاكر', 'شاهر', 'شريف', 'شهاب', 'صادق', 'صالح', 'صدام', 'صفوان', 'صقر', 'صلاح', 'صلاح الدين', 'ضرغام', 'ضياء', 'ضياء الدين', 'طارق', 'طالب', 'طاهر', 'طه', 'عادل', 'عاصم', 'عاطف',
        'عامر', 'عباس', 'عبد الباري', 'عبد الحافظ', 'عبد الحكيم', 'عبد الحليم', 'عبد الحميد', 'عبد الحي', 'عبد الرحمان', 'عبد الرحمن', 'عبد الرحيم', 'عبد الرزاق', 'عبد السلام', 'عبد السميع', 'عبد العزيز', 'عبد العفو', 'عبد الغني', 'عبد الفتاح', 'عبد القادر', 'عبد الكريم',
        'عبد اللطيف', 'عبد الله', 'عبد المجيد', 'عبد المولى', 'عبد الناصر', 'عبد الهادي', 'عبد ربه', 'عبداالله', 'عبدالاله', 'عبدالباسط', 'عبدالجليل', 'عبدالجواد', 'عبدالحليم', 'عبدالحميد', 'عبدالرؤوف', 'عبدالرحمن', 'عبدالرحيم', 'عبدالرزاق', 'عبدالسلام', 'عبدالعزيز', 'عبدالفتاح', 'عبدالقادر',
        'عبدالكريم', 'عبداللطيف', 'عبدالله', 'عبدالمجيد', 'عبدالمطلب', 'عبدالمعطي', 'عبدالمهيمن', 'عبدالناصر', 'عبدالهادي', 'عبدالوهاب', 'عبيدالله', 'عثمان', 'عدلي', 'عدنان', 'عزالدين', 'عزام', 'عزت',
        'عزمي', 'عزيز', 'عصام', 'علاء', 'علي', 'عليان', 'عماد', 'عمار', 'عمر', 'عمران', 'عمرو', 'عواد', 'عودة', 'عوده', 'عوض', 'عوف', 'عيد', 'عيسى', 'غازي', 'غالب', 'غانم', 'غدير', 'غسان', 'غيث', 'فؤاد', 'فائق', 'فاخر', 'فادي',
        'فارس', 'فاروق', 'فاضل', 'فايز', 'فتحي', 'فجر', 'فراس', 'فرح', 'فريد', 'فهد', 'فهمي', 'فواز', 'فوزي', 'فيصل', 'قارس', 'قاسم', 'قبلان', 'قتاده', 'قتيبة', 'قصي', 'قيس', 'كاظم', 'كامل', 'كرم', 'كريم', 'كمال', 'لؤي', 'لبيب', 'لطف', 'لطفي',
        'مؤمن', 'مؤنس', 'مؤيد', 'ماجد', 'مازن', 'مالك', 'مامون', 'ماهر', 'مبارك', 'مجدي', 'محسن', 'محمد ', 'محمود', 'محي', 'مختار', 'مخلص', 'مدحت', 'مدين', 'مراد', 'مرشد', 'مروان', 'مسعد', 'مسعود', 'مسلم', 'مشعل', 'مصطفى', 'مصطفي', 'مصعب',
        'معاذ', 'معاوية', 'معتز', 'معتصم', 'معمر', 'معين', 'ممدوح', 'مناف', 'منتصر', 'منذر', 'منصف', 'منصور', 'منير', 'مهاب', 'مهدي', 'مهران', 'مهند', 'موسى', 'موفق', 'نائل', 'ناجي', 'نادر', 'ناصر',
        'نبيل', 'نجيب', 'نديم', 'نزال', 'نزيه', 'نسيم', 'نشات', 'نصار', 'نصر', 'نضال', 'نظام', 'نعيم', 'هادي', 'هارون', 'هاشم', 'هانى', 'هاني', 'هشام', 'هلال', 'همام', 'هيثم', 'وائل',
        'واصف', 'وجدي', 'وجيه', 'وحيد', 'وديع', 'وسيم', 'وصفي', 'وليد', 'وهيب', 'ياسر', 'ياسين', 'يحيى', 'يزيد', 'يعقوب', 'يوسف', 'يونس',
    );

    /**
     * @link https://www.qallwdall.com/%d8%a3%d8%ac%d9%85%d9%84-%d8%a7%d8%b3%d9%85%d8%a7%d8%a1-%d8%a8%d9%86%d8%a7%d8%aa-%d9%88%d9%85%d8%b9%d8%a7%d9%86%d9%8a%d9%87%d8%a7-%d9%81%d9%8a-2019/
     */
    protected static $firstNameFemale = array(
        'آثار', 'آلاء', 'آية', 'أبرار', 'أحلام', 'أسماء', 'أسيل', 'أصاله', 'أفنان', 'ألاء', 'أماني', 'أمل', 'أميرة', 'أنوار', 'إخلاص', 'إسراء', 'إسلام', 'إنعام', 'إيمان', 'إيناس', 'ابتهاج', 'ابتهال', 'أبرار', 'إخلاص', 'أروى', 'أريج',
        'أزهار', 'اسراء', 'اسيل', 'اشراق', 'أصالة', 'اعتدال', 'أفنان', 'آلاء', 'إلهام', 'آمال', 'أمنة', 'أميرة', 'أمينة', 'أنعام', 'أنوار', 'آيات', 'إيمان', 'إيناس', 'آية', 'بتول', 'بثينة', 'بدور', 'بسمة',
        'بشرى', 'بلسم', 'تالا', 'تالة', 'تالين', 'تحرير', 'تسنيم', 'تغريد', 'تقوى', 'تقى', 'تمارا', 'تماضر', 'تمام', 'تهاني', 'تولين', 'ثريا', 'جمانة', 'جميلة', 'جنى', 'جهاد', 'جود', 'حبيبة', 'حسناء', 'حصة', 'حلا', 'حليمة', 'حنان', 'حنين', 'حياة',
        'خديجة', 'خلود', 'دارين', 'داليا', 'دالية', 'دانا', 'دعاء', 'دلال', 'دنى', 'دنيا', 'ديانا', 'ديما', 'دينا', 'راغدة', 'راما', 'رانيا', 'راوية', 'رباب', 'رجاء', 'رحمة', 'رحمه', 'ردينة', 'رزان',
        'رشا', 'رغد', 'رغدة', 'رقية', 'رنا', 'رناد', 'رند', 'رنده', 'رنيم', 'رنين', 'رهف', 'رواء', 'روان', 'روزان', 'روزين', 'رويدة', 'ريتا', 'ريم', 'ريما', 'ريمان', 'ريناتا', 'ريناد', 'ريهام', 'زكية', 'زها', 'زهرة',
        'زينات', 'زينب', 'زينة', 'ساجدة', 'سارة', 'سجى', 'سحر', 'سرين', 'سعاد', 'سكينة', 'سلسبيل', 'سلمى', 'سلوى', 'سما', 'سماح', 'سماره', 'سمر', 'سمية', 'سميرة', 'سناء', 'سنابل', 'سندس', 'سنريت', 'سنن', 'سهاد', 'سهام', 'سهر', 'سهى', 'سهير', 'سهيله', 'سوار', 'سوزان', 'سوسن',
        'سيرين', 'سيرينا', 'سيلفا', 'سيلين', 'سيما', 'شذى', 'شروق', 'شريفة', 'شرين', 'شريهان', 'شفاء', 'شهد', 'شيرين', 'شيماء', 'صابرين', 'صبا', 'صباح', 'صبرين', 'صفا', 'صفاء', 'صفية', 'صمود', 'ضحى', 'ضياء', 'عائشة', 'عاليا', 'عالية', 'عبلة', 'عبير', 'عزة', 'عزيزة', 'عفاف', 'علا', 'علياء',
        'عنود', 'عهد', 'غادة', 'غدير', 'غرام', 'غزل', 'فاتن', 'فادية', 'فاديه', 'فاطمة', 'فايزة', 'فتحية', 'فداء', 'فدوى', 'فدى', 'فرح', 'فريال', 'فريدة', 'فوزية', 'فيروز', 'فيفيان', 'قمر', 'لارا', 'لانا', 'لبنا', 'لجين', 'لطيفة', 'لمى',
        'لميس', 'لورا', 'لورينا', 'لونا', 'ليان', 'ليدا', 'ليلى', 'ليليان', 'لين', 'لينا', 'لينة', 'ليندا', 'لينه', 'مايا', 'مديحة', 'مرام', 'مرح', 'مروة', 'مريام', 'مريم', 'مسعدة', 'مشيرة', 'معالي', 'ملاك', 'ملك', 'منار', 'منال', 'منى', 'مها', 'مي',
        'ميادة', 'مياده', 'ميار', 'ميان', 'ميرا', 'ميرال', 'ميران', 'ميرفت', 'ميس', 'ميساء', 'ميسر', 'ميسره','نادية', 'نادين', 'ناديه', 'نانسي', 'نبيله', 'نجاة', 'نجاح', 'نجلاء', 'نجود', 'نجوى', 'نداء', 'ندى',
        'ندين', 'نرمين', 'نسرين', 'نسيمة', 'نعمت', 'نعمه', 'نهاد', 'نهى', 'نوال', 'نور', 'نور الهدى', 'نورا', 'نوران', 'نيفين', 'هادلين', 'هازار', 'هالة', 'هانيا', 'هايدي', 'هبة', 'هدايه', 'هدى', 'هديل', 'هنا', 'هناء', 'هنادي', 'هند', 'هيا', 'هيفا',
        'هيفاء', 'هيلين', 'وئام', 'وداد', 'ورود', 'وسام', 'وسن', 'وسيم', 'وعد', 'وفاء', 'ولاء', 'يارا', 'ياسمين', 'يسرا',
    );

    protected static $lastName = array(
        'الهامي', 'الحسين', 'الحسن', 'الصفطي', 'الشحات', 'العسيلي',
        'عابدين', 'ابو محمد', 'ابو رحمة', 'عبد الرحمن', 'عبد الله',
        'السيد', 'ابو زيد', 'الشيهاوي', 'بحيري', 'النادي',
    );

    protected static $titleMale = array(
        'الاستاذ', 'المهندس', 'الدكتور', 'النجار',
        'الميكانيكي', 'السباك', 'السواق', 'الطباخ',
    );

    protected static $titleFemale = array(
        'الاستاذة', 'الدكتورة', 'المهندسة', 'السيدة',
        'المدام', 'الانسة',
    );

    private static $prefix = array(
        'أ.', 'د.', 'أ.د', 'م.',
    );

    /**
     * @example د.
     * @return string
     */
    public static function prefix()
    {
        return static::randomElement(static::$prefix);
    }

    /**
     * @example 21010101010110
     * @return string
     */
    public static function nationalIdNumber()
    {
        $partialValue = static::numerify(2 . str_repeat('#', 12));
        return Luhn::generateLuhnNumber($partialValue);
    }
}
