<?php


namespace Faker\Provider\ar_EG;

/**
 * This class is providing a long text from a famous Egyptian writer books.
 *
 * Class Text
 * @package Faker\Provider\ar_EG
 */
class Text extends \Faker\Provider\Text
{
    /**
     * Title: آيام مع جيسون
     * Author: آحمد خالد توفيق
     * Language: Arabic
     *
     * @link https://www.ida2at.com/days-with-gison/ --- https://aktowfik.blogspot.com/2018/04/blog-post_6.html
     * @var string
     */
    protected static $baseText = <<<'EOT'
كانت فترة عملي كطالب يدرس الإخراج مثمرة جدًا. كنت ملتحقًا بمدرسة الفيلم كما أنني كنت أتردد على الستوديوهات بشكل منتظم ..
مرحبًا بك .. أرى أنه لابد من أن نتعارف إذا كنا سنمضي الفترة القادمة معًا .. اسمي جيمي سبنسر .. عمري ثمانية وعشرون عامًا .. يقولون إن شلة عيال السينما التي سيطرت على السينما الأمريكية في السبعينيات كان أفرادها يمتازون بقبعات البيزبول واللادن واللحى. أنا حافظت على هذا التراث، ولي لحية حمراء تعجب البنات جدًا.
يجب أن أعترف لك أنني أهوى أفلام الرعب جدًا. لسبب ما أرى أنها مغامرات استكشافية لمخاوفنا في اللاوعي. نحن نعيش من جديد مخاوف أجدادنا ..
رأيت معظم أفلام المذءوبين ومصاصي الدماء والزومبي والمسوخ والأشباح والبيوت المسكونة وكل شيء.. كما درست جيدًا أفلام كروننبرج البيولوجية وجون كاربنتر الأصيلة وانبهرت بكليف باركر ككل واحد آخر.
قالت لي جودي على باب دار السينما:
ـ«التحورات .. هذا هو فيلم الليلة ؟»
قلت لها في شغف أنه هدفنا ..
قالت في إحباط:
ـ«اسمع .. أنا شبعت من كل أفلام المسوخ النائمة .. واللعنات المنسية .. والزجاجات التي تحوي سوائل تتمدد. أريد فيلمًا هادئًا بلا كهوف .. أريد شوارع وطائرات وعربات ..»
نظرت إلى الأفيشات المعلقة ثم قلت لها:
ـ«هناك شوارع على الأرجح»
كان فيلم (لالا لاند) يعرض في دار قريبة، لكن الموت بدا لي أسهل وأهون من أن أشاعد فيلمًا اسمه هكذا. لم أعد أتحمل الأفلام الرومانسية ولا الغنائية ولا أفلام الأكشن ولا الجاسوسية .. لربما أحببت الأفلام الحربية لكنهم لم يعودوا يصنعونها ..
أقدم لك جودي .. فتاتي .. نسيت أن أقول لك إنني أحب الفتيات البدينات قصيرات الشعر اللاتي يضعن عوينات. بعض الشباب لا يحب هذا النمط، لكن كل شخص مسئول عن ذوقه الخاص. ظريفة جدًا وأعتقد أنها مفعمة بالأمومة لو تزوجنا.
هكذا جلسنا في مقعدي السينما نلتهم الفيشار ونشاهد الشاشة العريضة .. كانت القاعة شبه خالية ..
الفيلم يدور حول رجل يكتشف ان أعضاءه تتحور وتكسب حياة خاصة بها. بمعنى آخر أنه يصحو من النوم ليكتشف أن ذراعه قد رحل .. الذراع رحل ليبدأ حياة خاصة به ويتحول إلى كائن حي يرى ويقتل .. ثم يصحو الرجل من النوم ليكتشف أن أسنانه هربت وصارت مخلوقات صغيرة حية ..
لم تكن الفكرة تخلو من جدة .. كابوسية جدًا كما أنها تحوي اللمسة المميزة للرعب البيولوجي لدى كروننبرج. لكن جودي لم تتحمس قط .. اقشعرت وبدا أنها موشكة على القيئ ..
بعد محاولات عنيفة سألتني:
ـ«هل تحب هذا ؟»
ـ«بالتأكيد.. هذا خيال مريض جامح ولا أتخيل أن أحدًا يجد هذه الفكرة بسهولة»
قالت في توسل:
ـ«أرجوك أن نرحل»
لم أر مناصًا من أن أنهض وأنا مغتاظ، وقررت أن أشتري الدي في دي فيما بعد. المخرج جيسون مكارثي لم يكف عن إبهاري .. في كل مرة راهنت عليه يتبين أنني على حق ..
جيسون مخرج مستقل يعمل خارج مظلة هوليوود وقيودها الحديدية. بارع وذكي جدًا ولديه جماعة خاصة تعشق أفلامه، لكنها ليست بالأفلام التي تناسب الجميع. أعداء الرعب سيكرهونها لأنها مرعبة جدًا .. وعشاق الرعب سيكرهونها لأنها لا تشبه أي شيء رأوه.
سن جيسون أربعون عامًا ويعيش في بيفرلي هيلز، وهو من الطراز الذي لا يدلي بلقاءات صحفية. نحيل جدًا أصلع الرأس يدخن بشراهة.
بعد أيام جاء فيلم اسمه (القبو).
اقترحت على جودي أن نرى الفيلم فسألتني في حذر عن اسم المخرج فقلت في استسلام:
ـ«المؤلف هو المخرج وهو المنتج .. إنه جيسون مكارثي»
«وأنا أعتذر عن عدم مشاهدة هذا العرض»
كان قرارها حاسمًا، وهكذا اضطررت إلى الذهاب للسينما وحيدًا لأنعم بمشاهدة (القبو) الذي تنتجه ستوديوهات (مورفيوس) الخاصة بجيسون.
القبو هو مكان حي .. لا ندرك هذا إلا في منتصف القصة، عندما ندرك أنه يبتلع الناس في شراهة .. من ينزلوا ليلاً تكن نهايتهم جسيمة.. القبو يخفي آثارهم لكن المتحمسين قد يجدون عظمة هنا أو هنا ..
أعترف أنه كابوس حقيقي..
عندما غادرت السينما كنت قد شاهدت اثني عشر فيلمًا لنفس المخرج والمؤلف.. لا شك أن هذا الرجل أوجد لغة سينمائي جديدة .. أفكاره لا تنتهي وكلها ساحر، ثم يأتي دور التنفيذ ..لا يستعمل ممثلين معروفين، إنما هم من طلبة السينما مثلي.
لابد أن أقابل جيسون ..
بعد أيام كنت في ستوديوهات باراماونت أدير حديثًا مع أحد مشغلي الكاميرا، عندما مرت سيارة غريبة أمامنا. نظر مشغل الكاميرا لراكب السيارة وقال:
«هذا جيسون مكارثي .. لابد أنك تعرفه»
كانت السيارة قد توقفت. لم تكن غالية كما توقعت . وعلى الفور هرعت لأحيي الرجل النحيل الذي يترجل من السيارة … نظر لي في دهشة ولم يكن سمجًا عامة.
في البدء طلبت منه التوقيع، ثم قلت له إني المعجب رقم واحد به ..
قال في شيء من الغرور:
ـ«كلهم يزعم أنه رقم واحد على كل حال»
تجاهلت التعليق وسألته:
ـ«هل لديك ورشة تدريبية ؟ ألا تشرح طريقتك في الطبخ للناس ؟»
أشعل لفافة تبغ سوداء غريبة المظهر وقال:
ـ«للأسف .. هذه أشياء لا يمكن تعليمها .. أنا ضد الورشات وضد صفوف الدراسة .. حضرت دورات ستوديو الممثل في بدايتي ولم استفد شيئًا»
لم أكن لأتعب فطلبت منه أن يسمح لي بحضور التصوير..
قال وهو يهز رأسه:
ـ«أنت عنيد»
ثم أخرج بطاقة صغيرة كتب عليها بعض كلمات وقال:
ـ«غدًا في السابعة صباحًا … أنت تعرف أين يقع ستوديو مورفيوس .. سيسمحون لك بالدخول»
وقبل أن أسترد وعيي كان قد ابتعد ..
لقد وضعت قدمي على بداية طريق الحلم. الحقيقة هي أن هذه علاقتي الأولى بالكابوس !
EOT;

    /**
     * Validate that the {$word} is valid Arabic word.
     *
     * @param $word
     * @return bool|false|int
     */
    protected static function validStart($word)
    {
        return preg_match('/^\p{Arabic}/u', $word);
    }
}
