<?php

namespace Faker\Provider\zh_CN;

class Lorem extends \Faker\Provider\Lorem
{
    /**
    * Generate a random sentence
    *
    * {@link} http://www.zdic.net/z/zb/cc1.htm
    **/
    protected static $wordList = array(
        '一','乙','二','十','丁','厂','七','卜','人','入','八','九','几','儿','了','力','乃','刀','又','三',
        '于','干','亏','士','工','土','才','寸','下','大','丈','与','万','上','小','口','巾','山','千','乞',
        '川','亿','个','勺','久','凡','及','夕','丸','么','广','亡','门','义','之','尸','弓','己','已','子',
        '卫','也','女','飞','刃','习','叉','马','乡','丰','王','井','开','夫','天','无','元','专','云','扎',
        '艺','木','五','支','厅','不','太','犬','区','历','尤','友','匹','车','巨','牙','屯','比','互','切',
        '瓦','止','少','日','中','冈','贝','内','水','见','午','牛','手','毛','气','升','长','仁','什','片',
        '仆','化','仇','币','仍','仅','斤','爪','反','介','父','从','今','凶','分','乏','公','仓','月','氏',
        '勿','欠','风','丹','匀','乌','凤','勾','文','六','方','火','为','斗','忆','订','计','户','认','心',
        '尺','引','丑','巴','孔','队','办','以','允','予','劝','双','书','幻','玉','刊','示','末','未','击',
        '打','巧','正','扑','扒','功','扔','去','甘','世','古','节','本','术','可','丙','左','厉','右','石',
        '布','龙','平','灭','轧','东','卡','北','占','业','旧','帅','归','且','旦','目','叶','甲','申','叮',
        '电','号','田','由','史','只','央','兄','叼','叫','另','叨','叹','四','生','失','禾','丘','付','仗',
        '代','仙','们','仪','白','仔','他','斥','瓜','乎','丛','令','用','甩','印','乐','句','匆','册','犯',
        '外','处','冬','鸟','务','包','饥','主','市','立','闪','兰','半','汁','汇','头','汉','宁','穴','它',
        '讨','写','让','礼','训','必','议','讯','记','永','司','尼','民','出','辽','奶','奴','加','召','皮',
        '边','发','孕','圣','对','台','矛','纠','母','幼','丝','式','刑','动','扛','寺','吉','扣','考','托',
        '老','执','巩','圾','扩','扫','地','扬','场','耳','共','芒','亚','芝','朽','朴','机','权','过','臣',
        '再','协','西','压','厌','在','有','百','存','而','页','匠','夸','夺','灰','达','列','死','成','夹',
        '轨','邪','划','迈','毕','至','此','贞','师','尘','尖','劣','光','当','早','吐','吓','虫','曲','团',
        '同','吊','吃','因','吸','吗','屿','帆','岁','回','岂','刚','则','肉','网','年','朱','先','丢','舌',
        '竹','迁','乔','伟','传','乒','乓','休','伍','伏','优','伐','延','件','任','伤','价','份','华','仰',
        '仿','伙','伪','自','血','向','似','后','行','舟','全','会','杀','合','兆','企','众','爷','伞','创',
        '肌','朵','杂','危','旬','旨','负','各','名','多','争','色','壮','冲','冰','庄','庆','亦','刘','齐',
        '交','次','衣','产','决','充','妄','闭','问','闯','羊','并','关','米','灯','州','汗','污','江','池',
        '汤','忙','兴','宇','守','宅','字','安','讲','军','许','论','农','讽','设','访','寻','那','迅','尽',
        '导','异','孙','阵','阳','收','阶','阴','防','奸','如','妇','好','她','妈','戏','羽','观','欢','买',
        '红','纤','级','约','纪','驰','巡','寿','弄','麦','形','进','戒','吞','远','违','运','扶','抚','坛',
        '技','坏','扰','拒','找','批','扯','址','走','抄','坝','贡','攻','赤','折','抓','扮','抢','孝','均',
        '抛','投','坟','抗','坑','坊','抖','护','壳','志','扭','块','声','把','报','却','劫','芽','花','芹',
        '芬','苍','芳','严','芦','劳','克','苏','杆','杠','杜','材','村','杏','极','李','杨','求','更','束',
        '豆','两','丽','医','辰','励','否','还','歼','来','连','步','坚','旱','盯','呈','时','吴','助','县',
        '里','呆','园','旷','围','呀','吨','足','邮','男','困','吵','串','员','听','吩','吹','呜','吧','吼',
        '别','岗','帐','财','针','钉','告','我','乱','利','秃','秀','私','每','兵','估','体','何','但','伸',
        '作','伯','伶','佣','低','你','住','位','伴','身','皂','佛','近','彻','役','返','余','希','坐','谷',
        '妥','含','邻','岔','肝','肚','肠','龟','免','狂','犹','角','删','条','卵','岛','迎','饭','饮','系',
        '言','冻','状','亩','况','床','库','疗','应','冷','这','序','辛','弃','冶','忘','闲','间','闷','判',
        '灶','灿','弟','汪','沙','汽','沃','泛','沟','没','沈','沉','怀','忧','快','完','宋','宏','牢','究',
        '穷','灾','良','证','启','评','补','初','社','识','诉','诊','词','译','君','灵','即','层','尿','尾',
        '迟','局','改','张','忌','际','陆','阿','陈','阻','附','妙','妖','妨','努','忍','劲','鸡','驱','纯',
        '纱','纳','纲','驳','纵','纷','纸','纹','纺','驴','纽','奉','玩','环','武','青','责','现','表','规',
        '抹','拢','拔','拣','担','坦','押','抽','拐','拖','拍','者','顶','拆','拥','抵','拘','势','抱','垃',
        '拉','拦','拌','幸','招','坡','披','拨','择','抬','其','取','苦','若','茂','苹','苗','英','范','直',
        '茄','茎','茅','林','枝','杯','柜','析','板','松','枪','构','杰','述','枕','丧','或','画','卧','事',
        '刺','枣','雨','卖','矿','码','厕','奔','奇','奋','态','欧','垄','妻','轰','顷','转','斩','轮','软',
        '到','非','叔','肯','齿','些','虎','虏','肾','贤','尚','旺','具','果','味','昆','国','昌','畅','明',
        '易','昂','典','固','忠','咐','呼','鸣','咏','呢','岸','岩','帖','罗','帜','岭','凯','败','贩','购',
        '图','钓','制','知','垂','牧','物','乖','刮','秆','和','季','委','佳','侍','供','使','例','版','侄',
        '侦','侧','凭','侨','佩','货','依','的','迫','质','欣','征','往','爬','彼','径','所','舍','金','命',
        '斧','爸','采','受','乳','贪','念','贫','肤','肺','肢','肿','胀','朋','股','肥','服','胁','周','昏',
        '鱼','兔','狐','忽','狗','备','饰','饱','饲','变','京','享','店','夜','庙','府','底','剂','郊','废',
        '净','盲','放','刻','育','闸','闹','郑','券','卷','单','炒','炊','炕','炎','炉','沫','浅','法','泄',
        '河','沾','泪','油','泊','沿','泡','注','泻','泳','泥','沸','波','泼','泽','治','怖','性','怕','怜',
        '怪','学','宝','宗','定','宜','审','宙','官','空','帘','实','试','郎','诗','肩','房','诚','衬','衫',
        '视','话','诞','询','该','详','建','肃','录','隶','居','届','刷','屈','弦','承','孟','孤','陕','降',
        '限','妹','姑','姐','姓','始','驾','参','艰','线','练','组','细','驶','织','终','驻','驼','绍','经',
        '贯','奏','春','帮','珍','玻','毒','型','挂','封','持','项','垮','挎','城','挠','政','赴','赵','挡',
        '挺','括','拴','拾','挑','指','垫','挣','挤','拼','挖','按','挥','挪','某','甚','革','荐','巷','带',
        '草','茧','茶','荒','茫','荡','荣','故','胡','南','药','标','枯','柄','栋','相','查','柏','柳','柱',
        '柿','栏','树','要','咸','威','歪','研','砖','厘','厚','砌','砍','面','耐','耍','牵','残','殃','轻',
        '鸦','皆','背','战','点','临','览','竖','省','削','尝','是','盼','眨','哄','显','哑','冒','映','星',
        '昨','畏','趴','胃','贵','界','虹','虾','蚁','思','蚂','虽','品','咽','骂','哗','咱','响','哈','咬',
        '咳','哪','炭','峡','罚','贱','贴','骨','钞','钟','钢','钥','钩','卸','缸','拜','看','矩','怎','牲',
        '选','适','秒','香','种','秋','科','重','复','竿','段','便','俩','贷','顺','修','保','促','侮','俭',
        '俗','俘','信','皇','泉','鬼','侵','追','俊','盾','待','律','很','须','叙','剑','逃','食','盆','胆',
        '胜','胞','胖','脉','勉','狭','狮','独','狡','狱','狠','贸','怨','急','饶','蚀','饺','饼','弯','将',
        '奖','哀','亭','亮','度','迹','庭','疮','疯','疫','疤','姿','亲','音','帝','施','闻','阀','阁','差',
        '养','美','姜','叛','送','类','迷','前','首','逆','总','炼','炸','炮','烂','剃','洁','洪','洒','浇',
        '浊','洞','测','洗','活','派','洽','染','济','洋','洲','浑','浓','津','恒','恢','恰','恼','恨','举',
        '觉','宣','室','宫','宪','突','穿','窃','客','冠','语','扁','袄','祖','神','祝','误','诱','说','诵',
        '垦','退','既','屋','昼','费','陡','眉','孩','除','险','院','娃','姥','姨','姻','娇','怒','架','贺',
        '盈','勇','怠','柔','垒','绑','绒','结','绕','骄','绘','给','络','骆','绝','绞','统',
    );


    /**
     * Generate a random sentence
     *
     * @example 'Lorem ipsum dolor sit amet.'
     * @param integer $nbWords         around how many words the sentence should contain
     * @param boolean $variableNbWords set to false if you want exactly $nbWords returned,
     *                                  otherwise $nbWords may vary by +/-40% with a minimum of 1
     * @return string
     */
    public static function sentence($nbWords = 6, $variableNbWords = true)
    {
        if ($nbWords <= 0) {
            return '';
        }
        if ($variableNbWords) {
            $nbWords = self::randomizeNbElements($nbWords);
        }

        $words = static::words($nbWords);
        $words[0] = ucwords($words[0]);

        return implode($words, '') . '。';
    }
}
