<?php

namespace Faker\Provider\zh_CN;

class Text extends \Faker\Provider\Text
{
    protected static $separator = '';
    protected static $separatorLen = 0;

    protected static $notBeginChar = array('、', '，', '：', '；', '！', '？', '……');
    protected static $notEndChar = array('、', '，', '：', '；');
    protected static $endChar = array('。', '！', '？');

    protected static $baseText = <<<'EOT'
照着镜子，看着，究竟镜子里的那个人，是不是我。这是一个疑问！在课室
里听讲的我，在院子里和同学们走着谈着的我，从早到晚，和世界周旋的我，
众人所公认以为是我的：究竟那是否真是我，也是一个疑问！
众人目中口中的我，和我自己心中的我，是否同为一我，也是一个疑问！
清夜独坐的我，晓梦初醒的我，一年三百六十五天之中偶然有一分钟一秒钟
感到不能言说的境象和思想的我，与课室里上课的我，和世界周旋的我，是否同为一我，也是一个疑问。这疑问永远是疑问！这两个我，永远不能分析。
既没有希望分析他，便须希望联合他。周旋世界的我呵！在纷扰烦虑的时候，请莫忘却清夜独坐的我！
清夜独坐的我呵！在寂静清明的时候也请莫忘却周旋世界的我！相顾念！相牵引！拉起手来走向前途去！
怎么独自站在河边上？这朦胧的天色，是黎明还是黄昏？
何处寻问，只觉得眼前竟是花的世界。中间杂着几条白蔷薇。
她来了，她从山上下来了。靓妆着，仿佛是一身缟白，手里抱着一大束花。
我说，“你来，给你一朵白蔷薇，好簪在襟上。”她微笑说了一句话，只是听不见。然而似乎我竟没有摘，她也没有戴，依旧抱着花儿，向前走了。
抬头望她去路，只见得两旁开满了花，垂满了花，落满了花。
我想白花终比红花好；然而为何我竟没有摘，她也竟没有戴？
前路是什么地方，为何不随她走去？
都过去了，花也隐了，梦也醒了，前路如何？便摘也何曾戴？
花蕾是蛹，是一种未经展示未经破坏的浓缩的美。花蕾是正月的灯谜，未猜中前可以有一千个谜底。花蕾是胎儿，似乎浑淹无知，却有时喜欢用强烈的胎动来证实自己。
花的美在于它的无中生有，在于它的穷通变化。有时，一夜之间，花拆了，有时，半个上午，花胖了，花的美不全在色、香，在于那份不可思议。我喜欢慎重其事地坐着昙花开放，其实昙花并不是太好看的一种花，它的美在于它的仙人掌的身世的给人的沙漠联想，以及它猝然而逝所带给人的悼念，但昙花的拆放却是一种扎实的美，像一则爱情故事，美在过程，而不在结局。有一种月黄色的大昙花，叫“一夜皇后”的，每颤开一分，便震出轰然一声，像绣花绷子拉紧后绣针刺入的声音，所有细致的蕊丝，顿时也就跟着一震，那景象常令人不敢久视——看久了不由得要相信花精花魄的说法。
我常在花开满前离去，花拆一停止，死亡就开始。
有一天，当我年老，无法看花拆，则我愿以一堆小小的春桑枕为收报机，听百草千花所打的电讯，知道每一夜花拆的音乐。
白鹭是一首精巧的诗。色素的配合，身段的大小，一切都很适宜。白鹤太大而嫌生硬，即如粉红的朱鹭或灰色的苍鹭，也觉得大了一些，而且太不寻常了。然而白鹭却因为它的常见，而被人忘却了它的美。
那雪白的蓑毛，那全身的流线型结构，那铁色的长喙，那青色的脚，增之一分则嫌长，减之一分则嫌短，素之一忽则嫌白，黛之一忽则嫌黑。
在清水田里有一只两只站着钓鱼，整个的田便成了一幅嵌在琉璃框里的画面，田的大小好像是有心人为白鹭设计出的镜匣。
晴天的清晨每每看见它孤独地站立在小树的绝顶，看来像不是安稳，而它却很悠然。这上别的鸟很难表现的一种嗜好。人们说它是在望哨，可它真是在望哨吗?
黄昏的空中偶见白鹭的低飞，更是乡居生活中的一种恩蕙。那是清澄的形象化，而且具有了生命了。
或许有人会感着美中的不足，白鹭不会唱歌。但是白鹭的本身不就是一首很优美的歌吗?--不，歌未免太铿锵了。白鹭实在是一首诗，一首韵在骨子里的散文诗。
假如你知道这样做并没有错的话，那么你就继续地做下去，不要理会别人会怎样的讥笑你。相反的，假如你觉得事情有一点不对劲，那么任凭周围的人如何纵容，如何引诱，你却要拒绝他们。因为，在你心里，一直有着一面非常清冽的镜子，时时刻刻地在注视着你，它知道，并且也非常爱惜你的清纯的正直。
好多年没有见面的朋友，再见面时，觉得他们都有一点不同了。
有人有了一双悲伤的眼睛，有人有了冷静的嘴角，有人是一脸的喜悦，有人却一脸风霜；好像几十年没能与我的朋友们共度的沧桑，都隐隐约约地写在他们脸上了。
原来岁月并不是真的逝去，它只是从我们的眼前消失，却转过来躲在我们的心里，然后再慢慢地来改变我们的容貌。
所以，年轻的你，无论将来会碰到什么挫折，请务必要保持一颗宽谅喜悦的心，这样，当几十年后，我们再相遇，我才能很容易地从人群中把你辨认出来。
山茶又开了，那样洁白而美丽的花，开了满树。
每次，我都不能无视地走过一棵开花的树。
那样洁白温润的花朵，从青绿的小芽开始，到越来越饱满，到慢慢地绽放，从半圆，到将圆，到满圆。花开的时候，你如果肯仔细地去端详，你就能明白它所说的每一句话。
就因为每一朵花只能开一次，所以，它就极为小心地决不错一步，满树的花，就没有一朵开错了的。它们是那样慎重和认真的迎接着唯一的春天。
所以，我每次走过一棵开花的树，都不得不惊讶与屏息于生命的美丽。
雨，像银灰色黏湿的蛛丝，织成一片轻柔的网，网住了整个秋的世界。天地是暗沉沉的，像古老的住宅里缠满着蛛丝网的屋顶。那堆在天上的灰白色的云片，就像屋顶上剥落的白粉。在这古旧的屋顶的笼罩下，一切都是异常的沉闷。园子里绿翳翳的石榴、桑树、葡萄藤，都不过代表着过去盛夏的繁荣，现在已成了古罗马建筑的遗迹一样，在萧萧的雨声中瑟缩不宁，回忆着光荣的过去。草色已经转入了忧郁的苍黄，地下找不出一点新鲜的花朵；宿舍墙外一带种的娇嫩的洋水仙，垂了头，含着满眼的泪珠，在那里叹息它们的薄命，才过了两天的晴美的好日子又遇到这样霉气薰蒸的雨天。只有墙角的桂花，枝头已经缀着几个黄金一样宝贵的嫩蕊，小心地隐藏在绿油油椭圆形的叶瓣下，透露出一点新生命萌芽的希望。
雨静悄悄地下着，只有一点细细的淅沥沥的声音。桔红色的房屋，像披着鲜艳袈裟的老僧，垂头合目，受着雨底洗礼。那潮湿的红砖，发出有刺激性的猪血的颜色和墙下绿油油的桂叶成为强烈的对照。灰色的癞蛤蟆，在湿料发霉的泥地里跳跃着；在秋雨的沉闷的网底，只有它是唯一的充满愉快的生气的东西。它背上灰黄斑的花纹，跟沉闷的天空遥遥相应，造成和谐的色调。
雨，像银灰色黏濡的蛛丝，织成一片轻柔的网，网住了整个秋的世界。
我爱月夜，但我也爱星天。从前在家乡七、八月的夜晚在庭院里纳凉的时候，我最爱看天上密密麻麻的繁星。望着星天，我就会忘记一切，仿佛回到了母亲的怀里似的。
三年前在南京我住的地方有一道后门，每晚我打开后门，便看见一个静寂的夜。下面是一片菜园，上面是星群密布的蓝天。星光在我们的肉眼里虽然微小，然而它使我们觉得光明无处不在。那时候我正在读一些关于天文学的书，也认得一些星星，好像它们就是我的朋友，它们常常在和我谈话一样。
如今在海上，每晚和繁星相对，我把它们认得很熟了。我躺在舱面上，仰望天空。深蓝色的天空里悬着无数半明半昧的星。船在动，星也在动，它们是这样低，真是摇摇欲坠呢！
渐渐地我的眼睛模糊了，我好像看见无数萤火虫在我的周围飞舞。海上的夜是柔和的，是静寂的，是梦幻的。我望着那许多认识的星，我仿佛看见它们在对我霎眼，我仿佛听见它们在小声说话。这时我忘记了一切。在星的怀抱中我微笑着，我沉睡着。我觉得自己是一个小孩子，现在睡在母亲的怀里了。
青春有时候极为短暂，有时候却极为冗长。我很知道因为，我也曾如你一般年轻过。在教室的窗前，我也曾和你一样，凝视着四季都没有什么变化的校园，心里猜测着自己将来的多变化的命运，我也曾和你一样，以为，无论任何一种，都会比枯坐在教室里的命运要美丽多了。那时侯的我，很奇怪老师为什么从来不来干涉，就任我一堂课，一堂课的做着梦。今天，我才知道，原来，他也和今天的我一样，微笑着，从我们年轻饱满的脸上，在一次次地重读着我们曾经经历过的青春呢。
为着追求光和热，将身子扑向灯火，终于死在灯下，或者浸在油中，飞蛾是值得赞美的。在最后的一瞬间它得到光，也得到热了。我怀念上古的夸父，他追赶日影，渴死在山谷。为着追求光和热，人宁愿舍弃自己的生命。生命是可爱的。但寒冷的、寂寞的生，却不如轰轰烈烈的死。没有了光和热，这人间不是会成为黑暗的寒冷世界么？倘使有一双翅膀，我甘愿做人间的飞蛾。我要飞向火热的日球。让我在眼前一阵光、身内一阵热的当儿，失去知觉，而化作一阵烟，一撮灰。
每次对着长空的一轮皓月，我会想：在这时候某某人也在凭栏望月吗？
圆月犹如一面明镜，高悬在蓝空。我们的面影都该留在镜里吧，这镜里一定有某某人的影子。
寒夜对镜，只觉冷光扑面。面对凉月，我也有这感觉。
在海上，山间，园内，街中，有时在静夜里一个人立在都市的高高露台上，我望着明月，总感到寒光冷气侵入我的身子。冬季的深夜，立在小小庭院中望见落了霜的地上的月色，觉得自己衣服上也积了很厚的霜似的。
的确，月光冷得很。我知道死了的星球是不会发出热力的。月的光是死的光。
但是为什么还有姮娥奔月的传说呢？难道那个服了不死之药的美女便可以使这已死的星球再生么？或者她在那一面明镜中看见了什么人的面影吧。
EOT;

    protected static function explode($text)
    {
        $chars = array();

        foreach (preg_split('//u', str_replace(array(PHP_EOL, ' '), '', $text)) as $char) {
            if (!empty($char)) {
                $chars[] = $char;
            }
        }

        return $chars;
    }

    protected static function strlen($text)
    {
        return function_exists('mb_strlen') ? mb_strlen($text, 'UTF-8') : count(static::explode($text));
    }

    protected static function validStart($word)
    {
        return !in_array($word, static::$notBeginChar);
    }

    protected static function notValidEnd($word)
    {
        return in_array($word, static::$notEndChar);
    }

    protected static function appendEnd($text)
    {
        $mb_strlen_exists = function_exists('mb_strlen');

        if ($mb_strlen_exists) {
            $last = mb_substr($text, mb_strlen($text, 'UTF-8') - 1, 1, 'UTF-8');
            if (static::notValidEnd($last)) {
                $text = mb_substr($text, 0, mb_strlen($text, 'UTF-8') - 1, 'UTF-8');
            }
        } else {
            $chars = static::explode($text);
            $last = end($chars);
            if (static::notValidEnd($last)) {
                array_pop($chars);
                $text = implode('', $chars);
            }
        }

        return in_array($last, static::$endChar) ? $text : $text . '。';
    }
}