<?php

namespace Faker\Provider\en_US;

class Text extends \Faker\Provider\Text
{
    /**
     * Project Gutenberg's Alice's Adventures in Wonderland, by Lewis Carroll
     *
     * This eBook is for the use of anyone anywhere at no cost and with
     * almost no restrictions whatsoever.  You may copy it, give it away or
     * re-use it under the terms of the Project Gutenberg License included
     * with this eBook or online at www.gutenberg.org
     *
     *
     * Title: 爱丽丝漫游奇境记
     *
     * Author: 刘易斯.卡罗尔 Lewis Carroll
     *
     * Posting Date: June 25, 2008 [EBook #11]
     * Release Date: March, 1994
     * [Last updated: December 20, 2011]
     *
     * Language: Simplified Chinese
     *
     *
     * *** START OF THIS PROJECT GUTENBERG EBOOK ALICE'S ADVENTURES IN WONDERLAND ***
     *
     * 爱丽丝漫游奇境记
     *
     * Lewis Carroll
     *
     * THE MILLENNIUM FULCRUM EDITION 3.0
     *
     * @see http://www.gutenberg.org/cache/epub/11/pg11.txt
     * @var string
     */
    protected static $baseText = <<<'EOT'
第一章 掉进兔子洞
爱丽丝靠着姐姐坐在河岸边很久了，由于没有什么事情可做，她开始感到厌倦，她一次又—次地瞧瞧姐姐正在读的那本书，可是书里没有图画，也没有对话，爱丽丝想：“要是一本书里没有图画和对话，那还有什么意思呢？” 

天热得她非常困，甚至迷糊了，但是爱丽丝还是认真地盘算着，做一只雏菊花环的乐趣，能不能抵得上摘雏菊的麻烦呢？就在这时，突然一只粉红眼睛的白兔，贴着她身边跑过去了。 

爱丽丝并没有感到奇怪，甚至于听到兔子自言自语地说：“哦，亲爱的，哦，亲爱的，我太迟了。”爱丽丝也没有感到离奇，虽然过后，她认为这事应该奇怪，可当时她的确感到很自然，但是兔于竟然从背心口袋里袭里掏出一块怀表看看，然后又匆匆忙忙跑了。这时，爱丽丝跳了起来，她突然想到：从来没有见过穿着有口袋背心的兔子，更没有见到过兔子还能从口袋里拿出—块表来，她好奇地穿过田野，紧紧地追赶那只兔子，刚好看见兔子跳进了矮树下面的一个大洞。 

爱丽丝也紧跟着跳了进去，根本没考虑怎么再出来。 

这个兔子洞开始像走廊，笔直地向前，后来就突然向下了，爱丽丝还没有来得及站住，就掉进了—个深井里。 

也许是井太深了，也许是她自己感到下沉得太慢，因此，她有足够的时间去东张西望，而且去猜测下一步会发生什么事，首先，她往下看，想知道会掉到什么地方。但是下面太黑了，什么都看不见，于是，她就看四周的井壁，只见井壁上排满了碗橱和书架，以及挂在钉子上的地图和图画，她从一个架子上拿了一个罐头，罐头上写着“桔子酱”，却是空的，她很失望，她不敢把空罐头扔下去，怕砸着下面的人，因此，在继续往下掉的时候，她就把空罐头放到另一个碗橱里去了。 

“好啊，”爱丽丝想，“经过了这次锻炼，我从楼梯上滚下来就不算回事。家里的人都会说我多么勇敢啊，嘿，就是从屋顶上掉下来也没什么了不起，”——这点倒很可能是真的，屋顶上摔下来，会摔得说不出话的。 

掉啊，掉啊，掉啊，难道永远掉不到底了吗？爱丽丝大声说：“我很知道掉了多少英里了，我一定已经靠近地球中心的一个地方啦！让我想想：这就是说已经掉了大约四千英里了，我想……”（你瞧，爱丽丝在学校里已经学到了一点这类东西，虽然现在不是显示知识的时机，因为没一个人在听她说话，但是这仍然是个很好的练习。）“……是的，大概就是这个距离。那么，我现在究竟到了什么经度和纬度了呢？”（爱丽丝不明白经度和纬度是什么意思，可她认为这是挺时髦的字眼，说起来怪好听的。） 

不一会儿，她又说话了：“我想知道我会不会穿过地球，到那些头朝下走路的人们那里，这该多么滑稽呀！我想这叫做‘对称人’（19世纪中学地理教科书上流行个名洞，叫“对跖人”，意思是说地球直径两端的人，脚心对着脚心。爱丽丝对“地球对面的人”的概念模糊，以为他们是“头朝下”走路的，而且把“对跖人”错念成“对称人”了。）吧？”这次她很高兴没人听她说话，因为“对称人”这个名词似乎不十分正确。“我想我应该问他们这个国家叫什么名称：太太，请问您知道这是新西兰，还是澳大利亚？”（她说这话时，还试着行个屈膝礼，可是不成。你想想看，在空中掉下来时行这样的屈膝礼，行吗，）“如果我这样问，人们一定会认为我是一个无知的小姑娘哩。不，永远不能这样问，也许我会看到它写在哪儿的吧！” 

掉啊，掉啊，掉啊，除此之外，没别的事可干了。因此，过一会儿爱丽丝又说话了：“我敢肯定，黛娜今晚一定非常想念我。”（黛娜是只猫）“我希望他们别忘了午茶时给她准备一碟牛奶。黛娜，我亲爱的，我多么希望你也掉到这里来，同我在一起呀，我怕空中没有你吃的小老鼠，不过你可能捉到一只蝙蝠，你要知道，它很像老鼠。可是猫吃不吃蝙蝠呢？”这时，爱丽丝开始瞌睡了，她困得迷迷糊糊时还在说：“猫吃蝙蝠吗？猫吃蝙蝠吗？”有时又说成：“蝙蝠吃猫吗？”这两个问题她哪个也回答不出来，所以，她怎么问都没关系，这时候，她已经睡着了，开始做起梦来了。她梦见正同黛娜手拉着手走着，并且很认真地问：“黛娜，告诉我，你吃过蝙蝠吗？，就在这时，突然“砰”地一声，她掉到了一堆枯枝败叶上了，总算掉到了底了！ 

爱丽丝一点儿也没摔坏，她立即站起来，向上看看，黑洞洞的。朝前一看，是个很长的走廊，她又看见了那只白兔正急急忙忙地朝前跑。这回可别错过时机，爱丽丝像一阵风似地追了过去。她听到兔子在拐弯时说：“哎呀，我的耳朵和胡子呀，现在太迟了！”这时爱丽丝已经离兔子很近了，但是当她也赶到拐角，兔子却不见了。她发现自己是在一个很长很低的大厅里，屋顶上悬挂着一串灯，把大厅照亮了。 

大厅四周都是门，全都锁着，爱丽丝从这边走到那边，推一推，拉一拉，每扇门都打不开，她伤心地走到大厅中间，琢磨着该怎么出去。 

突然，她发现了一张三条腿的小桌，桌子是玻璃做的。桌上除了一把很小的金钥匙，什么也没有，爱丽丝一下就想到这钥匙可能是哪个门上的。可是，哎呀，要么就是锁太大了，要么就是钥匙太小了，哪个门也用不上。不过，在她绕第二圈时，突然发现刚才没注意到的一个低帐幕后面，有一扇约十五英寸高的小门。她用这个小金钥匙往小门的锁眼里一插，太高兴了，正合适。 

爱丽丝打开了门，发现门外是一条小走廊，比老鼠洞还小，她跪下来，顺着走廊望出去，见到一个从没见过的美丽花园。她多想离开这个黑暗的大厅，到那些美丽的花圃和清凉的喷泉中去玩呀！可是那门框连脑袋都过不去，可怜的爱丽丝想：“哎，就算头能过去，肩膀不跟着过去也没用，我多么希望缩成望远镜里的小人呀（爱丽丝常常把望远镜倒着看，一切东西都变得又远又小，所以她认为望远镜可以把人放大或缩小。），我想自己能变小的，只要知道变的方法就行了。”你看，一连串稀奇古怪的事，使得爱丽丝认为没有什么事是不可能的了。看来，守在小门旁没意思了，于是，她回到桌子边，希望还能再找到一把钥匙，至少也得找到一本教人变成望远镜里小人的书，可这次，她发现桌上有一只小瓶。爱丽丝说：“这小瓶刚才确实不在这里。”瓶口上系着一张小纸条，上面印着两个很漂亮的大字：“喝我”。 

说“喝我”倒不错，可是聪明的小爱丽丝不会忙着去喝的。她说：“不行，我得先看看，上面有没有写着‘毒药’两个字。”因为她听过一些很精彩的小故事，关于孩子们怎样被烧伤、被野兽吃掉，以及其它一些令人不愉快的事情，所有这些，都是因为这些孩子们没有记住大人的话，例如：握拨火棍时间太久就会把手烧坏；小刀割手指就会出血，等等。爱丽丝知道喝了写着“毒药”瓶里的药水，迟早会受害的。 

然而瓶子上没有“毒药”字样，所以爱丽丝冒险地尝了尝，感到非常好吃，它混合着樱桃馅饼、奶油蛋糕、菠萝、烤火鸡、牛奶糖、热奶油面包的味道。爱丽丝一口气就把一瓶喝光了。 

“多么奇怪的感觉呀！”爱丽丝说，“我一定变成望远镜里的小人了。” 

的确是这样，她高兴得眉飞色舞，现在她只有十英寸高了，已经可以到那个可爱的花园里去了。不过，她又等了几分钟，看看会不会继续缩小下去。想到这点，她有点不安了。“究竟会怎么收场呢？”爱丽丝对自己说，“或许会像蜡烛的火苗那样，全部缩没了。那么我会怎么样呢？”她又努力试着想象蜡烛灭了后的火焰会是个什么样几。因为她从来没有见过那样的东西。 

过了一小会，好像不会再发生什么事情了，她决定立刻到花园去。可是，哎哟！可怜的爱丽丝！她走到门口，发觉忘拿了那把小金钥匙。在回到桌子前准备再拿的时候，却发现自己已经够不着钥匙，她只能通过玻璃桌面清楚地看到它，她尽力攀着桌腿向上爬，可是桌腿太滑了，她一次又一次地溜了下来，弄得她精疲力竭。于是，这个可怜的小家伙坐在地上哭了起来。 

“起来，哭是没用的！”爱丽丝严厉地对自己说，“限你—，分钟内就停止哭！”她经常爱给自己下个命令（虽然她很少听从这种命令），有时甚至把自己骂哭了。记得有一次她同自己比赛槌球，由于她骗了自己，她就打了自己一记耳光，这个小孩很喜欢装成两个人，“但是现在还装什么两个人呢？”可怜的小爱丽丝想，“唉！现在我小得连做一个像样的人都不够了。” 

不一会儿，她的眼光落在桌子下面的一个小玻璃盒子上。打开一看，里面有块很小的点心，点心上用葡萄干精致地嵌着“吃我”两个字，“好，我就吃它，”爱丽丝说，“如果它使我变大，我就能够着钥匙了；如果它使我变得更小，我就可以从门缝下面爬过去，反正不管怎样，我都可以到那个花园里去了。因此无论怎么变，我都不在乎。” 

她只吃了一小口，就焦急地问自己：“是哪一种，变大还是变小？”她用手摸摸头顶，想知道变成哪种样子。可是非常奇怪，一点没变，说实话，这本来是吃点心的正常现象，可是爱丽丝已经习惯了稀奇古怪的事了，生活中的正常事情倒显得难以理解了。 

于是，她又吃开了，很块就把一块点心吃完了。 

第二章 眼泪的池塘
“奇怪啊奇怪，”爱丽丝喊道，她那么惊奇，霎时，竟说不成话了，“现在我一定变成最大的望远镜里的人了。再见了，我的双脚！”她俯视自己的脚，远得快看不见了。“哦，我的可怜的小脚哟！谁再给你们穿鞋和系鞋带呢，亲爱的，我可不能了，我离你们太远了，没法再照顾你们了，以后你们只好自己照顾自己吧！……但是我必须对它们好一些，”爱丽丝又想道，“否则它们会不愿走到我想去的地方的，对啦，每次圣诞节我一定要送它们一双新的长统靴。” 

她继续盘算该怎么送礼：“我得把礼物打成包裹寄给它们，”她想，“呀，多滑稽，给自己的脚寄礼物鼠这地址写起来可太离奇了： 

壁炉边搁脚拦杆上 

爱丽丝的右脚收 

爱丽丝寄 

“哦，亲爱的，我说的什么废话呀！”就在这一刹那，她的头撞到了大厅的屋顶上。她现在至少有九英尺高了，她急忙拿起小金钥匙向小花园的门跑去。 

可怜的爱丽丝！现在最多只能侧身躺在地下，用一只眼睛往花园里望，更没有可能进去了，于是她又哭了。 

“你不害澡吗？”爱丽丝对自己说，“像你这么大的姑娘（说得很对），还要哭。马上停止，我命令你！”但她还不停地哭，足足掉了一桶眼泪。她还继续哭，直到身边成了个大池塘，有四英尺深，半个大厅都变成池塘了。 

过了一会儿，她听到远处轻微的脚步声，她急忙擦干眼泪，看看谁来了。原来那只小白兔又回来了，打扮得漂漂亮亮的，一只手里本着一双白羊羔皮手套，另一只手里拿着一把大扇子，正急急忙忙地小跑着过来。小白兔一边走．一边喃喃自语地说：“哦，公爵夫人，公爵夫人！唉！假如我害她久等了，她可别生气呵！”爱丽丝很希望来个人帮助自己，因此见到小白兔很失望。但是在小白兔走近时，她还是怯生生地小声说：“劳驾，先生……”这可把兔子吓了一跳，扔掉了白羔皮手套和扇子，拼命地跑进暗处去了。 

爱丽丝拾起了扇子和手套。这时屋里很热，她就一边搧着扇子，一边自言自语地说：“亲爱的，亲爱的，今天可净是怪事，昨天还是那么正常，是不是夜里发生的变化？让我想想：我早晨起来时是不是还是我自己，我想起来了，早晨就觉得有点不对头。但是，要是我不是自己的话，那么我能是谁呢，唉！这可真是个谜啊！”于是她就挨个儿地去想和她相同年龄的女孩子，她是变成了她们中的哪一个了？ 

“我敢说，我不是爱达，”爱丽丝说，“因为她是长长的卷发，而我的根本不卷。我肯定不是玛贝尔，因为我知道各种各祥的事情，而她，哼！她什么也不知道。而且，她是她，我是我，哎哟！亲爱的，把我迷惑住了，真叫人伤脑筋。我试试看，还记得不自己得过去知道的事情。让我想一想四乘五是十二，四乘六是十三，四乘七……唉，这样背下去永远到不了二十；况且乘法表也没大意思。让我试试地理知识看：伦敦是巴黎的首都，而巴黎是罗马的首都，罗马是……不，不，全错了。我一定，一定已经变成了玛贝尔了。让我再试试背《小鳄鱼怎样……》。”于是她把手交叉地放在膝盖上，就像背课文那样，一本正经地背起来了。她的声音嘶哑、古怪，吐字也和平时不一样： 

小鳄鱼怎样保养 

它闪亮的尾巴， 

把尼罗河水灌进 

每一片金色的鳞甲。 

它笑得多么快乐， 

伸开爪子的姿势多么文雅， 

它在欢迎那些小鱼 

游进它温柔微笑着的嘴巴。 

“我相信背错了。”可怜的爱丽丝一边说着，一边又掉下了眼泪：“我一定真的成了玛贝尔了，我得住在破房子里，什么玩具也没有，还得学那么多的功课。不行！我拿定主意了，如果我是玛贝尔，我就呆在这井下，他们把头伸到井口说：‘上来吧！亲爱的！”我只往上问他们：‘你们先得告诉我，我是谁，如果变成我喜欢的人，我就上来，如果不是，我就一直呆在这里，除非我再变成什么人’……可是，亲爱的！”爱丽丝突然哭起来：“我真想让他们来叫我上去呀！实在不愿意孤零零地呆在这儿了。” 

她说话时，无意中看了一下自己的手，见到一只手上戴了小白兔的白羊羔皮手套，她奇怪极了，“这怎么搞的？”她想，“我一定又变小了，”她起来步到桌子边，量一量自己，正像她猜测的那样，她现在大约只有二英寸高了，而且还在迅速地缩下去，她很快发现是拿着的那把扇子在作怪，于是她赶紧扔掉扇子，总算快，要不就缩得没有了。 

“好险呀！”爱丽丝说。她真的吓坏了，但总算自己还存在，因此很高兴，“现在，该去花园了！”她飞快地跪到小门那儿，但是，哎哟，小门又锁上了，小金钥匙像从前一样仍在玻璃桌子上。“现在更糟糕了，”可怜的小爱丽丝想，“因为我还没有这样小过，从来没有重我该说这太糟了！太糟了！” 

她说话时，突然滑倒了，“扑通”一声，咸咸的水已经淹到她的下巴了。她第一个念头是掉进海里了。她对自己说：“那么我可以坐火车回去了，”——爱丽丝到海边去过，看到海滨有许多更衣车，孩子们在沙滩上用木铲挖洞玩。还有一排出租的住房，住房后面是个火车站——然而不久，她就明白了，自己是在一个眼泪的池塘里，这是她九英尺高的时候流出来的眼泪。 

“但愿我刚才没哭得这么厉害！”爱丽丝说话时来回游着，想找条路游出去，现在我受报应了，我的眼沼快要把自己淹死啦！这又是桩怪事，说真的，今天尽是怪事！” 

就在这时，她听到不远的地方有划水声，就向前游去，想看看是什么，起初，她以为这一定是只海象或者河马。然而，她一想起自己是多么小的时候，就立即明白了，这不过是只老鼠，是像自己一样滑进水里来的。 

“它来有什么用处呢？”爱丽丝想，“同一只老鼠讲话吗？这井底下的事情都是那么奇怪，也许它会说话的，不管怎样，试试也没害处，”于是，爱丽丝就说，“喂，老鼠！你知道从池塘里出去的路吗？我已经游得很累了。喂，老鼠！”爱丽丝认为这是同老鼠谈话的方式，以前，她没有做过这种事，可她记得哥哥的《拉丁文语法》中有：“一只老鼠……一只老鼠……喂，老鼠！”现在这老鼠狐疑地看着她，好像还把一只小眼睛向她眨了眨，但没说话。 

“也许它不懂英语，”爱丽丝想，“她是同征服者威廉（威廉（1027或1028-1087）原为诺曼第（现法国的诺曼第半岛）公爵，后来征服并统一了英国）一起来的，”（尽管爱丽丝有些历史知识，可搞不清这些事情已经多久了。）于是，她又用法语说：“我的猫在哪里，”这是她的法文课本的第一句话。老鼠一听这话，突然跳出水面，吓得浑身发抖，爱丽丝怕伤害了这个可怜的小动物的感情，赶快说：“请原谅我！我忘了你不喜欢猫。” 

“不喜欢猫！”老鼠激动而尖声地喊着，“假如你是我的话，你喜欢猫吗？” 

“也许不，”爱丽丝抚慰着说，“别生我的气了。可是我还是希望你能够看到我的猫——，黛娜，只要你看到她，就会喜欢猫了，她是一个多么可爱而又安静的小东西呀。”爱丽丝一面懒散地游着，一面自言自语地继续说，“她坐在火炉边打起呼噜来真好玩，还不时舔舔爪子，洗洗脸，摸起来绵软得可爱。还有，她抓起老鼠来真是个好样的……，哦，请原谅我。”这次真把老鼠气坏了。爱丽丝又喊道：“如果你不高兴的话，咱们就不说她了。” 

“还说‘咱们’呢！”老鼠喊着，连尾巴梢都发抖了，“好像我愿意说似的！我们家族都仇恨猫，这种可恶的、下贱的、粗鄙的东西！再别让我听到这个名字了！” 

“我不说了，真的！”爱丽丝说着，急忙改变了话题，“你……喜欢……喜欢……狗吗？”老鼠没回答，于是，爱丽丝热心地说了下去，“告诉你，我家不远有一只小狗，—只眼晴明亮的小猎狗，你知道，它长着那么长的棕色卷毛。它还会接住你扔的东西，又会坐起来讨吃的，还会玩各式各样的把戏，它是一个农民的，你可知道，那个农民说它真顶用，要值一百英镑哪！说它还能杀掉所有的老鼠……哦，亲爱的！”爱丽丝伤心地说，“我怕又惹你生气了。”老鼠已经拼命游远了，它游开时，还弄得池塘的水一阵波动。 

爱丽丝跟在老鼠的后面柔声细气地招呼它：“老鼠啊，亲爱的，你还是回来吧，你不喜欢的话，咱们再也不谈猫和狗了！”老鼠听了这话，就转过身慢慢地向她游来，它脸色苍白（爱丽丝想一定是气成这样的），用低而颤抖的声音说：“让我们上岸去吧，然后我将把我的历史告诉你，这样你就会明白我为什么也恨猫和狗了。” 

真是该走了，因为池塘里已经有了一大群鸟兽，有一只鸭子、—只渡渡鸟（一种现已绝种的鸟，原产非洲毛里求斯。）、一只鹦鹉，一只小鹰和一些稀奇古怪的动物。爱丽丝领着路，和这群鸟兽一起自岸边游去。 

第三章 一场会议式赛跑和一个长故事

集合在岸上的这一大群，确实稀奇古怪——羽毛湿了的鸟、毛紧贴着身子的小动物等等，全都是湿淋淋的，横躺竖卧的，显得很狼狈。 

重要的是：怎样把身上弄干，对这个问题，他们商量了一会儿。过了几分钟，爱丽丝就同它们混熟了，好像老相识似的。你瞧，爱丽丝已经同鹦鹉辩论了好长时间了，最后鹦鹉生气了，一个劲儿地说：“我比你年龄大，也就肯定比你知道得多。”可爱丽丝不同意这点，因为爱丽丝压根儿不知道它的年龄，而鹦鹉又拒绝说出自已的年龄，她们就再没话可说了。 

最后，那只老鼠——它在它们中间好像很有权威似的——喊道：“你们全部坐下，听我说，我很快就会把你们弄干的！”他们立即都坐下了，围成一个大圈，老鼠在中间，爱丽丝焦急地盯着它，她很清楚，如果湿衣服不能很快干的活，她会得重感冒的， 

“咳，咳！”老鼠煞有介事地说：“你们都准备好了吗？下面是我要说的最干巴巴的故事了，请大家安静点。‘征服者威廉的事业是教皇支持的，不久就征服了英国，英国人也需要有人领导，而且已经对篡权和被征服都习惯了。梅西亚和诺森勃列亚（海西亚Mercia和诺森勃利亚Northumbria是英国的两个古国。）的伯爵埃德温和莫卡…… 

“啊！”鹦鹉打着哆嗦。 

“请原谅！”老鼠皱着眉头说，但仍然很有礼貌地问：“你有什么话吗？” 

“我没有啥说的！”鹦鹉急忙答道。 

“我以为你有话要说哩！”老鼠说，“我继续讲，这两个地方的伯爵埃德温和莫卡都宣告支持威廉，甚至坎特伯雷的爱国大主教斯蒂坎德也发现这是可行的……” 

“发现什么？”鸭子问， 

“发观‘这’，”老鼠有点不耐烦地回答，“你当然不知道‘这，的意思。” 

“我发现了什么吃的东西时，当然知道‘这’是指什么。‘这’通常指一只青蛙或一条蚯蚓，现在的问题是：大主教发现的是什么呢？”鸭子还不停地呱啦着。 

老鼠一点也不理睬，只是急急忙忙地继续讲：“……发现与埃德加．阿瑟林一起去亲自迎接威廉，并授予他皇冠是可行的，威廉的行动起初还有点节制，可他那诺曼人的傲慢……，你感觉怎么样了？我亲爱的。”它突然转向爱丽丝问道。 

“跟原来一样的湿。”爱丽丝忧郁地说，“你讲这些一点也不能把我身上弄干。” 

“在这种情况下，我建议休会，并立即采取更加有效的措施。”渡渡鸟站后来严肃地说。 

“讲英语！”小鹰说，“你这句话的意思，我连一半都听不懂！更主要的是我不相信你自己会懂，”小鹰说完后低下头偷偷笑了，其它一些鸟也都偷偷地笑出声来。 

“我说的是，能让我们把湿衣服弄干的最好办法，是来个会议式的赛跑。”渡渡鸟恼怒地说。 

“什么是会议式赛跑？”爱丽丝问，爱丽丝本来不想多问，因为渡渡鸟说到这里停住了，似乎想等别人问似的，而偏偏又没人问它。 

渡渡鸟说：“对，为了说明它，最好的办法就是咱们亲自做一做。”（由于你在冬天也许会想起来玩这种游戏，所以我占这里告诉你渡渡鸟是怎么做的。） 

前先，它划出个比赛路线，有点像个圆圈，它说：“具体形状没关系的。”然后，这一大群家伙就在圈子内散乱地站着，也不用说“—，二，三，开始！”而是谁想开始就开始，谁想停下，就停下，所以，要知道这场比赛的结束是不容易的。它们跑了大约半个小时，衣服大体上都干了，渡渡鸟就突然喊道：“比赛结束了！”听这话，它们都喘着气围拢过来，不停地问：“谁赢了，” 

这个问题，渡渡鸟得好好考虑一下才能回答。因此，它坐下来，用一个指头撑着前额想了好长时间（就像照片上莎士比亚的那种姿态），这段时间里大家都安静地等待着。最后，渡渡鸟说：“每人都赢了，而且都有奖品！” “谁给奖品呢？”大家齐声问， “她重当然是她啦！”渡渡鸟用一个手指头指着爱丽丝说。于是，这一大群立即围住了爱丽丝，胡乱喊叫着：“奖品！奖品！” 

爱丽丝真不知该怎么办了，她无可奈何地把手伸进了衣袋，嘿！拿出了一盒糖果，真幸运，还没给咸水浸透，她就把糖果作为奖品，发给了大家。正好每位分到一块，只是她自己没有。 “可是她自己也应该有一份奖品啊！”老鼠说， “当然啦，”渡渡鸟非常严肃地回答，“你的口袋里还有别的东西吗，”它转向爱丽丝问道。 “只有一个顶针了。”爱丽丝伤心地说。 “把它拿来。”渡渡鸟说， 这时，大家又围住了爱丽丝，渡渡鸟接过顶针后兑严肃地递给了她，说：“我们请求你接受这只精致的顶针，”它刚结束这句简短的讲演，大家全都欢呼起来了。 

爱丽丝认为这些事情全都非常荒唐，可是它们却十分认真，她也不敢笑，一时又想不出许说什么话，只见好鞠了个躬，尽量装得一本正经地接过了顶针。 

下步是吃糖果了，这又引起一阵喧闹，大鸟们埋怨还没尝到味儿，糖就没了，小鸟们则被糖块噎着了，还得别人替它拍拍背。不管怎么说，最后，糖果总算吃完了，这时它们又围成一个大圈坐下来，请求老鼠再讲点故事。 “你记得吗，你答应过讲你的历史，”爱丽丝说，“作为什么恨……恨‘M’和‘G’呀，”她压低声音，说完了这句话，她怕说出猫和狗这两个字惹老鼠生气，于是只说出猫和狗两字的拼音字头。 “我的处事是个结尾悲伤的长故事，”老鼠对爱丽丝叹息着说。 

爱丽丝没有听清这句话，她看着老鼠的尾巴纳闷了：“它确实是根长尾巴，可为什么说尾巴是悲伤的呢？”老鼠讲故事的整个过程中，爱丽丝还一直为这个问题纳闷，因此，在她脑子里就把整个故事想象成这个样子了： 

“猎狗对屋子里的一只老鼠说道：‘跟我到法庭去，我要把你控告，我不睬你的辩解，要把你审判。因为今晨我没事干，所以我要跟你捣捣蛋。’老孔对恶狗说：‘这样的审判，既没有陪审员，又没有法官，不过是白白浪费时间，恩狗说：‘我就是陪审员，我就是法官，我要亲自执法审判，我要判处你的死刑！’”“你没有注意听，”老鼠严厉地对爱丽丝说，“你在想什么呢？”“请原谅！”爱丽丝似乎理亏似地说，“我想你已经拐到第五个弯了吧！”“我没有弯！”老鼠非常生气地厉声说。 

“你要个碗（弯）！”爱丽丝说，由于她总是热心帮助别人的，因此就焦急她四周寻找，“哦，让我帮你找找看。” “我不吃你这一套，你的这些废话侮辱了我！”老鼠说着站起来就走。 

“我没有侮辱你的意思！可是你也太容易生气了！”可怜的爱丽丝辩解着说。 

老鼠咕噜了—声没理她。 

“请你回来讲完你的故事！”爱丽丝喊着，其他动物也都齐声说：“是啊！请回来吧！”但是，老鼠只是不耐烦地摇着脑袋，步子走得更快了。 

“它走了，多遗憾哪！”当老鼠刚走得看不见了时，鹦鹉就叹息着，老螃蟹趁这个机会对女儿说：“哦，我亲爱的，这是一个教训，告诉你以后永远也不要发脾气。” 

“别说了，妈！你这样罗嗦，就是牡蛎都忍耐不了。”小螃蟹耐着小脾气说。 

“我多么希望我的黛娜在这儿呀！”爱丽丝自言自语地大声说，“她一定会马上把它抓回来的！” “请允许我冒昧地问一下，那么，黛娜是谁呢？”鹦鹉说。 

爱丽丝随时都乐意谈论她心爱的小宝贝，所以她热心地回答：“黛娜是我的猫，她抓老鼠可是好样的，简直想象不出来。嘿，我还希望你看到她怎么抓鸟的哩，她只要看见一只鸟，一眨眼就合把它吃到肚子里去的！” 

这话惹得大家十分惊慌，有些鸟急急忙忙离开了，老喜鹊小心地把自己裹严，解释道：“我必须回家了，今晚的空气对我的喉咙不合适。”金丝鸟发抖地对它的孩子说：“走吧！我亲爱的，你们早该睡觉了。”它们全都在各种借口下走掉了。不久，又只剩下爱丽丝孤单单的一个人了。 

“我要是刚才不提到黛娜就好了！”爱丽丝忧郁地对自己说，“这里好像没有一个喜欢她的，唉！只有我知道她是世界上最好的猫！啊，我亲爱的黛娜，真不知道什么时候还会再见到你呢！说到这里，可怜的小爱丽丝的眼泪又出来了，她感到非常孤独和懊丧，过了一会儿，总算听到不远处传来了脚步声，她巴望地抬头看看是谁来了，希望老鼠改变主意，回来讲完它的故事。 

第四章 兔子派遣小比尔进屋

原来是那只小白兔，又慢慢地走回来了，它在刚才走过的路上焦急地到处审视，好像在寻找什么东西，爱丽丝还听到它低产咕噜：“公爵夫人呵！公爵夫人，唉！我亲爱的小爪子呀！我的小胡子呀！她一定会把我的头砍掉的，一定的！就像雪貂是雪貂那样千真万确！我是在哪儿丢掉的呢？”爱丽丝马上猜到它在找那把扇子和那双羊皮手套，于是，她也好心地到处寻找，可是找不见，自从她在池塘里游荡以来，好像所有东西都变了，就是那个有着玻璃桌子和小门的大厅也都不见了。 

不一会，当爱丽丝还在到处找的时候，兔子看见了她，并且生气地向她喊道：“玛丽．安，你在外面干什么？马上回家给我拿一双手套和一把扇子来。赶快去！”爱丽丝吓得要命，顾不得去解释它的误会，赶快按它指的方向跑去了。 

“它把我当成它的女仆了，”她边跑边对自己说，“它以后发现我是谁，会多么惊奇啊！可是我最好还是帮它把手套和扇子拿去——要是我能找到的话。”她说着到了一幢整洁的小房子前，门上挂着一块明亮的黄铜小牌子，刻着“白兔先生”。她没有敲门就进去了，急忙往楼上跑，生怕碰上真的玛丽．安，如果那样的话，她在找到手套和扇子之前就会从这个小屋里被赶出来的， 

“这真奇怪！”爱丽丝对自己说，“给一只兔子跑腿，我看下一步就该轮到黛娜使唤我了。”于是她就想象那种情景：“‘爱丽丝小姐，快来我这儿，准备去散步，’‘我马上就来，保姆！可是在黛娜回来之前，我还得看着老鼠洞，不许老鼠出来，’不过，假如黛娜像这样使唤人的话，他们不会让它继续呆在家里了。” 

这时，她已经走进了一间整洁的小房间，靠窗子有张桌子，桌子上正像她希望的那样，有一把扇子和两、三双很小的白羊羔皮手套，她拿起扇子和一双手套。正当她要离开房间的时候，眼光落在镜子旁边的一个小瓶上。这一次，瓶上没有“喝我”的标记。但她却拔开瓶塞就往嘴里倒。她想，“我每次吃或喝一点东西，总会发生一些有趣的事。所以我要看看这一瓶能把我怎么样。我真希望它会让我长大。说真的，做我现在这样一点儿的小东西，真厌烦极了。” 

小瓶真的照办了，而且比她期望的还快，她还没有喝到一半，头已经碰到了天花板，因此，必须立即停止，不能再喝了！否则脖子要给折断了。爱丽丝赶紧扔掉瓶子，对自己说：“现在已经够了，不要再长了，可是就是现在这样，我也已经出不去了。嗨！我别喝这么多就好啦！” 

唉！现在已经太迟了！她继续长啊，长啊！再待一会儿就得跪在地板上了，一分钟后，她必须躺下了，一只胳膊撑在地上，一只胳膊抱着头、可是还在长，这时只得把一只手臂伸出窗子，一只脚伸进烟囱，然后自语说：“还长的话怎么办呢？我会变成什么样子呢？” 

幸运的是这只小魔术瓶的作用已经发挥完了，她不再长了，可是心里很不舒服，看来没有可能从这个房子里出去了。 

“在家里多舒服，”可怜的爱丽丝想，“在家里不会一会儿变大，一会儿变小，而且不会被老鼠和兔子使唤。我希望不曾钻进这个兔子洞，可是……可是这种生活是那么离奇，我还会变成什么呢？读童话时我总认为那种事情永远不会发生的，可现在自己却来到这童话世界了，应该写一本关于我的书，应该这样，当我长大了要写—本——可我现在已经长大了啊。”她又伤心地加了一句：“至少这儿已经没有让我再长的余地了。” 

“可是，”爱丽丝想，“我不会比现在年龄更大了！这倒是一个安慰，我永远不会成为老太婆了。但是这样就得老是上学了。唉，这我可不情愿！” 

“啊，你这个傻爱丽丝！”她又回答自己，“你在这儿怎么上学呢？哎唷，这间房子差点儿装不下你，哪里还有放书的地方呢？” 

她就这样继续说着，先装这个人，然后又装另一个人，就这样说了一大堆话。几分钟后，她听到门外有声音，才停止唠叨去听那个声音。 

“玛丽·安，玛丽·安！”那个声音喊道，“赶快给我拿手套，”然后一连串小脚步声步上楼梯了。爱丽丝知道这是兔子来找她了，但是她忘了自己现在已经比兔子大了一千倍，因此还是吓得发抖，哆嗦得屋子都摇动了， 

免子到了门外，想推开门，但是门是朝里开的，爱丽丝的胳膊肘正好顶着门，兔子推也推不动，爱丽丝听到它自语说，“我绕过去，从窗子爬进去。” 

“这你休想，”爱丽丝想，她等了一会，直到听见兔子走到窗下，她突然伸出了手，在空中抓了一把，虽然没有抓住任何东西，但是听到了摔倒了的尖叫声，和打碎玻璃的哗啦啦的响声，根据这些声音，她断定兔子掉进玻璃温室之类的东西里面了。 

接着是兔子的气恼声：“帕特！帕特！你在哪里？”然后，是一个陌生的声音，“是，我在这儿挖苹果树呢？老爷！” 

“哼！还挖苹果树呢！”兔子气愤地说，“到这儿来，把我拉出来！”接着又是一阵弄碎玻璃的声音。 

“给我说，帕特，窗子里是什么？” 

“哟，一只胳膊，老爷！” 

“—只胳膊！你这个傻瓜，哪有这样大的胳膊，嗯，它塞满了整个窗户呢！” 

“不错，老爷，可到底是一只胳膊。” 

“嗯。别罗嗦了，去把它拿掉！” 

沉寂了好一阵，这时爱丽丝只能偶尔听到几句微弱的话音，如：“我怕见它，老爷，我真怕它！”……“照我说的办，你这个胆小鬼！”最后，她又张开手，在空中抓了一把，这一次听到了两声尖叫和更多的打碎玻璃的声音，“这里一定有很多玻璃温室！”爱丽丝想，“不知道他们下一步要干什么？是不是要把我从窗子里拉出去，嘿，我真希望他们这样做，我实在不愿意再呆下去了！” 

她等了—会，没有听到什么声音，后来传来了小车轮的滚动声，以及许多人说话的嘈杂声，她听到说：“另外一个梯子呢？……嗯，我只拿了一个，别一个比尔拿着……比尔，拿过来，小伙子……到这儿来，放到这个角上……不，先绑在一起，现在还没一半高呢！……对，够了，你别挑刺啦！—一比尔，这里，抓住这根绳子……顶棚受得了吗？……小心那块瓦片松了……掉下来了，低头！（一个很大的响声）……现在谁来干？……我认为比尔合适，它可以从烟囱里下去。……不，我不干！……你干！……这我可不干……应该比尔下去……比尔！主人说让你下烟囱！” 

“啊，这么说比尔就要从烟囱下来了，”爱丽丝对自己说，“嘿，它们好像把什么事情都推在比尔身上，我可不做比尔这个角色。说真的这个壁炉很窄，不过我还是可以踢那么一下。” 

她把伸进烟囱里的脚收了收，等到听到一个小动物（她猜不出是什么动物）在烟囱里连滚带爬地接近了她的脚，这时她自语说：“这就是比尔了，”同时狠狠地踢了一脚，然后等着看下一步会发生些什么。 

首先，她听到一片叫喊：“比尔飞出来啦！”然后是兔子的声音：“喂，篱笆边的人，快抓住它！”静了一会儿，又是一片乱嚷嚷：“抬起它的头……，快，白兰地……别呛着了它！怎么样了？老伙计，刚才你碰见了什么？告诉我们。” 

最后传来的是一个微弱的尖细声（爱丽丝认为这是比尔）“唉，我一点也不知道……再不要，谢谢你，我已经好多了……我太紧张了，没法说清楚，我所知道的就是……不知什么东西，就像盒子里的玩偶人（西方小孩经常玩一种玩偶盒，一打开盒盖即弹出小玩偶来。）一样弹过来，于是，我就像火箭一样飞了出来！” “不错，老伙计！你真是像火箭一样。”另外一个声音说。 

“我们必须把房子烧掉！”这是兔子的声音。爱丽丝尽力喊道：“你们敢这样，我就放黛娜来咬你们！” 

接着，是死一般的寂静，爱丽丝想：“不知道它们下一步想干什么，如果它们有见识的话，就应该把屋顶拆掉。”过了一两分钟，它们又走动了，爱丽丝听到兔子说：“开头用一车就够了。” 

“一车什么呀？”爱丽丝想，但一会儿就知道了，小卵石像暴雨似的从窗子扔进来了，有些小卵石打到了她的脸上，“我要让他们住手，”她对自己说，然后大声喊道：“你们最好别再这样干了！”这一声喊叫后，又是一片寂静。 

爱丽丝惊奇地注意到，那些小卵石掉到地板上部变成了小点心，她脑子里立即闪过了一个聪明的念头：“如果我吃上一块，也许会使我变小，现在我已经不可能更大了，那么，它一定会把我变小的。” 

开是，她吞了一块点心，当即明显地迅速缩小了。在她刚刚缩到能够穿过门的时候，就跑出了屋子，她见到一群小动物和小鸟都守在外边，那只可怜的小壁虎——比尔在中间，由两只豚鼠扶着，从瓶子里倒着东西喂它。当爱丽丝出现的瞬间，它们全都冲上来。她拼了命，总算跑掉了，不久她就平安地到了一个茂密的树林里。 

“我的第一件事，”爱丽丝在树林中漫步时对自己说，“是把我变到正常大小，第二件就是去寻找那条通向可爱的小花园的路。这是我最好的计划了。” 

听起来，这真是个卓越的计划，而且安排得美妙而简单，唯一的困难是她不知道怎样才能办成。正当她在树林中着急地到处张望时，她头顶上面传来了尖细的犬吠声。她赶紧抬头朝上看，一只大的叭儿狗，正在瞪着又大又圆的眼睛朝下看着她，还轻轻地伸出一只爪子，要抓她。“可怜的小东西！”爱丽丝用哄小孩的声调说，一边还努力地向它吹口哨。但是实际上，她心里吓得要死，因为想到它可能饿了，那么不管她怎么哄它，它还是很可能把她吃掉的。 

她几乎不知道该怎么办，拾了一根小树枝，伸向小狗，那只小狗立即跳了起来，高兴地汪、汪叫着，向树枝冲过去，假装要咬，爱丽丝急忙躲进一排蓟树丛后面，免得给小狗撞倒，她刚躲到另一边，小狗就向树枝发起第二次冲锋。它冲得太急了，不但没有抓着树枝，反而翻了个筋斗，爱丽丝觉得真像同一匹马玩耍，随时都有被它踩在脚下的危险，因此，她又围着蓟树丛转了起来，那只小狗又向树枝发起了一连串的冲锋。每一次都冲过了头，然后再后退老远，而且嘶声地狂吠着。最后它在很远的地方蹲坐了下来，喘着气，舌头伸在嘴外，那双大眼睛也半闭上了。 

这是爱丽丝逃跑的好机会，她转身就跑了，一直跑得喘不过气来，小狗的吠声也很远了，才停了下来。 

“然而，这是只多么可爱的小狗啊！”在爱丽丝靠在一棵毛茛上，用一片毛茛叶搧着休息时说，“要是我像正常那么大小，我真想教它玩许多把戏，啊，亲爱的，我几乎忘记我还要想法再长大呢？让我想一想，这怎么才能做到呢？我应该吃或者喝一点什么东西，可是该吃喝点什么呢？” 

确实，最大的问题是吃喝点什么呢？爱丽丝看着周围的花草，没有可吃喝的东西。离她很近的地方长着一个大蘑菇，差不多同她一样高。她打量了蘑菇的下面、边沿、背面，还想到应该看看上面有什么东西。 

她踮起脚尖，沿蘑菇的边朝上看，立即看到一只蓝色的大毛毛虫，正环抱胳膊坐坐在那儿，安静地吸着一个很长的水烟管，根本没有注意到她和其它任何事情。 

第五章 毛毛虫的建议

毛毛虫和爱丽丝彼此沉默地注视了好一会。最后，毛毛虫从嘴里拿出了水烟管，用慢吞吞的、瞌睡似的声调同她说起了话。 

“你是谁？”毛毛虫问，这可不是鼓励人谈话的开场白，爱丽丝挺不好意思地回答说：“我……眼下很难说，先生……至少今天起床时，我还知道我是谁的，从那时起，可是我就变了好几回了，” 

“你这话是什么意思？”毛毛虫严厉地说，“你自己解释一下！” 

“我没法解释，先生，”爱丽丝说，“因为我已经不是我自己了，你瞧。” 

“我瞧不出。”毛毛虫说。 

“我不能解释得更清楚了，”爱丽丝非常有礼貌地回答，“因为我压根儿不懂是怎么开始的，一天里改变好几次大小是非常不舒服的。” 

“唉，也许你还没有体会，”爱丽丝说，“可是当你必须变成一只蝶蛹的时候——你知道自己总有一天会这样的——然后再变成一只蝴蝶、我想你会感到有点奇怪的，是不是，” 

“一点也不。”毛毛虫说。 

“哦！可能你的感觉同我不一样，”爱丽丝说，“可是这些事使我觉得非常奇怪。” 

“你！”毛毛虫轻蔑地说，“你是谁？” 

这句话又把他们带回了谈话的开头，对于毛毛虫的那些非常简短的回答，爱丽丝颇有点不高兴了，她挺直了身子一本正经地说：“我想还是你先告诉我，你是谁？” 

“为什么？”毛毛虫说。 

这又成了一个难题：爱丽丝想不出任何比较好的理由来回答它，看来，毛毛虫挺不高兴的，因此爱丽丝转身就走了。 

“回来！”毛毛虫在她身后叫道，“我有几句重要的话讲！”这话听起来倒是鼓舞人的，于是爱丽丝回来了。 

“别发脾气嘛！”毛毛虫说， 

“就这个话吗？”爱丽丝忍住了怒气问。 

“不。”毛毛虫说。 

爱丽丝想反正没什么事，不如在这儿等一等，也许最后它会说一点儿值得听的话的。有好几分钟，他只是喷着烟雾不说话。最后它松开胳膊，把水烟管从嘴里拿出来，说：“你认为你已经变了，是吗？” 

“我想是的，先生。”爱丽丝说。“我平时知道的事，现在都忘了，而且连把同样的身材保持十分钟都做不到，” 

“你忘了些什么？”毛毛虫问。 

“我试着背《小蜜蜂怎么干活》，可是背出来的完全变了样！”爱丽丝忧郁地回答。 

“那么背诵《你老了，威廉爸爸》吧！”毛毛虫说。 

爱丽丝把双手交叉放好，开始背了： 

“年轻人说道： 

‘你已经老啦，威廉爸爸， 

你头上长满了白发。 

可你老是头朝下倒立着， 

像你这把年纪，这合适吗？’ 

‘当我年轻的时候，’ 

威廉爸爸回答儿子， 

‘我怕这样会损坏脑子； 

现在我脑袋已经空啦， 

所以就这样玩个不止，’ 

‘你已经老啦，’年轻人说：‘像我刚才说的一样， 

你已经变得非常肥胖； 

可是你一个前空翻翻进门来， 

这是怎么搞的？请你讲讲。’ 

‘当我年轻的时候，’ 

老哲人摇晃着灰白的卷发说道， 

‘我总是让关节保持柔软灵巧， 

我用的是这种一先令一盒的油膏， 

你想要两盒吗， 

请允许我向你推销，’ 

‘你已经老啦，’年轻人说， 

‘你的下巴应该是 

衰弱得只能喝些稀汤， 

可是你把一只整鹅， 

连骨带嘴全都吃光， 

请问你怎能这样，’ 

‘当我年轻的时候，’爸爸说， 

研究的是法律条文。 

对于每个案子， 

都拿来同妻子辩论， 

因此我练得下巴肌肉发达， 

这使我受用终身。’ 

‘你已经老啦，’年轻人说， 

‘很难想象， 

你的眼睛会像从前，一样闪光。 

可是你居然能把一条鳗鱼， 

竖在鼻子尖上。 

请问，你怎会这么棒，’ 

“够啦，’他的爸爸说， 

‘我已经回答了三个问题。 

你不要太放肆啦， 

我不会整天听你胡言乱语。 

快滚吧，不然我就要， 

一脚把你踢下楼梯。’” 

“背错了。”毛毛虫说。 

“我也怕不十分对，”爱丽丝羞怯地说，“有些字已经变了。” 

“从头到尾都错了，”毛毛虫干脆地说。然后他们又沉默了几分钟。 

毛毛虫首先开腔了：“你想变成多么大小呢？” 

“唉！多么大小我倒不在乎。”爱丽丝急忙回答，“可是，一个人总不会喜欢老是变来变去的，这你是知道的。” 

“我不知道。”毛毛虫说。 

爱丽丝不说话了，她从来没有遭到过这么多的反驳，感到自己要发脾气了。 

“你满意现在的样子吗？”毛毛虫说， 

“哦，如果你不在意的话，先生，我想再大一点，”爱丽丝说，“像这样三英寸高，太可怜了，” 

“这正是一个非常合适的高度。”毛毛虫生气地说，它说话时还使劲儿挺直了身子，正好是三英寸高。 

“可我不习惯这个高度！”爱丽丝可怜巴巴地说道，同时心里想：“我希望这家伙可别发火！” 

“不久你就会习惯的！”毛毛虫说着又把水烟管放进嘴里抽起来了。 

这次，爱丽丝耐心地等着它开口，一两分钟后，毛毛虫从嘴里拿出了水烟管，打了个哈欠，摇了摇身子，然后从蘑菇上下来，向草地爬去，只是在它爬的时候，顺口说道：“一边会使你长高，另一边会使你变矮，”“什么东西的一边，什么东西的另一边？”爱丽丝想。 

“蘑菇，”毛毛虫说，就好像爱丽丝在问它似的说完了话，一刹那就不见了。 

有那么一两分钟，爱丽丝端详着那个蘑菇，思讨着哪里是它的两边。由于它十公圆，爱丽丝发现这个问题可不容易解决。不管怎样，最后，她伸开双管环抱着它，而且尽量往远伸，然后两只手分别掰下了一块蘑菇边。 

“可现在哪边是哪边呢？”她问自己，然后啃了右手那块试试。蓦地觉得下巴被猛烈地碰了一下：原来下巴碰着脚背了。这突然的变化使她战栗，缩得太快了，再不抓紧时间就完了，于是，她立即去吃另一块，虽然下巴同脚顶得太紧，几乎张不开口，但总算把左手的蘑菇啃着了一点。 

“啊，我的头自由了！”爱丽丝高兴地说，可是转眼间高兴变成了恐惧。这时，她发现找不见自己的肩膀了，她往下看时，只能见到了很长的脖子，这个脖子就像是矗立在绿色海洋中的高树杆。 

“那些绿东西是什么呢？”爱丽丝说，“我的肩膀呢？哎呀！我的可怜的双手啊，怎样才能再见到你们呢？”她说话时挥动着双手，可是除了远处的绿树丛中出现一些颤动外，什么也没有了。 

看起来，她的手没法举到头上来了，于是，她就试着把头弯下去凑近手。她高兴地发现自己的脖子像蛇一样，可以随便地往上下左右扭转，她把脖子朝下，变成一个“z”字形，准备伸进那些绿色海洋里去，发现这些绿色海洋不是别的，正是刚才曾经在它下面漫游的树林的树梢。就在这对，一种尖利的嘶声，使得她急忙缩回了头。一只大鸽子朝她脸上飞来，并且呼搧着翅膀疯狂地拍打她。 

“蛇！”鸽子尖叫着。 

“我不是蛇！”爱丽丝生气地说，“你走开！” 

“我再说一遍，蛇！”鸽子重复着，可是已经是用很低的声音在说话了，然后还呜咽地加了一句：“我各种方法都试过了，但是没有一样能叫它们满意！” 

“你的话我一点几都不懂！”爱丽丝说， 

“我试了树根，试了河岸，还试了篱笆，”鸽子继续说着，并不注意她，“可是这些蛇！没法子让它们高兴！” 

爱丽丝越来越奇怪了，但是她知道，鸽子不说完自己的话，是不会让别人说话的。 

“仅仅是孵蛋就够麻烦的啦，”鸽子说，“我还得日夜守望着蛇，天哪！这三个星期我还没合过眼呢！” 

“我很同情，你被人家扰乱得不得安宁，”爱丽丝开始有点明白它的意思了， 

“我刚刚把家搬到树林里最高的树上，”鸽子继续说，把嗓门提高成了尖声嘶叫，“我想已经最后摆脱它们了，结果它们还非要弯弯曲曲地从天上下来不可。唉！这些蛇呀！” 

“我可不是蛇，我告诉你！”爱丽丝说，“我是一个……我是一个……， 

“啊，你是什么呢？”鸽子说，“我看得出你正想编谎哩！” 

“我是一个小姑娘。”爱丽丝拿不准地说，因为她想起了这一天中经历的那么多的变化。 

“说得倒挺像那么回事！”鸽子十分轻蔑地说，“我这辈子看见过许多小姑娘，可从来没有一个长着像你这样的长脖子的！没有，绝对没有！你是一条蛇，辩解是没有用的，我知道你还要告诉我，你从来没有吃过一只蛋吧！” 

“我确实吃过许多的蛋，”爱丽丝说，（她是一个非常诚实的孩子。）“你知道，小姑娘也像蛇那样，要吃好多蛋的。” 

“我不相信，”鸽子说，“假如她们吃蛋的话，我只能说她们也是一种蛇。” 

这对于爱丽丝真是个新的概念，她愣了几分钟。于是鸽子趁机加了一句：“反正你是在找蛋，因此，你是姑娘还是蛇，对我都一样。” 

“这对我很不一样，”爱丽丝急忙分辩，“而且老实说，我不是在找蛋，就算我在找蛋，我还不要你的呢？我是不吃生蛋的。” 

“哼，那就滚开！”鸽子生气地说着，同时又飞下去钻进它的窝里了。爱丽丝费劲儿地往树林里蹲，因为她的脖子常常会被树叉挂住，要随时停下来排解。过了一会，她想起了手里的两块蘑菇，于是她小心地咬咬这块，又咬咬那块，因此她一会儿L长高，一会缩小，最后终于使自己成了平常的高度了。 

由于她已经不是正常高度了，所以开头还有点奇怪，不过几分钟就习惯了。然后又像平常那样同自己说话了。“好啊，现在我的计划完成一半了。这些变化多么奇怪，我无法知道下一分钟我会是什么样儿。不管怎样，现在我总算回到自己原来的大小了，下一件事情就是去那个美丽的花园。可是我不知道该怎么去做呢？”说话间来到了一片开阔地，这里有一间四英尺高的小房子。“别管是谁住在这里，”爱丽丝想，“我现在这样的大小不能进去，邓会把它们吓得灵魂出窍的，”她小口小口地咬了一点右手上的蘑菇，一直到自己变成九英寸高，才走向那座小房子。 

第六章 小猪和胡椒

她站在小房跟前看了一两分钟，想着下一步该干什么。突然间，一个穿着制服的仆人（她认为仆人是由于穿着仆人的制服，如果只看他的脸，会把他看成一条鱼的）从树林跑来，用脚使劲儿地踢着门。另一个穿着制服，长着圆脸庞和像青蛙一样大眼睛的仆人开了门，爱丽丝注意到这两个仆人，都戴着涂了脂的假发。她非常想知道这到底是怎么回事，于是就从树林里探出头来听。 

鱼仆人从胳膊下面拿出一封很大的信，这信几乎有他身子那么大，然后把信递给那一个，同时还用严肃的声调说：“致公爵夫人：王后邀请她去玩槌球。”那位青蛙仆人只不过把语序变了一下，用同样严肃的声调重复着说：“王后的邀请：请公爵夫人去玩槌球。” 

然后他们俩都深深地鞠了个躬，这使得他们的假发缠在一起了。这情景惹得爱丽丝要发笑了，她不得不远远地跑进树林里，免得被他们听到。她再出来偷看时，鱼仆人已经走了，另一位坐在门口的地上，呆呆地望着天空愣神。 

爱丽丝怯生生地走到门口，敲了门。 

“敲门没用。”那位仆人说，“这有两个原因：第一，因为我同你一样，都在门外，第二，他们在里面吵吵嚷嚷，根本不会听到敲门声。”确实，里面传来了很特别的吵闹声：有不断的嚎叫声，有打喷嚏声，还不时有打碎东西的声音，好像是打碎盘子或瓷壶的声音。 

“那么，请告诉我，”爱丽丝说，“我怎么进去呢？” 

“如果这扇门在我们之间，你敲门，可能还有意义，”那仆人并不注意爱丽丝，继续说着，“假如，你在里面敲门，我就能让你出来。”他说话时，一直盯着天空，爱丽丝认为这是很不礼貌的。“也许他没有办法，”她对自己说，“他的两只眼睛几乎长到头顶上了，但至少是可以回答问题的，我该怎样进去呢？”因此，她又大声重复地说。 

“我坐在这里，”那仆人继续说他的，“直到明天……” 

就在这时，这个房子的门开了，一只大盘子朝仆人的头飞来，掠过他的鼻子，在他身后的一棵树上撞碎了。 

“……或者再过一天。”仆人继续用同样的口吻说，就像什么也没发生过。 

“我该怎么进去呢？”爱丽丝更大声地问， 

“你到底要不要进去呢？”仆人说，“要知道这是该首先决定的问题，”这当然是对的，不过爱丽丝不愿意承认这点，“真讨厌，”她对自己喃喃地说道，“这些生物讨论问题的方法真能叫人发疯。” 

那仆人似乎认为是重复自己的话的好机会，不过稍微改变了一点儿说法：“我将从早到晚坐在这几，一天又一天地坐下去。” 

“可是我该干什么呢？”爱丽丝说， 

“你想干什么就干什么？”仆人说服就吹起口哨来了。 

“唉，同他说话没用！”爱丽丝失望地说，“他完全是个白痴！”然后她就推开门自己进去了。 

这门直通一间大厨房，厨房里充满了烟雾，公爵夫人在房子中间，坐在—只三腿小凳上照料一个小孩。厨师俯身在炉子上的一只人锅里搅拌着，锅里好像盛满了汤。 

“汤里的胡椒确实太多了！”爱丽丝费劲儿地对自己说，并不停地打着喷嚏。 

空气里的胡椒味也确实太浓了，连公爵夫人也常常打喷嚏。至于那个婴孩，不是打喷嚏就是嚎叫，一刻也不停。这间厨房里只有两个生物不打喷嚏，就是女厨师和一只大猫，那只猫正趴在炉子旁，咧着嘴笑哩。 

“请告诉我，”爱丽丝有点胆怯地问，因为她还不十分清楚自己先开口合不合规矩，“为什么你的猫能笑呢？” 

“它是柴郡猫（郡：英国的行政区域单位，柴郡为一个郡的名称，由于本书影响，现在西方人都把露齿傻笑的人称为柴郡猫。），”公爵夫人说，“这就是为什么它会笑了。猪！” 

公爵夫人凶狠地说出的最后的—个字，把爱丽丝吓了一大跳。但是，爱丽丝马上发觉她正在同婴孩说话，而不是对自己说，于是她又鼓起了勇气，继续说： 

“我还不知道柴郡猫经常笑，实际上，我压根儿不知道猫会笑的。” 

“它们都会的，”公爵夫人说，“起码大多数都会笑的。” 

“我连一只都没见过。”爱丽丝非常有礼貌地说，并对这场开始了的谈话感到高兴。 

“你知道的太少了，”公爵夫人说，“这是个事实。” 

爱丽丝不喜欢这种谈话的口气，想最好换个话题，她正在想话题的时候，女厨师把汤锅从火上端开了，然后立即把她随手能拿着的每件东西扔向公爵夫人和婴孩。火钩子第一个飞来，然后，平底锅、盆子、盘子像暴风雨似地飞来了。公爵夫人根本不理会，甚至打到身上都没反应。而那婴孩早已经拼命地嚎叫了，也不知道这些东西打到了他身上没有。 

“喂，当心点！”爱丽丝喊着，吓得心头不住地跳，“哎哟，他那小鼻子完了。”真的，一只特大平底锅紧擦着鼻子飞过，差点就把鼻子削掉了。 

“如果每个人都关心自己的事，”公爵夫人嘶哑着嗓子嘟喷着说，“地球就会比现在转得快一些。” 

“这没好处，”爱丽丝说，她很高兴有个机会显示一下自己的知识，“你想想这会给白天和黑夜带来什么结果呢？要知道地球绕轴转一回要用二十四个钟头。” 

“说什么？”公爵夫人说，“把她的头砍掉！” 

爱丽丝相当不安地瞧了女厨师一眼，看她是不是准备执行这个命令，女厨师正忙着搅汤，好像根本没听到，于是爱丽丝又继续说：“我想是二十四个小时，或许是十二个小时，我……” 

“唉，别打扰我！”公爵夫人说，“我受不了数字！”她说着照料孩子去了，她哄孩子时唱着一种催睡曲，唱到每句的末尾，都要把孩子猛烈地摇儿下。 

“对你的小男孩要粗暴地说话，在他打喷嚏的时候就读他，因为他这样只是为了捣乱，他只不过是在撒娇和卖傻。”合唱（女厨师和小孩也参加）：哇！哇！哇！ 

公爵夫人唱第二段歌时，把婴孩猛烈地扔上扔下，可怜的小家伙没命地嚎哭，所以爱丽丝几乎都听不清唱词了：“我对我的小孩说话严厉，他一打喷嚏我就读他个够味，因为他只要高兴，随时可以欣赏胡椒的味道。”合唱：哇！哇！哇！ 

“来！如果你愿意的话，抱他一会儿！”公爵夫人一边对爱丽丝说，一边就把小孩扔给她，“我要同王后玩链球去了，得准备一下。”说着就急忙地走出了房间。她往外走时，女厨师从后自向她扔了只炸油锅，但是没打着。 

爱丽丝费劲儿地抓住那个小孩，因为他是个样子奇特的小生物，他的胳膊和腿向各个方向伸展，“真像只海星，”爱丽丝想，她抓着他时，这可怜的小家伙像蒸汽机样地哼哼着，还把身子一会儿蜷曲起来，一会儿伸开，就这样不停地折腾，搞得爱丽丝在最初的一两分钟里，只能勉强把他抓住。 

她刚找到—种拿住他的办法（把他像打结一样团在一起，然后抓紧他的右耳朵和左脚，他就不能伸开了）时，就把他带到屋子外面的露天地方去了。“如果我不把婴孩带走，”爱丽丝想，“她们肯定在一两天里就会把他打死的。把他扔在这里不就害了他吗？”最后一句她说出声来了，那小家伙咕噜了一声作为回答（这段时间他已经不打喷嚏了）。别咕噜，”爱丽丝说，“你这样太不像样子了。” 

那婴孩又咕噜了一声，爱丽丝很不安地看了看他的脸，想知道是怎么回事。只见他鼻子朝天，根本不像个常人样，倒像个猪鼻子；他的眼睛也变得很小不像个婴孩了。爱丽丝不喜欢这副模样。“也许他在哭吧，”爱丽丝想。她就看看他的眼睛，有没有眼泪。 

没有，一点儿眼泪也没有。“如果你变成了一只猪，”爱丽丝严肃地说，“听着，我可再不理你了！”那可怜的小家伙又抽泣了一声（或者说又咕噜了—声，很难说到底是哪种），然后他们就默默地走了一会儿。 

爱丽丝正在想：“我回家可把这小生物怎么办呢？，这时，他又猛烈地咕噜了一声，爱丽丝马上警觉地朝下看他的脸。这次一点儿都不会错了，它完全是只猪。她感到如果再带着它就太可笑了。 

于是她把这小生物放下，看着它很快地跑进树林，感到十分轻松。“如果它长大的话，爱丽丝对自己说，“一定会成为可怕的丑孩子，要不就成为个漂亮的猪。”然后，她去一个个想她认识的孩子，看看谁如果变成猪更像样些，她刚想对自己说：“只要有人告诉他们变化的办法……”，这时，那只柴郡猫把她吓了一跳，它正坐在几码远的树枝上。 

猫对爱丽丝只是笑，看起来倒是好脾气。爱丽丝想，不过它还是有很长的爪子和许多牙齿，因此还应该对它尊敬点。 

“柴郡猫，”她胆怯地说。还不知道它喜欢不喜欢这个名字，可是，它的嘴笑得咧开了。“哦，它很高兴，”爱丽丝想，就继续说了：“请你告诉我，离开这里应该走哪条路？” 

“这要看你想上哪儿去，”猫说。 

“去哪里，我不大在乎。”爱丽丝说。 

“那你走哪条路都没关系。”猫说。 

“只要．能走到一个地方。”爱丽丝又补充说了一句。 

“哦，那行，”猫说，“只要你走得很远的话。” 

爱丽丝感到这话是没法反对的，所以她就试着提了另外的一个问题：“这周围住些什么？” 

“这个方向”猫说着，把右爪子挥了一圈，“住着个帽匠；那个方向，”猫又挥动另一个爪子，“住着一只三月兔。你喜欢访问谁就访问谁，他们俩都是疯子。” 

“我可不想到疯子中间去。”爱丽丝回答。 

“啊，这可没法，”猫说，“我们这儿全都是疯的，我是疯的，你也是疯的。” 

“你怎么知道我是疯的？”爱丽丝问。 

“一定的，”猫说，“不然你就不会到这里来了。” 

爱丽丝想这根本不能说明问题，不过她还是继续问：“你又怎么知遏你是疯子呢？” 

“咱们先打这里说起，”猫说，“狗是不疯的，你同意吗？” 

“也许是吧！爱丽丝说。 

“好，那么，”猫接着说，“你知道，狗生气时就叫，高兴时就摇尾巴，可是我，却是高兴时就叫，生气时就摇尾巴。所以，我是疯子。” 

“我把这说成是打呼噜，不是叫。”爱丽丝说。 

“你怎么说都行，”猫说，“你今天同王后玩槌球吗？” 

“我很喜欢玩槌球，”爱丽丝说，“可是到现在还没有邀请我嘛！” 

“你，会在那儿看到我！”猫说着突然消失了。 

爱丽丝对这个并不太惊奇，她已经习惯这些不断发生的怪事了。她看着猫坐过的地方，这时，猫又突然出现了。 

“顺便问一声，那个婴孩变成什么了？”猫说，“我差一点忘了。” 

“已经变成一只猪了。”爱丽丝平静地回答说，就好像猫再次出现是正常的。 

“我就想它会那样的。”猫说着又消失了。 

爱丽丝等了一会，还希望能再看见它，可是它再没出现。于是，她就朝着三月兔住的方向走去。“帽匠那儿，我也要去的。”她对自己说，“三月兔一定非常有趣，现在是五月，也许它不至于太疯——至少不会比三月份疯吧。”就在说这些话时，一抬头又看见那只猫，坐在一根树枝上。 

“你刚才说的是猪，还是竹？”猫问。 

“我说的是猪，”爱丽丝回答，“我希望你的出现和消失不要太突然，这样，把人搞得头都晕了。” 

“好，”猫答应着。这次它消失得非常慢，从尾巴尖开始消失，一直到最后看不见它的笑脸，那个笑脸在身体消失后好久，还停留了好一会儿。 

“哎哟，我常常看见没有笑脸的猫，”爱丽丝想，“可是还从没见过没有猫的笑脸呢。这是我见过的最奇怪的事儿了。” 

她没走多远，就见到了一间房子，她想这一定是三月兔的房子了，因为烟囱像长耳朵，屋顶铺着兔子毛。房子很大，使她不敢走近。她咬了口左手的蘑菇，使自己长到了二英尺高，才胆怯地走去，一边对自己说：“要是它疯得厉害可怎么办？我还不如去看看帽匠呢！” 

第七章 发疯的茶会

房前的一棵大树下，放着一张桌子。三月兔和帽匠坐在桌旁喝着茶，一只睡鼠在他们中间酣睡着，那两个家伙把它当做垫子，把胳膊支在睡鼠身上，而且就在它的头上谈话。“这睡鼠可够不舒服的了，”爱丽丝想，“不过它睡着了，可能就不在乎了。” 

桌子很大，他们三个都挤在桌子的一角，“没地方啦！没地方啦！”他们看见爱丽丝走过来就大声嚷着。 

“地方多得很呢！”爱丽丝说着就在桌子一端的大扶手椅上坐下了。 

“要喝酒吗？”三月兔热情地问。 

爱丽丝扫视了一下桌上，除了茶，什么也没有。“我没看见酒啊！”她回答。 

“根本就没酒嘛！”三月兔说。 

“那你说喝酒就不太礼貌了。”爱丽丝气愤地说。 

“你没受到邀请就坐下来，也是不太礼貌的。”三月兔回敬她。 

“我不知道这是你的桌子，”爱丽丝说，“这可以坐下好多人呢？还不止三个！” 

“你的头发该剪了。”帽匠好奇地看了爱丽丝一会儿，这是他第一次开口。 

“你应该学会不随便评论别人，”爱丽丝板着脸说，“这是非常失礼的。” 

帽匠睁大眼睛听着，可是末了他说了句：“一只乌鸦为什么会像一张写字台呢？” 

“好了，现在我们可有有趣的事了！”爱丽丝想，“我很高兴猜谜语，我一定能猜出来，”她大声说。 

“你的意思是你能说出答案来吗？”三月兔问， 

“正是这样。”爱丽丝说。 

“那你怎么想就怎么说。”三月兔继续说。 

“我正是这样的，”爱丽丝急忙回答，“至少……至少凡是我说的就是我想的——这是一回事，你知道。” 

“根本不是一回事，”帽匠说，“那么，你说‘凡是我吃的东西我都能看见’和‘凡是我看见的东西我都能吃’，也算是一样的了？”三月兔加了句：“那么说‘凡是我的东西我都喜欢’和‘凡是我喜欢的东西都是我的’，也是一样的喽？” 

睡鼠也像在说梦话一样说道：“那么说‘我睡觉时总要呼吸’和‘我呼吸时总在睡觉’也是一样的吗？” 

“这对你倒真是一个样。”帽匠对睡鼠说。谈到这里话题中断了，大家沉默了一会，这时候爱丽丝费劲儿地想着有关乌鸦和写字台的事，可是她知道的确实不能算多，还是帽匠打破了沉默，“今天是这个月的几号？”他问爱丽丝，一面从衣袋里掏出了一只怀表，不安地看着，还不停地摇晃，拿到耳朵旁听听。 

爱丽丝想了想说，“四号。” 

“错了两天！”帽匠叹气说，“我告诉你不该加奶油的，”他又生气地看着三月兔加了一句。 

“这是最好的奶油了！”三月兔辩白地说。 

“不错，可是不少面包屑也掉进去了，帽匠咕噜着，“你不应该用面包刀加奶油。” 

三月兔泄气地拿起怀表看看，再放到茶杯里泡了一会儿，又拿起来看看，但是除了说“这是最好的奶油了”，再没别的说的了。 

爱丽丝好奇地从他肩头上看了看。“多么奇怪的不表啊，”她说，“它告诉几月几日，却不告诉时间。” 

“为什么要告诉时间呢？”帽匠嘀咕着，“你的表告诉你哪一年吗？” 

“当然不，”爱丽丝很快地回答说，“可是很长时，里年份不会变的。” 

“这也跟我的表不报时间的原因一样。”帽匠说。 

爱丽丝被弄得莫名其妙，帽匠的话听起来没有任何意思，然而确实是地地道道的英国话。“我不大懂你的话，”她很礼貌地说。 

“睡鼠又睡着了，”帽匠说着在睡鼠的鼻子上倒了一点热茶。 

睡鼠立即晃了晃头，没睁开眼就说：“当然，当然，我自己正要这么说呢。” 

“你猜到那个谜语了吗？”帽匠说爱丽丝，“没有，我猜不出来，”爱丽丝回答，“谜底到底是什么呢？” 

“我也不知道。”帽匠说。 

“我也不清楚，”三月兔说， 

爱丽丝轻轻叹了一声说，“我认为你应该珍惜点时间，像这样出个没有谜底的谜语，简直是白白浪费宝贵的时间。” 

“如果你也像我一样对时间熟悉，”帽匠说，“你就不会叫它‘宝贵的时间’，而叫它‘老伙计’了。” 

“我不懂你的意思。”爱丽丝说。 

“你当然不懂，”帽匠得意地晃着头说，“我敢肯定你从来没有同时间说过话。” 

“也许没有，”爱丽丝小心地回答，“但是我在学音乐的时候，总是按着时间打拍子的。” 

“唉，这就完了！”帽匠说，“你最不高兴人家按住它打了。如果你同它好，它会让钟表听你的话，譬如说，现在是早上九点钟，正是上学的时间，你只要悄悄地对时间说一声，钟表就会一下子转到一点半，该吃午饭了！” 

“我真希望这样。”三月兔小声自语道。 

“那太棒了！”爱丽丝思索着说，“可是要是我还不饿怎么办呢？” 

“一开始也可能不饿，”帽匠说，“但是只要你喜欢，你就能把钟表保持在一点半钟。” 

“你是这样办的吗？”爱丽丝问。 

帽匠伤心地摇摇头，“我可不行了，”他回答，“我和时间在三月份吵了架——就是他发疯前（他用茶匙指着三月兔），那是在红心王后举办的一次大音乐会上，我演唱了： 

‘闪闪的小蝙蝠，我感到你是多么奇怪！’ 

你可能知道这首歌吧？” 

“我听过一首同它有点像（原来的歌应为“闪闪的小星，你是多么的奇怪……帽匠全唱错了。这首歌现在中国有唱片，有些中小学常常播放。）。”爱丽丝说。 

“我知道下面是这样接着的，”帽匠继续说，“是这样的： 

‘你飞在地面上多高， 

就像茶盘在天空上。 

闪啊，闪啊……’” 

睡鼠抓了摇身子，在睡梦中开始唱道：“闪啊，闪啊，闪啊，闪啊，”一直唱下去，直到他们捅，了它一下才停止。 

“我还没唱完第一段，”帽匠说，“那王后就大喊道“他简直是在糟蹋时间，砍掉他的头！’” 

“多么残忍呀！”爱丽丝攘道。 

帽匠伤心地继续说，“从那以后，它就再也不肯照我的要求做了，它总是停在六点钟。” 

爱丽丝的脑子里突然闪过一个聪明的念头，她问：“这就是这儿有这么多茶具的缘故吗？” 

“是的，就是这个缘故，”帽匠叹息着说，“只有喝茶的时间，连洗茶具的时间也没有了。”， 

“所以你们就围着桌子转？”爱丽丝问。 

“正是这样，”帽匠说，“茶具用脏了，我们就往下挪。” 

“可是你们转回来以后怎么办呢？”爱丽丝继续间。 

“我们换一个话题吧，”三月兔打着哈欠打断了他们的谈话，“我听烦了，建议让小姑娘讲个故事吧。” 

“恐怕我一个故事都不会讲，”爱丽丝说。她对这个建议有点慌神。 

“那么睡鼠应该讲一个！”三月兔和帽匠一齐喊道，“醒醒，睡鼠！”他们立刻在两边一起捅它。 

睡鼠慢慢地睁开眼，嘶哑无力地说：“我没有睡，你们说的每一个字我都听着呢。” 

“给我们讲个故事！”三月兔说。 

“就是，请讲一个吧！”爱丽丝恳求着。 

“而且要快点讲，要不然你还没讲完又睡着了，”帽匠加了一句。 

睡鼠急急忙忙地讲了：“从前有三个小姐妹，她们的名字是：埃尔西、莱斯、蒂尔莉，她们住在一个井底下……” 

“她们靠吃什么活着呢？”爱丽丝总是最关心吃喝的问题。 

“她们靠吃糖浆生活。”睡鼠想了一会儿说。 

“你知道，这样是不行的，她们都会生病的。”爱丽丝轻声说。 

“正是这样，她们都病了，病得很厉害。”睡鼠说。 

爱丽丝尽量地想象这样特殊的生活方式会是什么样子，可是太费脑子了。于是，她又继续问：“她们为什么要住在井底下呢？” 

“再多喝一点茶吧！”三月兔认真地对爱丽丝说。 

“我还一点都没喝呢？因此不能说再多喝一点了！”爱丽丝不高兴地回答。 

“你应该说不能再少喝点了，”帽匠说，“比没有喝再多喝一点是最容易不过的了。” 

“没人来问你！”爱丽丝说。 

“现在是谁失礼了？”帽匠得意地问。 

这回爱丽丝不知该说什么了，只得自己倒了点茶，拿了点奶油面包，再向睡鼠重复她的问题：“她们为什么要住在井底下呢？”， 

睡鼠又想了一会，说：“因为那是一个糖浆井。” 

“没有这样的井！”爱丽丝认真了。帽匠和三月兔不停地发出“嘘、嘘……”的声音，睡鼠生气地说：“如果你不讲礼貌，那么最好你自己来把故事讲完吧。” 

“不，请你继续讲吧！”爱丽丝低声恳求着说，“我再不打岔了，也许有那样一个井吧。” 

“哼，当然有一个！”睡鼠煞有介事地说。又往下讲了：“这三个小姐妹学着去画画。” 

“她们画什么呢？”爱丽丝忘了自己的保证又问开了。 

“糖浆。”睡鼠这次毫不犹豫地回答。 

“我想要一只干净茶杯，”帽匠插嘴说，“让我们移动一下位子吧。” 

他说着就挪到了下一个位子上，睡鼠跟着挪了，三月兔挪到了睡鼠的位子上，爱丽丝很不情愿地坐到了三月兔的位子上。这次挪动唯一得到好处的是帽匠，爱丽丝的位子比以前差多了，因为三月兔把牛奶罐打翻在位子上了。 

爱丽丝不愿再惹睡鼠生气，于是开始小心地说：“可是我不懂，她们从哪里把糖浆取出来的呢？” 

“你能够从水井里吸水，”帽匠说，你也应该想到从糖浆井里能够吸糖浆了，怎么样，傻瓜？” 

“但是她们在井里呀！”爱丽丝对睡鼠说。 

“当然她们是在井里啦，”睡鼠说，“还在很里面呢。” 

这个回答把可怜的爱丽丝难住了，她好大没打搅睡鼠，让它一直讲下去。 

“她们学着画画，”睡鼠继续说着，一边打了个哈欠，又揉揉眼睛，已经非常困了，“她们画各种各样的东西，而每件东西都是用‘老’宇开头的。” 

“为什么用‘老’字开头呢？”爱丽丝问。 

“为什么不能呢？”三月兔说。 

爱丽丝不吭气了。这时候，睡鼠已经闭上了眼，打起盹来了，但是被帽匠捅了—下，它尖叫着醒来了，继续讲，“用‘老’字开头的东西，例如老鼠笼子，老头儿，还有老多。你常说老多东西，可是你怎么画出这个—老多’来？” 

“你问我吗？”爱丽丝难住了，说，“我还没想……” 

“那么你就不应该说话！”帽匠说。 

这句话可使爱丽丝无法忍受了，于是她愤愤地站起来走了，睡鼠也立即睡着了。那两个家伙一点也不注意爱丽丝的走掉。爱丽丝还回头看了一两次，指望他们能够留她。后来她看见他们正要把睡鼠塞进茶壶里去。 

“不管怎么说，我再也不去那里了，”爱丽丝在树林中找路时说，“这是我见过的最愚蠢的茶会了。” 

就在她叨叨咕咕的时候，突然看到一棵树上还有一个门，可以走进去。“真奇怪！”她想，“不过今天的每件事都很奇怪，还是进去看看吧。”想着就走进去了。 

她又一次来到那个很长的大厅里了，而且很靠近那只小玻璃桌子。“啊，这是我最好的机会了！”她说着拿起了那个小金钥匙，打开了花园的门，然后轻轻地咬了一门蘑菇（她还留了一小块在口袋里呢），直到缩成大约一英尺高，她就走过了那条小过道。终于进入了美丽的花园，到达了漂亮的花坛和清凉的喷泉中间了。 

第八章 王后的槌球场

靠近花园门口有一棵大玫瑰树，花是白色的，三个园丁正忙着把白花染红。爱丽丝觉得很奇怪，走过去想看看。当她正朝他们走过去的时候，其中一个人说：“小心点，老五！别这样把颜料溅到我身上。” 

“不是我不小心，”老五生气地说，“是老七碰了我的胳膊。” 

这时老七抬起头说：“得啦！老五，你老是把责任推给别人。” 

“你最好别多说了，”老五说，“我昨天刚听王后说，你该受斩头的惩罚！” 

“为什么？”第一个说话的人问。 

“这与你无关，老二！”老七说。 

“不，与他有关！”老五说，“我要告诉他——这是由于你没给厨师拿去洋葱，而拿去了郁金香根！” 

老七扔掉了手上的刷子说，“哦，说起不公平的事……”他突然看到了爱丽丝，爱丽丝正站着注视他们呢。他随即不说了，那两个也回过头来看。然后三人都深深地鞠了一躬。 

“请你们告诉我，”爱丽丝胆怯地说，“为什么染玫瑰花呢？” 

老五和老七都望着老二，老二低声说：“哦，小姐，你知道，这里应该种红玫瑰的，我们弄错了，种了白玫瑰，如果王后发现，我们全都得被杀头。小姐，你看，我们正在尽最大努力，要在王后驾临前，把……”就在这时，一直在焦虑地张望的老五，突然喊道：“王后！王后！”这三个园丁立即脸朝下地趴下了。这时传来了许多脚步声，爱丽丝好奇地审视着，想看看王后。 

首先，来了十个手拿狼牙棒的士兵，他们的样子全都和三个园丁一样，都是长方形的平板，手和脚长在板的四角上。接着来了十名侍臣，这些人全都用钻石装饰着，像那些士兵一样，两个两个并排着走。侍臣的后面是王室的孩子们，这些可爱的小家伙，一对对手拉着手愉快地跳着跑来了，他们全都用红心（红心和侍臣的钻石，士兵的狼牙棒，是纸牌中的三种花色。即：红桃、方块、草花，英文原意为红心、钻石、棒子。）装饰着。后面是宾客，大多数宾客也是国王和王后。在那些宾客中，爱丽丝认出了那只白兔，它正慌忙而神经质地说着话，对别人说的话都点头微笑，却没注意到爱丽丝。接着，是个红心武士，双手托着放在紫红色垫子上的王冠。这庞大的队伍之后，才是红心国王和王后。 

爱丽丝不知道该不该像那三个园丁那样，脸朝地的趴下，她根本不记得王室行列经过时，还有这么一个规矩。“人们都脸朝下趴着，谁来看呢？这样，这个行列有什么用呢？”也这样想着，仍站在那里，等着瞧。 

队伍走到爱丽丝面前时，全都停下来注视着她。王后严厉地问红心武上：“这是谁呀！”红心武士只是用鞠躬和微笑作为回答。 

“傻瓜！”王后不耐烦地摇摇头说，然后向爱丽丝问道：“你叫什么名字？小孩？” 

“我叫爱丽丝，陛下。”爱丽丝很有礼貌地说，可她又自己嘀咕了句：“哼！说来说去，他们只不过是一副纸牌，用不着怕他们！” 

“他们是谁呢？”皇后指着三个园丁问。那三个园丁围着一株玫瑰趴着，背上的图案同这副纸牌的其他成员一样，看不出这三个是园丁呢？还是士兵、侍臣，或者是她自己的三个孩子了。 

“我怎么知道呢？这不干我的事！”爱丽丝回答，连她自己都对自己的勇气感到惊奇。 

王后的脸气红了，两眼像野兽样瞪了爱丽丝一会儿，然后尖声叫道：“砍掉她的头！砍掉……” 

“废话！”爱丽丝干脆大声说。而王后却不说话了。 

国王用手拉了下王后的胳膊，小声地说：“冷静点，我亲爱的，她还只是个孩子啊！” 

王后生气地从国王身边转身走开了，并对武士说：“把他们翻过来。” 

武士用脚小心地把他们三个翻了过来。 

“起来！”王后尖声叫道。那三个园丁赶紧爬起来，开始向国王、王后、王室的孩子们以及每个人一一鞠躬。 

“停下来！”王后尖叫着，“把我的头都弄晕了！”她转身向着那株玫瑰继续问：“你们在于什么？” 

“陛下，愿你开恩，”老二低声下气地跪下一条腿说，“我们正想……” 

“我明白了！砍掉他们的头！，王后察看了一阵玫瑰花后说。队伍又继续前进了，留下三个士兵来处死这三个不幸的园丁。三个园丁急忙跑向爱韶丝，想得到她的保护。 

“你们不会被砍头的！”爱丽丝说着就把他们藏进旁边的一个大花盆里。那三个士兵到处找，几分钟后还没找到，只得悄悄地去追赶自己的队伍了。 

“把他们的头砍掉没有？”王后怒吼道。 

“他们的头已经掉了，陛下！”士兵大声回答， 

“好极了！”王后说，“你会玩槌球吗？” 

士兵们都看着爱丽丝，这个问题显然是问爱丽丝的。 

“会！”爱丽丝大声回答。 

“那就过来！”王后喊道。于是爱丽丝就加入了这个队伍，她心里盘算着以后会发生什么事情呢？ 

“这……这真是一个好天气呵！”爱丽丝身旁一个胆怯的声音说。原来爱丽丝恰巧走在白兔的旁边，白兔正焦急地偷愉看着她的脸呢。 

“是个好天气，”爱丽丝说，“公爵夫人在哪里呢？” 

“嘘！嘘！”兔子急忙低声制止她，同时还担心地转过头向王后看看，然后踮起脚尖把嘴凑到爱丽丝的耳朵根上，悄悄地说：“她被判处了死刑。” 

“为什么呢？”爱丽丝问。 

“你是说真可怜吗？”兔子问。 

“不，不是，”爱丽丝问，“我没想可怜不可怜的问题，我是说为什么？” 

“她打了王后耳光……”兔子说。爱丽丝笑出声来了。“嘘！”兔子害怕地低声说，“王后会听到的！你知道，公爵夫人来晚了，王后说……” 

“各就各位！”王后雷鸣般地喊了一声，人们就朝各个方向跑开了，撞来撞去的，一两分钟后总算都站好了自己的位置。于是游戏开始了。 

爱丽丝想，可还从来没见过这样奇怪的槌球游戏呢？球场到处都是坎坷不平的，槌球是活刺猬，槌球棒是活红鹤（红鹤：Phoenicopterus科，趾间有蹼，因种不同羽色各异，有红、灰等色。虽称红鹤，但与鹤科Gruidae无关。中国无此鸟。），士兵们手脚着地当球门。 

起初，爱丽丝很难摆弄红鹤，后来总算很成功地把红鹤的身子舒服地夹在胳膊底下，红鹤的腿垂在下面。可是，当她好不容易把红鹤的脖子弄直，准备用它的头去打那个刺猬时，红鹤却把脖子扭上来，用奇怪的表情看着爱丽丝的脸，惹得爱丽丝大声笑了。她只得把红鹤的头按下去，当她准备再一次打球的时候，恼火地发现刺猬已经展开了身子爬走了。此外，把刺猬球打过去的路上总有一些土坎或小沟，躬腰做球门的士兵常常站起来走到球场的其它地方去。爱丽丝不久就得出结论：这确实是一个非常困难的游戏。 

参加游戏的人没等轮到自己，就一起打起球来了，不时地为了刺猬争吵和打架。不一会，王后就大发雷霆，跺着脚来回地走，大约一分钟叫喊一次：“砍掉他的头！”“砍掉她的头！” 

爱丽丝感到非常不安，说真的她还没有同王后发生争吵，可是这是每分钟都可能发生的呀！“如果吵架的话，”她想，“我会怎么样呢？这儿的人太喜欢砍头了！可是很奇怪，现在还有人活着。” 

爱丽丝就寻找逃走的路，而且还想不被人发现的逃开。这时，她注意到天空出现了一个怪东西，起初她惊奇极了，看了一两分钟后，她判断出这是一个笑容，并对自己说：“这是柴郡猫，现在我可有人说话了。” 

“你好吗？”柴郡猫刚出现了能说话的嘴就问。 

爱丽丝等到它的眼睛也出现了，才点点头。“现在跟它说话没用处，”她想，“应该等它的两只耳朵也来了，至少来，了一只，再说话。”过了一两分钟，整个头出现了，爱丽丝才放下红鹤，给它讲打槌球的情况。她对于有人听她说话非常高兴。那只猫似乎认为出现的部分已经够了，就没有显露出身子。 

“他们玩得不公平，”爱丽丝抱怨地说，“他们吵得太厉害了，弄得人家连自己说的话都听不清了。而且他们好像没有一定的规则，就算有的话，也没人遵守。还有，你简直想象不到，所有的东西都是活的。真讨厌。譬如说，我马上就要把球打进球门，而那个球门却散步去了；再加我正要用自己的球碰王后的刺猾球，哼，它一见我的球来撒腿就跑掉啦！” 

“你喜欢王后吗？”猫轻声说。 

“一点都不喜欢，”爱丽丝说，“她非常……”正说到这里，她突然发觉王后就在她身后听呢？于是她马上改口说：“非常会玩椒球，别人简直不必要再同她比下去了。” 

王后微笑着走开了。 

“你在跟谁说话？”国王走来问爱丽丝，还很奇怪地看着那个猫头。 

“请允许我介绍，这是我的朋友——柴郡猫。”爱丽丝说。 

“我一点也不喜欢它的模样，不过，如果它愿意的话，可以吻我的手。”国王说。 

“我不愿意。”猫回答。 

“不要失礼！”国王说，“别这样看我了！”他一边说一边躲到爱丽丝的身后。 

“猫是可以看国王的，我在一本书上见过这句话，不过不记得是哪本书了。”爱丽丝说。 

“喂，必须把这只猫弄走！”国王坚决地说，接着就向刚来的王后喊道：“我亲爱的，我希望你来把这只猫弄走。” 

王后解决各种困难的办法只有一种：“砍掉它的头！”她看也不看一下就这样说。 

“我亲自去找刽子手。”国王殷勤地说着，急急忙忙走了。 

爱丽丝听到王后在远处尖声吼叫，想起该去看看游戏进行得怎样了。爱丽丝已经听到王后又宣判了三个人死刑，原因是轮到他们打球而没有马上打。爱丽丝很不喜欢这个场面，整个游戏都是乱糟糟的，弄得她根本不知道什么时候轮到，什么时候不轮到。因此她就走了，找她的刺猬去了。 

她的刺猬正同另一只刺猬打架，爱丽丝认为这真是用一只刺猬球去打中另一个刺猬球的好机会，可是她的红鹤却跑掉了，爱丽丝看到它正在花园的那边，在徒劳地向树上飞。 

等她捉住红鹤回来，正在打架的两只刺猬都跑得无影无踪了。爱丽丝想：“这没多大关系，因为这里的球门都跑掉了。”为了不让红鹤再逃跑，爱丽丝把它夹在胳膊下，又跑回去想同她的朋友多谈一会儿。 

爱丽丝走回柴郡猫那儿时，惊奇地看到一大群人围着它，刽子手、国王、王后正在激烈地辩论。他们同时说话，而旁边的人都静悄悄地呆着，看上去十分不安。 

爱丽丝刚到，这三个人就立即让她作裁判，他们争先恐后地同时向她重复自己的理由，爱丽丝很难听清楚他们说的是什么。 

刽子手的理由是：除非有身子，才能从身上砍头，光是一个头是没法砍掉的。他说他从来没做过这种事，这辈子也不打算做这样的事了。 

国王的理由是：只要有头，就能砍，你刽子手执行就行了，少说废话。王后的理由是：谁不立即执行她的命令，她就要把每个人的头都砍掉，周围的人的头也都砍掉（正是她最后这句话，使这些人都吓得要命）。 

爱丽丝想不出什么办法，只是说：“这猫是公爵夫人的，你们最好去问她。” 

“她在监狱里，”王后对刽子手说，“把她带来！”刽子手好像离弦的箭似的跑去了。 

就在刽子手走去的一刹那，猫头开始消失，刽子手带着公爵夫人来到时，猫头完全没有了。国王和刽子手就发疯似地跑来跑去到处找，而其他人又回去玩槌球了。 

第九章 素甲鱼的故事

“你不知道，能再见到你，我是多么高兴啊！亲爱的老朋友！”公爵夫人说着，很亲切地挽着爱丽丝的胳膊一起走。爱丽丝对公爵夫人有这样好的脾气非常高兴，她想以前在厨房里见到时，公爵夫人那么凶狠，主要是胡椒的缘故。 

爱丽丝对自己说（口气上不很有把握）：“要是我当了公爵夫人，我的厨房里连一点儿胡椒都不要，没有胡椒，汤也会做得非常好的。也许正是胡椒弄得人们脾气暴躁。”她对自己这个新发现非常高兴，就继续说：“是醋弄得人们酸溜溜的，黄菊把人们弄得那么涩，以及麦芽糖这类东西把孩子的脾气变得那么甜。我只希望人们懂得这些，那么他们就不会变得吝啬了。你知道……”爱丽丝想得出神，完全忘记了公爵夫人，当公爵夫人在她耳边说话时，她吃了一惊。“我亲爱的，你在想什么？竟忘了谈话！我现在没法告诉你这会引出什么教训，不过我马上就会想出来的，” 

“或许根本没什么教训。”爱丽丝鼓足勇气说，“得了，得了，小孩子，”公爵夫人说，“每件事者都会引出教训的，只要你能够找出来。”她一面说着，一面紧紧地靠着爱丽丝。 

爱丽丝很不喜欢她挨得那么紧，首先，公爵夫人十分难看；其次，她的高度正好把下巴顶在爱丽丝的肩膀上，而这是个叫人很不舒服的尖下巴。然而爱丽丝不愿意显得粗野，只得尽量地忍受着。 

“现在游戏进行得很好。”爱丽丝没话找话地说。 

“是的，”公爵夫人说，“这件事的教训是……‘啊，爱，爱是推动世界的动力！’” 

爱丽丝小声说：“有人说，这种动力是各人自扫门前雪。” 

“哦，它们的意思是一样的，”公爵夫人说着，使劲儿把尖下巴往爱丽丝的肩上压了压，“这个教训是 

‘只要当心思想，那么所说的话就会合平情理。’” 

“她多么喜欢在事情中寻找教训啊！”爱丽丝想。 

“我敢说，你在奇怪我为什么不搂你的腰，”沉寂一会后公爵夫人说，“这个原因是我害怕你的红鹤。我能试试看吗？” 

“它会咬人的。”爱丽丝小心地回答，一点也不愿意让她搂抱。 

“是的，”公爵夫人说，“红鹤和芥末都会咬人的，这个教训是：‘羽毛相同的鸟在一起。’” 

“可是芥末不是鸟。”爱丽丝说。 

“你可说到点子上了。”公爵夫人说。 

“我想它是矿物吧？”爱丽丝说。 

“当然是啦！”公爵夫人好像准备对爱丽丝说的每句话都表示同意，“这附近有个大芥末矿，这个教训是：‘我的多了，你的就少。’” 

“哦，我知道啦！”爱丽丝没注意她后一句，大声叫道，“它是一种植物，虽然看起来不像，不过就是植物。” 

“我十分同意你所说的，”公爵夫人说，“这里面的教训是：‘你看着像什么就是什么’；或者，你可以把这话说得简单点：‘永远不要把自己想象成和别人心目中的你不一样，因为你曾经或可能曾经在人们心目中是另外一个样子。’” 

“要是我把您的话记下来，我想我也许会更明白一点，’爱丽丝很有礼貌地说，“现在我可跟不上趟。” 

“我没什么？要是我愿意，我还能说得更长呢！”公爵夫人愉快地说。 

“哦，请不必麻烦您自己了。”爱丽丝说道。 

“说不上麻烦，”公爵夫人说，“我刚才说的每句话，都是送给你的一片礼物。” 

“这样的礼物可真便宜，”爱丽丝想，“幸好人家不是这么送生日礼物的。” 

“又在想什么了呢？”公爵夫人问道，她的小小的尖下巴顶得更紧了。 

“我有想的权利，”爱丽丝尖锐地回答道，因为她有点不耐烦了。 

“是的，”公爵夫人说道，“正像小猪有飞的权利一样。这里的教……” 

爱丽丝十分诧异，公爵夫人的声音突然消失了，甚至连她最爱说的“教训”也没说完。挽着爱丽丝的那只胳膊也颤抖起来了。爱丽丝抬起头来，发现王后站在她们面前，交叉着胳膊，脸色阴沉得像大雷雨前的天色一样。 

“天气真好呵，陛下。”公爵夫人用低而微弱的声音说。 

“现在我警告你！”王后跺着脚嚷道，“你要么滚开，要么把头砍下来滚开，你得立刻选一样，马上就选。”公爵夫人作出了她的选择，马上就走掉了。 

“现在咱们再去玩槌球吧。”王后对爱丽丝说。爱丽丝吓得不敢吭气，只得慢慢地跟着她回到槌球场。其他的客人趁王后不在，都跑到树荫下乘凉去了。他们一看到王后，立刻跳起来又玩槌球了。王后说，谁要是耽误一秒钟，就得付出生命的代价。 

整个槌球游戏进行中，王后不断地同别人吵嘴，嚷着“砍掉他的头”或“砍掉她的头”。被宣判的人，立刻就被士兵带去监禁起来。这样，执行命令的士兵就不能再回来做球门了。过了约莫半个小时，球场上已经没有一个球门了。除了国王王后和爱丽丝，所有参加槌球游戏的人，都被判了砍头监管起来了。 

于是，累得喘不过气的王后停了下来，对爱丽丝说：“你还没去看素甲鱼吧，” 

“没有，”爱丽丝说，“我还不知道素甲鱼是什么东西呢！” 

“不是有素甲鱼汤（英国菜中有素甲鱼汤，是用素有模制的甲负汤。如同中国的豆制品素鸡，名为素鸡，实则同鸡不相干的。）吗，”王后说，“那么当然有素甲鱼了。” 

“我从来没见过，也从来没听说过。”爱丽丝说。 

“那么咱们走吧，”王后说，“他会给你讲他的故事的。” 

当地们一起走开的时候，爱丽丝听到国王小声地对客人们说“你们都被赦免了。”爱丽丝想这倒是个好事。王后判了那么多人砍头，使她很难过。 

她们很快就碰见了一只鹰头狮，正晒着太阳睡觉呢（要是你不知道什么是鹰头狮，你可以看看画）。 

“快起来，懒家伙！”王后说道，“带这位年轻小姐去看素甲鱼，听他的故事。我还得检查我的命令执行得怎样了。”她说罢就走了，把爱丽丝留在鹰头狮那儿。爱丽丝不大喜欢这个动物的模样。但是她想，与其同那个野蛮的王后在一起，还不如跟它在一起来得安全，所以，她就留下来等候着。 

鹰头狮坐起来揉揉眼睛，瞧着王后，直到她走得看不见了，才笑了起来，“你笑什么？”爱丽丝回，“她呀，”鹰头狮说，“这全是她的想象，你知道，他们从来没有砍掉过别人的头。咱们走吧。”爱丽丝跟在后面走，心中想道：“这儿谁都对我说‘走吧’‘走吧’，我从来没有叫人这么支使过来，支使过去的。从来没有！” 

他们走了不远，就远远望见了那只素甲鱼，孤独而悲伤地坐在一块岩石的边缘上，当再走近一点时，爱丽丝听见它在叹息着，好像它的心都要碎了，她打心眼儿里同情它。“它有什么伤心事呢？”她这样间鹰头狮。鹰头狮还是用同刚才差不多的话回答：“这全是它的想象，你知道，它根本没有什么伤心事。走吧。” 

他们走近了素甲鱼，它用饱含着眼泪的大眼睛望着他们，可是一句话也不讲。 

“这位年轻小姐希望听听你的经历。”鹰头狮对票甲鱼说，“她真的这么希望。” 

“我很愿意告诉她。”素甲鱼用深沉的声音说，“你们都坐下，在我讲的时候别作声。” 

于是他们都坐了下来。有一阵子谁都不说话。爱丽丝想：“要是它不开始，怎么能结束呢？”但是她仍然耐心地等待着。 

后来，素甲鱼终于开口了，它深深地叹息了一声，说：“从前，我曾经是一只真正的甲鱼。”在这句话之后，又是一阵很长的沉默，只有鹰头狮偶尔叫一声：“啊，哈！”以及素甲鱼不断地沉重的抽泣。爱丽丝几乎要站起来说“谢谢你，先生，谢谢你的有趣的故事。”但是，她觉得还应该有下文，所以她仍然静静地坐着，什么话也不说。 

后来，素甲鱼又开口了。它已经平静多了，只不过仍然不时地抽泣一声。它说，“当我们小时候，我们都到海里的学校去上学。我们的老师是一只老甲鱼，我们都叫他胶鱼。” 

“既然他不是胶鱼，为什么要那么叫呢？”爱丽丝间。 

“我们叫他胶鱼，因为他教我们呀。”素甲鱼生气地说，“你真笨！” 

“这么简单的问题都要问，你真好意思，”鹰头狮说。于是他们俩就静静地坐在那里看着可怜的爱丽丝，使得她真想钻到地下去。最后，鹰头狮对素甲鱼说：“别介意了，老伙计，继续讲下去吧。” 

“是的，我们到海里的学校去，虽然说来你不相信……” 

“我没说过我不相信。”爱丽丝插嘴说。 

“你说了！”素甲鱼说。 

爱丽丝还没来得及答话，鹰头狮就喝了声“住口！”然后素甲鱼又讲了下去：“我们受的是最好的教育，事实上，我们每天都到学校去。” 

“我也是每天都上学，”爱丽丝说，“你没什么可得意的。” 

“你们也有副课吗？”素甲鱼有点不安地问道， 

“当然啦，”爱丽丝说，“我们学法文和音乐。” 

“有洗衣课吗？”素甲鱼问。 

“当然没有。”爱丽丝生气地说。 

“啊，那就算不上真正的好学校，”素甲鱼自信地说，并大为放心了，我们学校课程表的最后一项就是副课：法文、音乐、洗衣。” 

“既然你们住在海底，就不会太需要洗衣裳的。”爱丽丝说。 

“我不能学它，”素甲鱼叹了一声说，“我只学正课。” 

“正课是什么呢？”爱丽丝问道。 

“开始当然先学‘毒’和‘泻’，”素甲鱼回答说，“然后我们就学各门算术：假发、剪发、丑法、厨法。” 

“我从来没听说过什么‘丑法’，”爱丽丝大着胆子说，“这是什么？” 

鹰头狮惊奇地举起了爪子说：“你没听说过丑法！我想，你知道什么叫美法吧！” 

爱丽丝拿不准地说：“是的，那是……让什么……东西……变得好看些。” 

“那么，”鹰头狮继续说，“你不知道什么是丑法，真算得上是个傻瓜了。” 

爱丽丝不敢再谈论这个题目了，她转向素甲鱼问道：“你们还学些什么呢？” 

“我们还学栗柿，”素甲鱼丽着手指头说，“栗柿有古代栗柿和现代栗柿，还学地梨，还学灰花。我们的灰花老师是一条老鳗鱼，一星期来一次，教我们水菜花和素苗花。” 

“它们是什么样子的呢？”爱丽丝问道。 

“我没法做给你看，我太迟钝了。而鹰头狮又没学过。”素甲鱼说。 

“我没时间啊！”鹰头狮说，“不过我听过外语老师的课，它是一只老镑蟹，真的。” 

“我从来没听过它的课，”素甲鱼叹息着说，“他们说它教的是拉钉子和洗腊子。” 

“正是这样，正是这样，”鹰头狮也叹息了，于是他们两个都用爪子掩住了脸。 

“你们每天上多少课呢？”爱丽丝想换个话题，急忙地问。 

素甲鱼回答道：“第一天十小时，第二天九小时，这样下去。” 

“真奇怪啊。”爱丽丝叫道。 

“人们都说上‘多少课’，”素甲鱼解释说，“‘多少课’就是先多后少的意思。” 

这对爱丽丝可真是个新鲜事，她想了一会儿才接着说道：‘那么第十一天一定该休息了？” 

“当然啦！”素甲鱼说。 

“那么第十二天怎么办呢？”爱丽丝很关心地问， 

“上课的问题谈够了，”鹰头狮用坚决的口气插活说，“给她讲点关于游戏的事吧。” 

第十章 龙虾四组舞

素甲鱼深深地叹息着，用一只手背抹着眼泪，瞧着爱丽丝想说话，可是有好一阵子泣不成声。“好像他嗓子里卡了根骨头。”鹰头狮说。于是就摇它和拍它的背。终于素甲鱼能开口说话了，它一面流着眼泪，一面说：“你可能没在海底下住过很久。”（“从来没住过，”爱丽丝说）“你也许从来不认识龙虾吧！”（爱丽丝刚想说“我吃过……”，但立即改口，说“从来没有”），“所以你一点也想不到龙虾四组舞有多么好玩。” 

“是啊，”爱丽丝说，“那是一种什么舞呢？” 

鹰头狮说：“先是在海岸边站成一排……” 

“两排！”素甲鱼叫道，“海豹、乌龟和娃鱼都排好队。然后，把所有的水母都清扫掉……” 

“这常常得费一阵工夫呢！”鹰头狮插嘴说， 

“然后，向前进两步……” 

“每个都有一只龙虾作舞伴！”鹰头狮叫道。 

“当然啦，”素甲鱼说道，“向前进两步，组好舞伴……” 

“再交换舞伴，向后退两步。”鹰头狮接着说。 

素甲鱼说：“然后你就把龙虾……” 

“扔出去！”鹰头狮蹦起来嚷道。 

“尽你的力把它远远地扔到海里去。” 

“再游着水去追它们。”鹰头狮尖声叫道。 

“在海里翻一个筋斗！”素甲鱼叫道，它发疯似地跳来跳去。 

“再交换龙虾！”鹰头狮用最高的嗓门嚷叫。 

“再回到陆地上，再……这就是舞的第一节。”素甲鱼说。它的声音突然低了下来。于是，这两个刚才像疯子似的跳来跳去的动物，又坐了下来，非常安静而又悲伤地瞧着爱丽丝。 

“那一定是挺好看的舞。”爱丽丝胆怯地说， 

“你想看一看吗？”素甲鱼问。 

“很想看。”爱丽丝说。 

“咱们来跳跳第一节吧，”素甲鱼对鹰头狮说道，“你知道，咱们没有龙虾也行。不过谁来唱呢？” 

“啊，你唱，”鹰头狮说，“我忘了歌词了。” 

于是他们庄严地围着爱丽丝跳起舞来，一面用前爪拍着拍子。当他们跳到跟前的时候，常常要踩着爱丽丝的脚。素甲鱼缓慢而悲伤地唱道： 

“鳕鱼对蜗牛说： 

‘你不能走得快点吗， 

一只海豚正跟在我们后面， 

它常常踩着我的尾巴。 

你瞧龙虾和乌龟多么匆忙， 

海滩舞会马上开始啦！ 

你愿意去跳舞吗？ 

你愿去，你要去，你愿去，你要去， 

你愿去跳舞吗， 

你愿去，你要去，你愿去，你要去， 

你要去跳舞吗？’ 

你真不知道那有多么好玩， 

我们和龙虾一道被扔得老远。’ 

‘太远啦，太远啦。’蜗牛斜了一眼回答。 

它说谢谢鳕鱼， 

但它不愿把舞会参加。 

它不愿，它不能，它不愿，它不能， 

它不愿把舞会参加。 

它不愿，它不能，它不愿，它不能， 

它不能把舞会参加。 

它的有鳞的朋友回答： 

‘扔得远又有什么相干？ 

你要知道，在大海那边， 

还有另一个海岸。 

如果你更远地离开英格兰， 

就会更加接近法兰西。 

亲爱的蜗牛，不要害怕， 

赶快去把舞会参加。 

你不愿，你可要，你可愿，你可要， 

你可愿把舞会参加？ 

你不愿，你可要，你可愿，你可要， 

你可要把舞会参加？’” 

“谢谢你，我组舞真好玩，”爱丽丝说，她很高兴它终于结束了，“我很喜欢这支奇怪的关于鳕鱼的歌。” 

素甲鱼说：“哦，说到鳕鱼，它们……你当然看见过它们啦？” 

“是的，”爱丽丝回答，“在饭……”，她想说在饭桌上，但是急忙停住了。 

“我不知道‘饭’是什么地方，”素甲鱼说，“不过，如果你常常看见它们，你当然知道它们的样子了。” 

“我想我知道，”爱丽丝思索着说，“它们把尾巴弯到嘴里，身上撒满了面包屑（这是西菜中烧好的鳕鱼的样子。）。” 

“面包屑？你可说错了！”素甲鱼说，“海水会把面包屑冲掉的。不过它们倒真是把尾巴弯到嘴里的。这个缘故是……”说到这里，素甲鱼打个哈欠，合上了眼。“告诉她这是什么缘故。”它对鹰头狮说。 

鹰头狮说，“这是因为它们同龙虾一道参加舞会，于是，它们就从海里被扔出去了，于是，它们落得老远，于是，它们就把尾巴塞到嘴里去了，于是，它们没法把尾巴弄出来了。就是这些。” 

“谢谢你，”爱丽丝说，“真有意思，我以前不知道这么多的关于鳕鱼的故事。” 

“如果你愿意，我还可以告诉你更多哩！”鹰头狮说，“你知道为什么叫鳕鱼吗？” 

“我没想过，”爱丽丝说，“为什么？” 

“它是擦靴子和鞋子的。”鹰头狮严肃地说。 

爱丽丝感到迷惑不解。“擦靴子和鞋子？”她诧异地问。 

“是的，你的鞋用什么擦的？”鹰头狮说，“我的意思是，你用什么把鞋子擦得那么亮？” 

爱丽丝看了下自己的鞋子，想了一下说：“我用的黑鞋油。” 

“靴子和鞋子在海里，要白得发亮，”鹰头狮说，“你知道，是用鳕鱼的雪擦亮的。” 

“鳕鱼的雪是由什么做成的呢？”爱丽丝好奇地问。 

“当然是鳊鱼和鳗鱼啦！”鹰头狮很不耐烦地回答，“就是小虾也会这样告诉你的。” 

“如果我是鳕鱼，”爱丽丝说，脑子里还想着那首歌，“我会对海豚说“远一点，我们不要你同我们在一起！’” 

“它们不得不要海豚，”素甲鱼说，“没有一种聪明的鱼外出旅行时，不要海豚的。” 

“真的吗？”爱丽丝惊奇地说。 

“可不是，”素甲鱼说，“如果有鱼外出旅行，来告诉我，我就会说‘哪个海豚去’” 

“你说什么‘孩童’？”爱丽丝说。 

“我知道我说的意思，”素甲鱼生气地回答。鹰头狮接着说：“让我们听听关于你的故事吧。” 

“我可以告诉你们我的故事——从今天早晨开始，”爱丽丝有点胆怯地说，“咱们不必从昨天开始，因为从那以后，我已经变成另一个人啦。” 

“你解释解释。”素甲鱼说。 

“不，不！先讲故事，后解释。”鹰头狮不耐烦地说，“解释太耽误功夫了。” 

于是，爱丽丝讲她的故事了，她从瞧见那只白兔讲起，在刚开始的时候，她还有点不安——那两个动物坐得离她那么近，一边一个，眼睛和嘴又睁得那么大。但是她逐渐胆大起来了，她的两个听众安静地听着。’”直到她讲到给毛毛虫背《你老了，威廉爸爸》，背出来的字眼全不对的时候，素甲鱼深深地吸了一口气，说道：“这非常奇怪。” 

“怪得没法再怪啦。”鹰头狮说。 

“这首诗全背错啦，”素甲鱼沉思着重复说，“我想再听听她背诵点什么东西，让她开始吧。”他看看鹰头狮，好像鹰头狮对爱丽丝有什么权威似的。 

“站起来背《那是懒蛋的声音》。”鹰头狮说。 

“些动物老是那么喜欢命令人，老让人背书，”爱丽丝想，“我还不如马上回学校去呢。然而，她还是站起来背了。可是她脑子里仍然充满龙虾四组舞的事，简直不知道自己在说些什么。她背出来的东西确实非常奇怪： 

“那是龙虾的声音， 

我听见它在讲—— 

‘你们把我烤得太黄， 

我头发里还得加点糖。’ 

它用自己的鼻子， 

正像鸭子用自己的眼睑一样， 

整理自己的腰带和钮扣， 

还把脚吐向外扭转。 

当沙滩干燥的时候， 

它就像云雀一样喜欢。 

它洋洋得意地同鲨鱼攀谈， 

但是当潮水上涨，鲨鱼把它包围， 

它的声音就变得胆怯而又抖颤！” 

“这同我小时候背的完全不一样。”鹰头狮说。 

“我以前从来没听过，”素甲鱼说，“可是听起来尽是些傻话。” 

爱丽丝什么话也没说，她又坐了下来，双手掩住了脸，不知道什么时候才会恢复正常。 

“我希望她解释一下。”素甲鱼说。 

“她解释不了，”鹰头狮急忙说，“背下一段吧。” 

“但是关于脚趾是怎么回事？”素甲鱼坚持说，“它怎么能用自己的鼻子扭转它们呢？” 

“那是跳舞的第一个姿势，”爱丽丝说。可是她被这一切弄得莫名其妙，所以非常希望换一个话题。 

“背第二节，”鹰头狮不耐烦地说，“开头是‘我经过她的花园’。” 

爱丽丝不敢违背，虽然她明知道一切都会弄错的。她用发抖的声音背道： 

“我经过她的花园， 

并且用一只眼睛看见， 

豹子和猫头鹰， 

正在把馅饼分餐。 

豹子分到了外皮、肉汁和肉馅， 

猫头鹰只分到了一个空盘。 

在馅饼吃完以后， 

豹子仁慈地答应猫头鹰， 

把汤匙放它衣袋里作为礼物。 

而豹子自己发出一声怒吼， 

把刀子和叉子通通拿走。 

在宴会的最后， 

它还……” 

这时素甲鱼插嘴说道：“要是你不能一边背一边解释，那么背这些胡说八道的东西有什么用？这是我听到过的最乱七八糟的东西了。 

“你最好停下来吧！”鹰头狮说。爱丽丝实在太愿意这么办了。 

“我们再跳一节龙虾四组舞好吗？”鹰头狮继续说，“或者，你愿意听素甲鱼给你唱支歌吗？” 

“啊，请来一支歌吧，要是素甲鱼愿意的话。”爱丽丝说得那么热情，使得鹰头狮用不高兴的口气说：“趣味太低了。老伙计，那你就给她唱支‘甲鱼汤’，好吗？” 

素甲鱼深深地叹了一口气，用一种经常被抽泣打断的声音唱道： 

“美味的汤， 

在热气腾腾的盖碗里装。 

绿色的浓汤， 

谁不愿意尝一尝， 

这样的好汤。 

晚餐用的汤，美味的汤， 

晚餐用的汤，美味的汤， 

美……味的汤……汤！ 

美……味的汤……汤！ 

晚……晚……晚餐用的……汤， 

美味的，美味的汤！ 

“美味的汤！ 

有了它，谁还会再把鱼想， 

再想把野味和别的菜来尝？ 

谁不最想尝一尝， 

两便士（先令和便士是英国的货币单位，十二便士为一先令，二十先令为一英镑。）一碗的好汤？ 

两便士一碗的好汤？ 

美……味的汤……汤！ 

美……味的汤……汤！ 

晚……晚……晚餐用的汤……汤， 

美味的，美……味的汤！” 

“再来一遍合唱！”鹰头狮叫道。素甲鱼刚要开口，就听到远处叫道“审讯开始啦！”“走吧！”鹰头狮叫道，它拉住了爱丽丝的手，也不等那支歌唱完，急忙跑了。“什么审讯呀？”爱丽丝一面跑一面喘着气问，但是鹰头狮只是说“走吧”。他跑得更快了。微风送来了越来越微弱的单调的歌词：“晚……晚……晚餐用的汤……汤，美味的、美味的汤！” 

第十一章 谁偷走了馅饼

当他们到达时，红心国王和红心王后正坐在王座上，还有一大群各种小鸟兽围着他们，就像一整套纸牌。那个武士站在他们面前，用链条锁着，两边各有一名士兵看守着。国王旁边站着白兔，一手拿着喇叭，一手拿着一卷羊皮纸。法庭正中有一张桌子，上面放着一大盘馅饼。馅饼十分精美，爱丽丝见了顿时觉得饿得慌。爱丽丝想：“希望审判能快些结束，然后让大家吃点心。”但是，看来并没有这种迹象。于是，她只好环视周围的一切来消磨时光。 

爱丽丝还没有到过法庭，只在书上读到过。她很高兴的是对这里的一切都能说得上。“那是法官，”她对自己说，“因为他有假发。” 

该说一下，那位法官就是国王。由于他在假发上又戴上王冠，看起来很不顺眼，而且肯定也不会舒服的。 

“那是陪审员席，”爱丽丝心想，“那十二个动物”（她不得不称之为“动物”，因为有的是兽类，有的是鸟类），“该是陪审员了。”这最后一句，她对自己说了两三遍，觉得挺自豪的。因为她想，几乎没有像她那样年龄的女孩，会懂得这么多的。即使说“法律审查员”她们也不会懂的。 

十二位陪审员全都在纸板上忙着写什么。“他们在干什么？”爱丽丝对鹰头狮低声说，“在审判开始前，他们不会有任何事情要记录的，” 

鹰头狮低声回答：“他们在记下姓名，怕在审判结束前忘掉。” 

“蠢家伙！”爱丽丝不满地高声说，但她立刻就不说话了，因为白兔喊着：“法庭肃静。”这时，国王戴上了眼镜，迅速地扫视了四周，想找出谁在说瓜。 

爱丽丝就像趴在陪审员肩头上看到的那样清楚，看到所有的陪审员都在纸板上写下了“蠢家伙”。她甚至还看到有个陪审员不会写“蠢”字，要求邻座的告诉他。“不到审判结束，他们的纸板准会写得一塌糊涂！”爱丽丝想。 

有一名陪审员在书写时发出刺耳的市音，爱丽丝当然经受不住了，于是，她在法庭里转了一圈，到他的背后，找了个机会—下子夺走了那支铅笔。她干得很利索，那个可怜的小陪审员（它就是壁虎比尔）根本不知道发生了什么事。当它到处找不到自己的铅笔后，就只能用手指头来书写了。这当然毫无用处，因为手指在纸板上留不下任何痕迹。 

“传令官，宣读起诉书。”国王宣布说。 

白兔在喇叭上吹了三下，然后摊开那卷羊皮纸，宣读如下： 

“红心王后做了馅饼， 

夏日的白天竟发生这样的事情： 

红心武士偷走了馅饼， 

全都带走匆忙离境！” 

“请考虑你们的评审意见。”国王对陪审员说。 

“不行，还不行！”兔子赶快插话说，“还有好些过程呢！” 

于是，国王说：“传第一个作证人。”白兔在喇叭上吹了三下，喊道：“传第一个证人！” 

第一个证人就是那位帽匠。他进来时，一手拿着一只茶杯，一手拿着一片奶油面包。他说：“陛下，请原谅我带这些来，因为我还没吃完茶点就被传来了。” 

“你应该吃完的。你什么时候开始吃的？”国王间。 

帽匠看了看三月兔——三月兔是同睡鼠手挽着手跟着他进来的——说：“我想是三月十四日开始吃的。” 

“是十五日。”三月兔说。 

“十六日。”睡鼠补充说。 

“记下来。”国王对陪审员说，陪审员急忙在纸板上写下了这三个日期，然后把它们加起来，再把半数折算成先令和便士。 

“摘掉你的帽子！”国王对帽匠说。 

“那不是我的。”帽匠说。 

“偷的！”国王叫了起来，并看了看陪审员。陪审员立即记下，作为事实备忘录。 

“我拿帽子来卖的，我是个帽匠，没有一顶帽子属于我的。”帽匠解释道。 

这时，王后戴上了眼镜，使劲儿盯着帽匠，只见帽匠脸色发白，局促不安。 

“拿出证据来，”国王说，“并且不得紧张，否则，我就把你拿到场上处决。” 

这些话根本没有鼓励作证人。他不断地把两脚交替着站，不自在地看着王后，而且由于心里慌乱，竟在茶杯上咬了一大口，而不是去吃奶油面包。 

正在这时，爱丽丝有一种奇怪的感觉，她迷惑了好一会，后来才慢慢地搞清楚，原来她又在长大了，起初，她想站起来走出法庭，但转眼间她又决定留下了，只要这里还有她容身的余地。 

“我希望你不要挤我，我透不过气来了。”坐在爱丽丝旁边的睡鼠说。 

“我作不了主呀，你看我还在长呢！”爱丽丝非常温和地说。 

“在这里你没有权利长呀！”睡鼠说。 

“别说废话了，你自己也在长呀！”爱丽丝大胆地说。 

“是的，但是我是合理地生长，不是长成可笑的样子，”睡鼠说着，不高兴地站了起来，转到法庭的另一边去了。 

在爱丽丝和睡鼠说话的时候，王后的眼睛始终盯着帽匠，当睡鼠转到法庭的那边，她就对一位官员说：“把上次音乐会上唱歌人的名单给我，”听到这话，这个可怜的帽匠吓得发抖，甚至把两只鞋子也抖了下来。 

“拿出证据来，否则，我就处决你，不管你紧张不紧张！”国王愤怒地重复了一遍。 

“我是个穷人，陛下，”帽匠颤抖着说，“我只是刚刚开始吃茶点……没有超过一星期……再说为什么奶油面包变得这么薄呢……还有茶会闪光……” 

“什么闪光？”国王问。 

“我说茶。”帽匠回答。 

“哦，擦，当然，擦火柴是闪光的。你以为我是笨蛋吗？接着说！”国王尖锐地指出。 

“我是个穷人，”帽匠继续说，“从那以后，大部分东西都闪光了……只有三月兔说……” 

三月兔赶快插嘴：“我没说过。” 

“你说了。”彻匠说。 

“我没说。”三月兔说。 

“它既然不承认，就谈点别的吧！”国王说。 

“好，无论如何，那就睡鼠来说……”说到这否认。然而睡鼠什么也没说，它睡得正香呢。 

“从那以后，我切了更多的奶油面包……”帽匠继续说。 

“但是睡鼠说了什么？”一位陪审员问。 

“这个我记不得了。”帽匠说。 

“你必须记得，否则我就处决你。”国王说。 

那个可怜的帽匠丢掉了茶杯、奶油面包，单膝跪下说，“我是个可怜人，陛下。” 

“你是个可怜的狡辩者。”国王说。 

这时，一只豚鼠突然喝起彩来，但立即被法庭上的官员制止了。（所谓制止，实在很难说，我只能向你说说是怎么回事。他们用一只大帆布袋，把那只胆鼠头朝里塞进去，用绳扎上了袋口，然后他们坐在袋上。） 

爱丽丝心里想：“我很高兴能看到了这回事。我常常在报上看到，说审判结束时“出现了喝彩声，当即被法庭上的官员所制止。’直到现在我才明白是怎么回事。” 

“如果你再没有别的补充，你可以退下去了。”国王宣布说。 

“我已经没法再退了，我已经是站在地板上的了。”帽匠说。 

“那么你可以坐下。”国王说。 

这时，又一只豚鼠喝起彩来，又被制止了。 

爱丽丝心里想：“嗳，他们这样收拾豚鼠！实在应该文明一些。” 

“我还得喝完这杯茶。”帽匠说着，不安地看着王后，而王后正在看唱歌人的名单。 

“你可以走了。”国王一说，帽匠立即跑出法庭。甚至顾不上去穿他的鞋。 

这进，王后吩咐一位官员说：“立即将那帽匠在庭外斩首。”可是官员追到大门口，帽匠已经无影无踪了。 

“传下一个作证人！”国王吩咐。 

下一个作证人是公爵夫人的厨师。她手里带着胡椒盒，一走进法庭，就使靠近她的人不停地打喷嚏，这使爱丽丝一下就猜出是谁了。 

“提供你的证据。”国王吩咐。 

“我不能提供。”厨师回答。 

国王着急地看了看白兔，白兔低声说：“陛下必须反复质询这个证人。” 

“好，如果必须这样，我必定这样做。”国王带着优郁的神态说。然后他交叉着双臂，对厨师蹙着眉，直到视野模糊了，才用深沉的声音说：“馅饼是用什么做的？” 

“大部分是胡椒，”厨师说， 

“糖浆。”一个困倦的声音从厨师后面传来。 

“掐住那个睡鼠的脖子，”王后尖叫起来，“把它斩首，把它撵出法庭，制止它，掐死它，拔掉它的络腮胡子！” 

整个法庭完全混乱了好几分钟。把睡鼠赶出去以后，大家才再次坐下来，这时厨师失踪了。 

“没关系！”国王坦然地说，“传下一个作证人。”然后他对王后耳语说：“真的，亲爱的，下一个作证人必须你来审讯了，我已经头疼得无法忍受了。” 

爱丽丝看到白兔摆弄着名单，非常好奇，想看看下一个作证人是谁。她想：“恐怕他们还没有收集到足够的证据。”使她大吃一惊的是：当白兔用刺耳的嗓音尖叫出来时，竟是“爱丽丝！” 

第十二章 爱丽丝的证明

“在这儿！”爱丽丝喊道，她完全忘了在刚才的混乱时刻，她已经长得很大了。她过于急促地站起来，竟弄得裙边掀动了陪审员席，把陪审员们翻倒在下面听众的头上，害得他们在人头上爬来爬去，这情景使爱丽丝想起一星期前她偶然打翻金鱼缸的事。 

“啊，请大家原谅！”爱丽丝极其尴尬地说，一面尽快地把陪审员们扶回原位，因为对金鱼缸的事情的回忆还在她头脑回旋，使她隐约地意识到如果不立即把陪审员放回席位上，它们会死去的， 

这时，国王庄重地宣称：“审讯暂停，直至全体陪审员返回原位。”他说得那么使劲儿，眼睛严厉地盯着爱丽丝。 

爱丽丝看着陪审员席，发现由于自己的疏忽，竟将壁虎头朝下放上了。那个可怜的小东西无力动弹，只是滑稽地摇摆着尾巴。爱丽丝立即把它拾起来放正。爱丽丝想，“如果没有重大变故，壁虎还会同其它陪审员一样，发挥重大作用的。” 

等到陪审员们镇定下来，纸板和铅笔也都找到了以后，它们立即勤奋地工作起来了。首先是记下刚才事故的历史。只有壁虎除外，它已经精疲力尽，不能干任何事情了，只是张着嘴坐着，两眼无力地望着法庭的屋顶。 

国王开口了：“你对这个案子知道些什么？” 

“什么也不知道。”爱丽丝回答。 

“任何事也不知道？”国王再问。 

“任何事也不知道。”爱丽丝答。 

“这点很重要。”国王对陪审员们说。 

陪审员们正在把这些问答记在纸板上，白兔忽然插嘴说：“陛下的意思当然是不重要。”它用十分尊敬的口气，同时对国王挤眉弄眼的。 

国王赶快把话接过来：“当然，我的意思是不重要。”接着又低声亩语，“重要……不重要……不重要……重要”——好像在反复推敲词句。 

有些陪审员记下了“重要”，有些写了“不重要”。爱丽丝离陪审员们很近，它们在纸板上记的字她都看得一清二楚。心想：“反正怎么写都没关系。” 

国王一直忙着在记事本上写什么？这时他高声喊道：“保持肃静！”然后他看着本子宣读：“第四十二条，所有身高一英里以上者退出法庭。” 

大家都望着爱丽丝。 

“我不到一英里高。”爱丽丝说， 

“将近两英里了。”王后插话说。 

“你够了。”国王又说， 

“不管怎么说，我反正不走，”爱丽丝说，“再说，那根本不是一条正式规定，是你在这儿临时发明出来的。” 

“这是书里最老的一条规定。”国王说。 

“那么这应该是第一条呀。”爱丽丝说。 

国王脸色苍白，急忙合上了本子，他以发抖的声调低声对陪审美说：“请考虑评审意见。” 

“陛下，好了，又发现新的证据了。”白兔急忙跳起来说，“这是才拾到的一张纸。” 

“里面说什么？”王后问。 

白兔回答：“我还没打开来呢？但是看来是一封信，是那个罪犯写给……给一个什么人的。” 

“肯定是这样，”国王说，“除非它不是写给任何人的，而这不合情理。” 

“信写给谁的？”一个陪审员问。 

“它不是写给谁的，事实上，外面什么也没写，”白兔一面说，一面打开摺叠的纸，又说，“根本不是信，而是一首诗。” 

“是那罪犯的笔迹吗？”另一个陪审员问。 

“不是的，这真是奇怪的事。”白兔说。这时陪审员全都感到莫名其妙。 

“一定是他模仿了别人的笔迹。”国王这么一说，陪审员全都醒悟过来了。 

这时，武士开口了：“陛下，这不是我写的，他们也不能证实是我写的。末尾并没有签名。” 

“如果你没有签名，”国玉说，“只能说明情节更恶劣。这意味着你的狡猾，否则你就应该像一个诚实的人那样，签上你的名字。” 

对此，出现了一片掌声。这真是那天国王所讲的第一句聪明话。 

“那就证明了他犯罪。”王后说。 

爱丽丝却说：“这证明不了什么！啊，你们甚至不知道这首诗写的是什么呀！” 

“快读一读！”国王命令道。 

白兔戴上了眼镜，问道，“我该从哪儿开始呢？陛下。” 

“从开始的地方开始吧，一直读到末尾，然后停止。”国王郑重地说。 

下面就是白兔所读的诗句： 

“他们说你先是对她， 

后又对他谈到了我。 

她给我良好的赞誉， 

但却说我不会游水。 

“他捎话说我没有前往， 

我们知道这并非撒谎。 

假如她竟然把事情推进， 

你又当处于何种景况？ 

我给她一个，他们给他一双， 

你给我们三个或者两双， 

它们都从他那里归于你方， 

反正从前都是我的，一样一样。 

“假如我或她竟然会 

掉进这个是非漩涡， 

他请你解除他的冤枉， 

就如我们早先的期望。 

“我的想法就是你的那样， 

也就是她有过的诗章， 

你在他和我们之间， 

早已成了难越的屏障。 

“切勿告诉他：她最喜欢他们， 

这必须永远是个秘密。 

也切勿告诉其他人， 

只在你我之间。” 

“这是我们听到的最重要的证据了，”国王擦着手说，“现在请陪审员……” 

“如果有谁能解释这些诗，我愿意给他六十便士，我认为这些诗没有任何意义。”爱丽丝这么说。（就在刚才的那一瞬间，她已经长得十分巨大，所以她一点也不怕打断国王的话。） 

陪审员都在纸板上写下：“她相信这些诗没有任何意义。”但是他们中没有一个试图解释一下这些诗。 

“如果诗里没有任何意义，”国王说，“那就免除了许多麻烦。你知道，我们并不要找出什么意义，而且我也不懂什么意义。”国王说着，把这些诗摊开在膝上，用一只眼睛看着说，“我终于明白了其中的一些意义——‘说我不会游水’一—就是说你不会游水，是吗，”国王对着武士说。 

武士伤心地摇摇头说：“我像会游水的吗？”（他肯定不会游水的，因为他全部是由硬纸片做成的。） 

“现在全对了，”国王说，一面又继续嘟嚷着这些诗句：“我们知道这并非撒谎’——这当然是指陪审员的——‘我给她一个，他们给他一双’——看，这肯定是指偷的馅饼了，是吗？……” 

“但后面说‘它们都从他那里归于你方。’”爱丽丝说。 

“是啊，它们都在，没有比这更清楚的了。”国王手指着桌上的馅饼，得意地说，“那么再看：‘也就是她有过的诗章，’亲爱的，我想你没有过诗章吧？”他对王后说。 

“从来没有！”王后狂怒着说，并把桌上的墨水缸扔到了壁虎比尔的身上。那个不幸的比尔已经不再用手指在纸板上写字了，因为他发现这样是写不出宇来的。但是现在他又急忙蘸着脸上的墨水写了。 

“这话没有湿胀（‘诗章’的谐音一—译者注）你吧！”国王带着微笑环视着法庭说。但是法庭上一片寂静。 

“这算一句俏皮话吧！”国王发怒了，而大家却笑了起来。“让陪审员考虑评审意见。”国王这天人约是第二十次说这话了。 

“不，不，”王后说，“应该先判决，后评审。” 

“愚蠢的废话，竟然先判决！”爱丽丝大声说。 

“住嘴！”王后气得脸色都发紫了。 

“我偏不！”艾丽丝毫不示弱地回答。 

“砍掉她的头！”王后声嘶力竭地喊道。但是没有一个人动一动。 

“谁理你呢？”爱丽丝说，这时她已经恢复到本来的身材了，“你们只不过是一副纸牌！” 

这时，整副纸牌上升到空中，然后又飞落在她身上，她发出一小声尖叫，既惊又怒，她正在把这些纸牌扬去，却发觉自己躺在河岸边，头还枕在姐姐的腿上，而姐姐正在轻轻地拿掉落在她脸上的枯叶。 

“醒醒吧，亲爱的爱丽丝，”她姐姐说，“看，你睡了多久啦！” 

“啊，我做了个多奇怪的梦啊！”爱丽丝尽她所记忆的，把那些奇怪的经历，告诉了姐姐。也就是你刚才读过的那些。当她说完了，姐姐吻了她一下说：“这真是奇怪的梦，亲爱的，但是现在快去喝茶吧，天已经不早了。”于是爱丽丝站起来走了，一面走，一面还费劲地想，她做了个多奇妙的梦呀！爱丽丝走后，她姐姐仍静坐在那里，头向前支在一只手上，望着西下的夕阳，想着小爱丽丝和她梦中的奇幻经历，然后自己进人了梦乡。下面就是她的梦。 

开始，她梦见了小爱丽丝本人，又一次双手抱住了膝盖，用明亮而热切的眼光仰视着她。她听到小爱丽丝的声音，看到了她的头微微一摆，把蓬乱的头发摆顺了些，这是她常常见到的情景。当她听着、听着爱丽丝说的话时，周围的环境随着她小妹妹梦中的那些奇异动物的降临而活跃起来了。 

白兔跳来蹦去，弄得她脚下的洞草沙沙作响，受惊的老鼠在邻近的洞穴间穿来穿去，不时扬起一股尘土。她还听到三月兔同它的朋友们共享着没完没了的美餐时碰击茶杯的声音，以及王后命令处决她的不幸客人的尖叫声。同时也听到猪孩子在公爵夫人腿上打喷嚏，以及盘碗的摔碎声。甚至听到鹰头狮的尖叫，壁虎写字时的沙沙声，被制裁的豚鼠的挣扎声等等。这种种声音充满了空间，还混杂着远处传来的素甲鱼那悲哀的抽泣声。 

于是她将身子坐正，闭着眼睛，半信半疑自己真的到了奇境世界。尽管她知道只是重温一个旧梦，而一切都仍会返回现实：蒿草只是迎风作响，池水的波纹摆动了芦苇。茶杯的碰击声实际是羊颈上的铃铛声，王后的尖叫起源于牧童的吃喝。猪孩子的喷嚏声，鹰头狮的尖叫声和各种奇声怪音，原来只是农村中繁忙季节的各种喧闹声。而远处耕牛的低吟，在梦中变成素甲鱼的哀泣。 

最后，她想像了这样的情景：她的这位小妹妹，以后将成为一位妇女。而她将会毕生保留着童年时的纯洁珍爱之心。她还会逗引孩童们，用许多奇异的故事，或许就是许久以前的这个梦游奇境，使得他们眼睛变得更加明亮热切。她也将共享儿童们纯洁的烦恼，因为这些烦恼就存在于她自己的童年，以及那愉快的夏日回忆之中。 
              THE END
EOT;

    /*
    End of Project Gutenberg's Alice's Adventures in Wonderland, by Lewis Carroll

    *** END OF THIS PROJECT GUTENBERG EBOOK ALICE'S ADVENTURES IN WONDERLAND ***

    ***** This file should be named 11.txt or 11.zip *****
    This and all associated files of various formats will be found in:
            http://www.gutenberg.org/1/11/

    Updated editions will replace the previous one--the old editions
    will be renamed.

    Creating the works from public domain print editions means that no
    one owns a United States copyright in these works, so the Foundation
    (and you!) can copy and distribute it in the United States without
    permission and without paying copyright royalties.  Special rules,
    set forth in the General Terms of Use part of this license, apply to
    copying and distributing Project Gutenberg-tm electronic works to
    protect the PROJECT GUTENBERG-tm concept and trademark.  Project
    Gutenberg is a registered trademark, and may not be used if you
    charge for the eBooks, unless you receive specific permission.  If you
    do not charge anything for copies of this eBook, complying with the
    rules is very easy.  You may use this eBook for nearly any purpose
    such as creation of derivative works, reports, performances and
    research.  They may be modified and printed and given away--you may do
    practically ANYTHING with public domain eBooks.  Redistribution is
    subject to the trademark license, especially commercial
    redistribution.

    *** START: FULL LICENSE ***

    THE FULL PROJECT GUTENBERG LICENSE
    PLEASE READ THIS BEFORE YOU DISTRIBUTE OR USE THIS WORK

    To protect the Project Gutenberg-tm mission of promoting the free
    distribution of electronic works, by using or distributing this work
    (or any other work associated in any way with the phrase "Project
    Gutenberg"), you agree to comply with all the terms of the Full Project
    Gutenberg-tm License (available with this file or online at
    http://gutenberg.org/license).

    Section 1.  General Terms of Use and Redistributing Project Gutenberg-tm
    electronic works

    1.A.  By reading or using any part of this Project Gutenberg-tm
    electronic work, you indicate that you have read, understand, agree to
    and accept all the terms of this license and intellectual property
    (trademark/copyright) agreement.  If you do not agree to abide by all
    the terms of this agreement, you must cease using and return or destroy
    all copies of Project Gutenberg-tm electronic works in your possession.
    If you paid a fee for obtaining a copy of or access to a Project
    Gutenberg-tm electronic work and you do not agree to be bound by the
    terms of this agreement, you may obtain a refund from the person or
    entity to whom you paid the fee as set forth in paragraph 1.E.8.

    1.B.  "Project Gutenberg" is a registered trademark.  It may only be
    used on or associated in any way with an electronic work by people who
    agree to be bound by the terms of this agreement.  There are a few
    things that you can do with most Project Gutenberg-tm electronic works
    even without complying with the full terms of this agreement.  See
    paragraph 1.C below.  There are a lot of things you can do with Project
    Gutenberg-tm electronic works if you follow the terms of this agreement
    and help preserve free future access to Project Gutenberg-tm electronic
    works.  See paragraph 1.E below.

    1.C.  The Project Gutenberg Literary Archive Foundation ("the Foundation"
    or PGLAF), owns a compilation copyright in the collection of Project
    Gutenberg-tm electronic works.  Nearly all the individual works in the
    collection are in the public domain in the United States.  If an
    individual work is in the public domain in the United States and you are
    located in the United States, we do not claim a right to prevent you from
    copying, distributing, performing, displaying or creating derivative
    works based on the work as long as all references to Project Gutenberg
    are removed.  Of course, we hope that you will support the Project
    Gutenberg-tm mission of promoting free access to electronic works by
    freely sharing Project Gutenberg-tm works in compliance with the terms of
    this agreement for keeping the Project Gutenberg-tm name associated with
    the work.  You can easily comply with the terms of this agreement by
    keeping this work in the same format with its attached full Project
    Gutenberg-tm License when you share it without charge with others.

    1.D.  The copyright laws of the place where you are located also govern
    what you can do with this work.  Copyright laws in most countries are in
    a constant state of change.  If you are outside the United States, check
    the laws of your country in addition to the terms of this agreement
    before downloading, copying, displaying, performing, distributing or
    creating derivative works based on this work or any other Project
    Gutenberg-tm work.  The Foundation makes no representations concerning
    the copyright status of any work in any country outside the United
    States.

    1.E.  Unless you have removed all references to Project Gutenberg:

    1.E.1.  The following sentence, with active links to, or other immediate
    access to, the full Project Gutenberg-tm License must appear prominently
    whenever any copy of a Project Gutenberg-tm work (any work on which the
    phrase "Project Gutenberg" appears, or with which the phrase "Project
    Gutenberg" is associated) is accessed, displayed, performed, viewed,
    copied or distributed:

    This eBook is for the use of anyone anywhere at no cost and with
    almost no restrictions whatsoever.  You may copy it, give it away or
    re-use it under the terms of the Project Gutenberg License included
    with this eBook or online at www.gutenberg.org

    1.E.2.  If an individual Project Gutenberg-tm electronic work is derived
    from the public domain (does not contain a notice indicating that it is
    posted with permission of the copyright holder), the work can be copied
    and distributed to anyone in the United States without paying any fees
    or charges.  If you are redistributing or providing access to a work
    with the phrase "Project Gutenberg" associated with or appearing on the
    work, you must comply either with the requirements of paragraphs 1.E.1
    through 1.E.7 or obtain permission for the use of the work and the
    Project Gutenberg-tm trademark as set forth in paragraphs 1.E.8 or
    1.E.9.

    1.E.3.  If an individual Project Gutenberg-tm electronic work is posted
    with the permission of the copyright holder, your use and distribution
    must comply with both paragraphs 1.E.1 through 1.E.7 and any additional
    terms imposed by the copyright holder.  Additional terms will be linked
    to the Project Gutenberg-tm License for all works posted with the
    permission of the copyright holder found at the beginning of this work.

    1.E.4.  Do not unlink or detach or remove the full Project Gutenberg-tm
    License terms from this work, or any files containing a part of this
    work or any other work associated with Project Gutenberg-tm.

    1.E.5.  Do not copy, display, perform, distribute or redistribute this
    electronic work, or any part of this electronic work, without
    prominently displaying the sentence set forth in paragraph 1.E.1 with
    active links or immediate access to the full terms of the Project
    Gutenberg-tm License.

    1.E.6.  You may convert to and distribute this work in any binary,
    compressed, marked up, nonproprietary or proprietary form, including any
    word processing or hypertext form.  However, if you provide access to or
    distribute copies of a Project Gutenberg-tm work in a format other than
    "Plain Vanilla ASCII" or other format used in the official version
    posted on the official Project Gutenberg-tm web site (www.gutenberg.org),
    you must, at no additional cost, fee or expense to the user, provide a
    copy, a means of exporting a copy, or a means of obtaining a copy upon
    request, of the work in its original "Plain Vanilla ASCII" or other
    form.  Any alternate format must include the full Project Gutenberg-tm
    License as specified in paragraph 1.E.1.

    1.E.7.  Do not charge a fee for access to, viewing, displaying,
    performing, copying or distributing any Project Gutenberg-tm works
    unless you comply with paragraph 1.E.8 or 1.E.9.

    1.E.8.  You may charge a reasonable fee for copies of or providing
    access to or distributing Project Gutenberg-tm electronic works provided
    that

    - You pay a royalty fee of 20% of the gross profits you derive from
         the use of Project Gutenberg-tm works calculated using the method
         you already use to calculate your applicable taxes.  The fee is
         owed to the owner of the Project Gutenberg-tm trademark, but he
         has agreed to donate royalties under this paragraph to the
         Project Gutenberg Literary Archive Foundation.  Royalty payments
         must be paid within 60 days following each date on which you
         prepare (or are legally required to prepare) your periodic tax
         returns.  Royalty payments should be clearly marked as such and
         sent to the Project Gutenberg Literary Archive Foundation at the
         address specified in Section 4, "Information about donations to
         the Project Gutenberg Literary Archive Foundation."

    - You provide a full refund of any money paid by a user who notifies
         you in writing (or by e-mail) within 30 days of receipt that s/he
         does not agree to the terms of the full Project Gutenberg-tm
         License.  You must require such a user to return or
         destroy all copies of the works possessed in a physical medium
         and discontinue all use of and all access to other copies of
         Project Gutenberg-tm works.

    - You provide, in accordance with paragraph 1.F.3, a full refund of any
         money paid for a work or a replacement copy, if a defect in the
         electronic work is discovered and reported to you within 90 days
         of receipt of the work.

    - You comply with all other terms of this agreement for free
         distribution of Project Gutenberg-tm works.

    1.E.9.  If you wish to charge a fee or distribute a Project Gutenberg-tm
    electronic work or group of works on different terms than are set
    forth in this agreement, you must obtain permission in writing from
    both the Project Gutenberg Literary Archive Foundation and Michael
    Hart, the owner of the Project Gutenberg-tm trademark.  Contact the
    Foundation as set forth in Section 3 below.

    1.F.

    1.F.1.  Project Gutenberg volunteers and employees expend considerable
    effort to identify, do copyright research on, transcribe and proofread
    public domain works in creating the Project Gutenberg-tm
    collection.  Despite these efforts, Project Gutenberg-tm electronic
    works, and the medium on which they may be stored, may contain
    "Defects," such as, but not limited to, incomplete, inaccurate or
    corrupt data, transcription errors, a copyright or other intellectual
    property infringement, a defective or damaged disk or other medium, a
    computer virus, or computer codes that damage or cannot be read by
    your equipment.

    1.F.2.  LIMITED WARRANTY, DISCLAIMER OF DAMAGES - Except for the "Right
    of Replacement or Refund" described in paragraph 1.F.3, the Project
    Gutenberg Literary Archive Foundation, the owner of the Project
    Gutenberg-tm trademark, and any other party distributing a Project
    Gutenberg-tm electronic work under this agreement, disclaim all
    liability to you for damages, costs and expenses, including legal
    fees.  YOU AGREE THAT YOU HAVE NO REMEDIES FOR NEGLIGENCE, STRICT
    LIABILITY, BREACH OF WARRANTY OR BREACH OF CONTRACT EXCEPT THOSE
    PROVIDED IN PARAGRAPH F3.  YOU AGREE THAT THE FOUNDATION, THE
    TRADEMARK OWNER, AND ANY DISTRIBUTOR UNDER THIS AGREEMENT WILL NOT BE
    LIABLE TO YOU FOR ACTUAL, DIRECT, INDIRECT, CONSEQUENTIAL, PUNITIVE OR
    INCIDENTAL DAMAGES EVEN IF YOU GIVE NOTICE OF THE POSSIBILITY OF SUCH
    DAMAGE.

    1.F.3.  LIMITED RIGHT OF REPLACEMENT OR REFUND - If you discover a
    defect in this electronic work within 90 days of receiving it, you can
    receive a refund of the money (if any) you paid for it by sending a
    written explanation to the person you received the work from.  If you
    received the work on a physical medium, you must return the medium with
    your written explanation.  The person or entity that provided you with
    the defective work may elect to provide a replacement copy in lieu of a
    refund.  If you received the work electronically, the person or entity
    providing it to you may choose to give you a second opportunity to
    receive the work electronically in lieu of a refund.  If the second copy
    is also defective, you may demand a refund in writing without further
    opportunities to fix the problem.

    1.F.4.  Except for the limited right of replacement or refund set forth
    in paragraph 1.F.3, this work is provided to you 'AS-IS' WITH NO OTHER
    WARRANTIES OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO
    WARRANTIES OF MERCHANTIBILITY OR FITNESS FOR ANY PURPOSE.

    1.F.5.  Some states do not allow disclaimers of certain implied
    warranties or the exclusion or limitation of certain types of damages.
    If any disclaimer or limitation set forth in this agreement violates the
    law of the state applicable to this agreement, the agreement shall be
    interpreted to make the maximum disclaimer or limitation permitted by
    the applicable state law.  The invalidity or unenforceability of any
    provision of this agreement shall not void the remaining provisions.

    1.F.6.  INDEMNITY - You agree to indemnify and hold the Foundation, the
    trademark owner, any agent or employee of the Foundation, anyone
    providing copies of Project Gutenberg-tm electronic works in accordance
    with this agreement, and any volunteers associated with the production,
    promotion and distribution of Project Gutenberg-tm electronic works,
    harmless from all liability, costs and expenses, including legal fees,
    that arise directly or indirectly from any of the following which you do
    or cause to occur: (a) distribution of this or any Project Gutenberg-tm
    work, (b) alteration, modification, or additions or deletions to any
    Project Gutenberg-tm work, and (c) any Defect you cause.

    Section  2.  Information about the Mission of Project Gutenberg-tm

    Project Gutenberg-tm is synonymous with the free distribution of
    electronic works in formats readable by the widest variety of computers
    including obsolete, old, middle-aged and new computers.  It exists
    because of the efforts of hundreds of volunteers and donations from
    people in all walks of life.

    Volunteers and financial support to provide volunteers with the
    assistance they need, is critical to reaching Project Gutenberg-tm's
    goals and ensuring that the Project Gutenberg-tm collection will
    remain freely available for generations to come.  In 2001, the Project
    Gutenberg Literary Archive Foundation was created to provide a secure
    and permanent future for Project Gutenberg-tm and future generations.
    To learn more about the Project Gutenberg Literary Archive Foundation
    and how your efforts and donations can help, see Sections 3 and 4
    and the Foundation web page at http://www.pglaf.org.


    Section 3.  Information about the Project Gutenberg Literary Archive
    Foundation

    The Project Gutenberg Literary Archive Foundation is a non profit
    501(c)(3) educational corporation organized under the laws of the
    state of Mississippi and granted tax exempt status by the Internal
    Revenue Service.  The Foundation's EIN or federal tax identification
    number is 64-6221541.  Its 501(c)(3) letter is posted at
    http://pglaf.org/fundraising.  Contributions to the Project Gutenberg
    Literary Archive Foundation are tax deductible to the full extent
    permitted by U.S. federal laws and your state's laws.

    The Foundation's principal office is located at 4557 Melan Dr. S.
    Fairbanks, AK, 99712., but its volunteers and employees are scattered
    throughout numerous locations.  Its business office is located at
    809 North 1500 West, Salt Lake City, UT 84116, (801) 596-1887, email
    business@pglaf.org.  Email contact links and up to date contact
    information can be found at the Foundation's web site and official
    page at http://pglaf.org

    For additional contact information:
         Dr. Gregory B. Newby
         Chief Executive and Director
         gbnewby@pglaf.org

    Section 4.  Information about Donations to the Project Gutenberg
    Literary Archive Foundation

    Project Gutenberg-tm depends upon and cannot survive without wide
    spread public support and donations to carry out its mission of
    increasing the number of public domain and licensed works that can be
    freely distributed in machine readable form accessible by the widest
    array of equipment including outdated equipment.  Many small donations
    ($1 to $5,000) are particularly important to maintaining tax exempt
    status with the IRS.

    The Foundation is committed to complying with the laws regulating
    charities and charitable donations in all 50 states of the United
    States.  Compliance requirements are not uniform and it takes a
    considerable effort, much paperwork and many fees to meet and keep up
    with these requirements.  We do not solicit donations in locations
    where we have not received written confirmation of compliance.  To
    SEND DONATIONS or determine the status of compliance for any
    particular state visit http://pglaf.org

    While we cannot and do not solicit contributions from states where we
    have not met the solicitation requirements, we know of no prohibition
    against accepting unsolicited donations from donors in such states who
    approach us with offers to donate.

    International donations are gratefully accepted, but we cannot make
    any statements concerning tax treatment of donations received from
    outside the United States.  U.S. laws alone swamp our small staff.

    Please check the Project Gutenberg Web pages for current donation
    methods and addresses.  Donations are accepted in a number of other
    ways including checks, online payments and credit card donations.
    To donate, please visit: http://pglaf.org/donate

    Section 5.  General Information About Project Gutenberg-tm electronic
    works.

    Professor Michael S. Hart is the originator of the Project Gutenberg-tm
    concept of a library of electronic works that could be freely shared
    with anyone.  For thirty years, he produced and distributed Project
    Gutenberg-tm eBooks with only a loose network of volunteer support.

    Project Gutenberg-tm eBooks are often created from several printed
    editions, all of which are confirmed as Public Domain in the U.S.
    unless a copyright notice is included.  Thus, we do not necessarily
    keep eBooks in compliance with any particular paper edition.

    Most people start at our Web site which has the main PG search facility:

         http://www.gutenberg.org

    This Web site includes information about Project Gutenberg-tm,
    including how to make donations to the Project Gutenberg Literary
    Archive Foundation, how to help produce our new eBooks, and how to
    subscribe to our email newsletter to hear about new eBooks.
    */
}
