<?php

namespace Faker\Provider\zh_CN;

class Text extends \Faker\Provider\Text
{
    /**
     * 鲁迅名言警句
     * @var array
     */
    protected static $baseText = array(
        '有缺点的战士终竟是战士，完美的苍蝇也终竟不过是苍蝇。',
        '时间就像海绵里的水，只要愿挤，总还是有的。',
        '倘只看书，便变成书橱。',
        '我好像是一只牛，吃的是草，挤出的是奶、血。',
        '其实地上本没有路，走的人多了，也便成了路。',
        '哪里有天才，我只不过是把别人喝咖啡的时间都用在工作上了。',
        '惟有民魂是值得宝贵的，惟有他发扬起来，中国才有真进步。',
        '沉着、勇猛、有辨别、不自私。',
        '愈艰难，就愈要做。改革，是向来没有一帆风顺的。',
        '我们目下的当务之急是：一要生存，二要温饱，三要发展。',
        '必须敢于正视，这才可望敢想、敢说、敢做、敢当。',
        '曾经阔气的要复古，正在阔气的要保持现状，未曾阔气的要革新，大抵如此，大抵！',
        '人类总不会寂寞，因为生命是进步的，是天生的。',
        '只要从来如此，便是宝贝。',
        '事实是毫无情面的东西，它能将空言打得粉碎。',
        '墨写的谎，决掩不住血写的事实。',
        '其实先驱者本是容易变成绊脚石的。',
        '贪安稳就没有自由，要自由就要历些危险。只有这两条路。',
        '假使做事要面面顾到，那就什么事都不能做了。',
        '时间就是性命。无端地空耗别人的时间，其实是无异于谋财害命的。',
        '做一件事，无论大小，倘无恒心，是很不好的。',
        '死者倘不埋在活人心中，那就真正死掉了。',
        '改造自己，总比禁止别人来的难。',
        '只要能培一朵花，就不妨做做会朽的腐草。',
        '当我沉默的时候，我觉得充实；我将开口，同时感到空虚。',
        '过去的生命已经死亡。我对于这死亡有大欢喜，因为我借此知道它曾经存活。',
        '死亡的生命已经朽腐。我对于这朽腐有大欢喜，因为我借此知道它还非空虚。',
        '但我坦然，欣然。我将大笑，我将歌唱。',
        '我自爱我的野草，但我憎恶这以野草作装饰的地面。',
        '待我成尘时，你将见我的微笑！',
        '不在沉默中爆发，就在沉默中灭亡。',
        '怀疑并不是缺点。总是疑，而并不下断语，这才是缺点。',
        '纠缠如毒蛇，执著如冤鬼。激烈得快的，也平和的快，甚至于也颓废的快。',
        '巨大的建筑，总是一木一石叠起来，我们何尝做做这一木一石呢？我时常做些零碎事，就是为此。',
        '宁可与敌人明打，不欲受同人暗算。',
        '明言着轻蔑什么人，并不是十足的轻蔑。惟沉默是最高的轻蔑，最高的轻蔑是无言，而且连眼珠也不转过去。',
        '唯独革命家，无论他生或死，都能给大家以幸福。',
        '凡事总需研究，才会明白。',
        '生活太安逸了，工作就会被生活所累。',
        '使一个人的有限的生命，更加有效，也即等于延长了人的生命。',
        '我的确时时解剖别人，然而更多的是无情地解剖我自己。',
        '走上人生的路途吧。前途很远，也很暗。然而不要怕，不怕的人面前才有路。',
        '人生最苦痛的是梦醒了无路可走。',
        '谦以待人，虚以接物。',
        '自由固不是钱所买到的，但能够为钱而卖掉。',
        '希望是附丽于存在的，有存在，便有希望，有希望，便是光明。',
        '哀其不幸，怒其不争。',
        '悲剧将人生的有价值的东西毁灭给人看，喜剧将那无价值的撕破给人看。',
        '伟大的心胸，应该表现出这样的气概——用笑脸来迎接悲惨的厄运，用百倍的勇气来应付一切的不幸。',
        '不满足是向上的齿轮。',
        '只看一个人的著作，结果是不大好的：你就得不到多方面的优点。必须如蜜蜂一样，采过许多花，这才能酿出蜜来。倘若叮在一处，所得就非常有限，枯燥了。',
        '中国虽发明火药，却只会用来放烟花炮竹；发明罗盘，也是用来看风水。',
        '即使艰难，也还要做；愈艰难，就愈要做。改革，是向来没有一帆风顺的，冷笑家的赞成，是在见了成功之后……',
        '我们中国人对于不是自己的东西，或者将不为自己所有的东西，总要破坏了才快活的。',
        '在要求天才的产生之前，应该先要求可以使天才生长的民众。——譬如想有乔木，想看好花，一定要有好土；没有土，便没有花木了；所以土实在较花木还重要。',
        '以人为鉴，明白非常，是使人能够反省的妙法。',
        '友谊是两颗心的真诚相待，而不是一颗心对另一颗心的敲打。',
        '我想，普遍，永久，完全，这三件宝贝，自然是了不得的，不过也是作家的棺材钉，会将他钉死。',
        '损着别人的牙眼，却反对报复，主张宽容的人，万勿和他接近。',
    );
    protected static $separator = '';

    /**
     * 根据 $maxNbChars 返回鲁迅的名言警句
     *
     * @example '以人为鉴，明白非常，是使人能够反省的妙法。哀其不幸，怒其不争。'
     * @param integer $maxNbChars Maximum number of characters the text should contain (minimum: 10)
     * @param integer $indexSize  invalid
     * @return string
     */
    public function realText($maxNbChars = 200, $indexSize = 2)
    {
        if ($maxNbChars < 10) {
            throw new \InvalidArgumentException('maxNbChars must be at least 10');
        }

        // filter out less maxNbChars sentences.
        $words = array_filter(static::$baseText, function ($word) use ($maxNbChars) {
            $strlen = function_exists('mb_strlen') ? mb_strlen($word, 'UTF-8') : strlen($word);
            return $strlen < $maxNbChars;
        });

        $result = array();
        $resultLength = 0;

        while ($resultLength < $maxNbChars) {
            // fetch a random word to append
            $word = static::randomElement($words);

            $result[] = $word;
            $resultLength += static::strlen($word);
        }

        // remove the element that caused the text to overflow
        array_pop($result);

        // build result
        $result = static::implode($result);

        return $result;
    }
}
