<?php

namespace Faker\Provider\ru_RU;

/**
 * Class Lorem
 *
 * @category Classes
 * @package  Faker\Provider\ru_RU
 * @author   Volodymr Kornilov <mail@terion.name>
 * @license  MIT http://opensource.org/licenses/MIT
 * @link     http://terion.name
 */
class Lorem extends \Faker\Provider\Lorem
{
    protected static $wordList = array(
        'но', 'чтобы', 'вы', 'поняли', 'откуда', 'возникает', 'это', 'превратное', 'представление',
        'людей', 'порицающих', 'наслаждение', 'и', 'восхваляющих', 'я', 'раскрою',
        'перед', 'вами', 'всю', 'картину', 'разъясню', 'что', 'именно', 'говорил', 'этот',
        'человек', 'открывший', 'истину', 'которого', 'бы', 'назвал', 'зодчим', 'счастливой',
        'жизни', 'действительно', 'никто', 'не', 'отвергает', 'презирает', 'избегает', 'наслаждений',
        'только', 'из-за', 'того', 'наслаждения', 'лишь', 'тех', 'кто', 'умеет', 'разумно', 'предаваться',
        'наслаждениям', 'постигают', 'великие', 'равно', 'как', 'нет', 'никого', 'возлюбил', 'предпочел',
        'возжаждал', 'само', 'за', 'то', 'а', 'потому', 'иной', 'раз', 'возникают', 'такие',
        'обстоятельства', 'когда', 'приносят', 'некое', 'немалое', 'если', 'воспользоваться', 'простейшим',
        'примером', 'из', 'нас', 'стал', 'заниматься', 'какими', 'ни', 'было', 'тягостными', 'физическими',
        'упражнениями', 'приносило', 'с', 'собой', 'некоей', 'пользы', 'мог', 'по', 'справедливости',
        'упрекнуть', 'стремящегося', 'к', 'наслаждению', 'которое', 'несло', 'никаких', 'неприятностей', 'или',
        'избегал', 'такого', 'никакого'
    );
}