<?php

namespace Faker\Provider\ru_RU;

class Lorem extends \Faker\Provider\Lorem
{
  protected static $wordList = array(
    'Эи', 'мэнандря', 'зкрипторэм', 'вольуптатибюж', 'мыа', 'Ёудёкабет', 'интыллыгам', 'хёз', 'но', 'ыюм', 'ат',
    'эрат', 'мальорум', 'ан', 'вэл', 'ыльит', 'аляквюид', 'пэрпэтюа', 'Агам', 'ёудико', 'нужквюам', 'ыт', 'вим', 'Эа',
    'зыд', 'ютенам', 'вокябюч', 'конжыквуюнтюр', 'Ыт', 'ыюм', 'номинави', 'янжольэнж', 'эи', 'жят', 'пожтэа', 'емпыдит',
    'ыкжплььикари', 'Выро', 'опортэат', 'компльыктётюр', 'ат', 'еюж', 'пожжёт', 'аликвюип', 'пожйдонёюм', 'ан', 'эжт',
    'агам', 'рэгяонэ', 'юлламкорпэр', 'нам', 'йн', 'Йн', 'чэнзэрет', 'рэпудёандаэ', 'эффякиантур', 'эож', 'мыа', 'ут',
    'выльёт', 'алььтэрюм', 'волумюч', 'вокынт', 'дэчырюёжжэ', 'мныжаркхюм', 'дуо', 'эи', 'Еюж', 'йн', 'ыррор',
    'жанктюч', 'зыд', 'экз', 'алёквюам', 'ыкжплььикари', 'Хаж', 'экз', 'аппэтырэ', 'волютпат', 'пэртинакёа', 'жолюм',
    'элыктрам', 'вольуптатибюж', 'ку', 'квуй', 'ельлюд', 'тинкидюнт', 'квюо', 'ты', 'Ед', 'кюм', 'вэре', 'юллюм',
    'вэртырэм', 'ыам', 'лудуз', 'вокынт', 'аппэльлььантюр', 'эи', 'Ку', 'векж', 'декат', 'пожтэа', 'пэркйпет', 'Мюндй',
    'ыкжпэтэндяз', 'юлламкорпэр', 'нэ', 'вим', 'Кюм', 'аутым', 'молэчтёэ', 'интэллэгат', 'эю', 'эю', 'зыд', 'эним',
    'аппэльлььантюр', 'Татион', 'аппарэат', 'экз', 'хаж', 'йн', 'адхюк', 'луптатум', 'апыирёан', 'еюж', 'Нык', 'но',
    'льюкяльиюч', 'ёудёкабет', 'хэндрэрет', 'ут', 'жят', 'нихйл', 'праэчынт', 'Ат', 'мэль', 'фэугяат', 'анкилльаы',
    'нэ', 'кюм', 'чтэт', 'жолюм', 'оффекйяж', 'кюм', 'ку', 'ыёюз', 'долорэж', 'пожйдонёюм', 'Еюж', 'чент', 'нонюмэш',
    'хабымуч', 'ат', 'Векж', 'ед', 'фалля', 'конгуы', 'ючю', 'но', 'ёнэрмйщ', 'пробатуж', 'коррюмпит', 'Ку', 'жольюта',
    'пыртенакж', 'юлламкорпэр', 'про', 'ат', 'видэ', 'льаборэ', 'чадипжкёнг', 'ючю', 'Йн', 'кибо', 'эвэртё',
    'рэктэквуэ', 'шэа', 'нэ', 'лаудым', 'кончэтытюр', 'мыа', 'модыратиюз', 'дэфянятйоныс', 'ыюм', 'ед', 'Прё',
    'вэрыар', 'интэллэгат', 'ут', 'заэпы', 'декам', 'нэ', 'квуй', 'коммюны', 'пэрпэтюа', 'эю', 'квуй', 'Ючю', 'дикунт',
    'нужквюам', 'ат', 'ед', 'жэмпэр', 'лыгэндоч', 'антеопам', 'зыд', 'клита', 'мальюизчыт', 'эи', 'нам', 'Но', 'вэл',
    'аккюсам', 'зэнтынтиаэ', 'Оптёон', 'жямиляквюы', 'хаж', 'йн', 'ыт', 'новум', 'пробатуж', 'дежпютатионй', 'ыюм',
    'Ыт', 'малйж', 'кхоро', 'квюо', 'хёз', 'ут', 'агам', 'убяквюэ', 'граэкйж', 'Ты', 'хёз', 'тымпор', 'квюаыквуэ',
    'фабулаз', 'Ут', 'тота', 'фюйзчыт', 'шынчебюз', 'ючю', 'ут', 'шэа', 'ентэгры', 'индоктум', 'Эож', 'нэ', 'квюод',
    'пльакырат', 'льюкяльиюч', 'ючю', 'лудуз', 'нюлльам', 'ыт', 'Ты', 'ыам', 'убяквюэ', 'алёквюам', 'рыпримёквуы',
    'еюж', 'экшырки', 'рыпудяары', 'пхйложопхяа', 'ыт', 'Жят', 'ку', 'порро', 'дэбыт', 'факэр', 'ыёрмод', 'льаорыыт',
    'но', 'кюм', 'чтэт', 'дюиж', 'дэчырюёжжэ', 'эож', 'ат', 'Альяквюам', 'жкряпшэрит', 'мэль', 'ты', 'ан', 'опортэат',
    'зюжкепиантюр', 'нам', 'Вэл', 'доминг', 'антеопам', 'запиэнтэм', 'ад', 'ючю', 'попюльо', 'дэниквюы', 'пэркйпет',
    'ты', 'пэрпэтюа', 'губэргрэн', 'эю', 'хаж', 'Векж', 'еллум', 'молэчтёэ', 'конжтетуто', 'нэ', 'копиожаы',
    'глориатюр', 'ыт', 'кюм', 'Атквюе', 'дикырыт', 'дёжжэнтиюнт', 'нэ', 'мэя', 'мыис', 'ведят', 'экз', 'кюм', 'Хёз',
    'ут', 'толлйт', 'квюальизквюэ', 'экз', 'вэл', 'мютат', 'дёкант', 'Вёжи', 'тимэам', 'квюаэчтио', 'эа', 'ыюм', 'но',
    'пэр', 'мюндй', 'дэбетиз', 'аккузата', 'Эа', 'эжт', 'вирйз', 'ридэнж', 'рыпримёквуы', 'квюо', 'съюммо', 'тантаз',
    'пхаэдрум', 'эи', 'Адмодум', 'долорэж', 'эи', 'хёз', 'ад', 'нощтыр', 'дэчырюёжжэ', 'квуй', 'эа', 'пюрто', 'ыёюз',
    'квуй', 'Дюиж', 'мовэт', 'пыртенакж', 'вэл', 'ты', 'Ат', 'чтэт', 'вёртюты', 'альбюкиюс', 'мэя', 'ед', 'кюм',
    'ёужто', 'трётанё', 'оффэндйт', 'Квюо', 'йн', 'ипзум', 'копиожаы', 'янтэрэсщэт', 'про', 'ыт', 'аутым',
    'ыкжплььикари', 'Эи', 'ажжюм', 'дыкоры', 'волуптариа', 'квуй', 'йн', 'ыам', 'тимэам', 'адолэжкэнс', 'Экз', 'рыбюм',
    'зючкёпит', 'интэллэгат', 'шэа', 'ыам', 'нэ', 'долорэм', 'дэниквюы', 'мыа', 'тальэ', 'жплэндидэ', 'пэрчыквюэрёж',
    'ат'
  );
}
