<?php

namespace Faker\Provider\ar_TN;

class Address extends \Faker\Provider\Address
{
    protected static $streetPrefix = array('شارع', 'طريق', 'ممر', 'نهج');
    protected static $cityPrefix = array('شمال', 'شرق', 'غرب', 'جنوب', 'وسط',);
    /**
     * @link https://ar.wikipedia.org/wiki/%D9%82%D8%A7%D8%A6%D9%85%D8%A9_%D9%88%D9%84%D8%A7%D9%8A%D8%A7%D8%AA_%D8%AA%D9%88%D9%86%D8%B3
     */
    protected static $cityName = array(
        'أريانة', 'باجة',  'بن عروس',  'بنزرت',  'قابس',   'قفصة',  'جندوبة',  'القيروان',  'القصرين',   'قبلي',   'الكاف',   'المهدية',  'منوبة',   'مدنين',   'المنستير',   'نابل',   'صفاقس',   'سيدي بوزيد',   'سليانة',   'سوسة',   'تطاوين',  'توزر',  'تونس',  'زغوان'
    );

    /**
     * @link https://ar.wikipedia.org/wiki/%D8%A7%D9%84%D8%AA%D9%82%D8%B3%D9%8A%D9%85_%D8%A7%D9%84%D8%A5%D8%AF%D8%A7%D8%B1%D9%8A_%D9%84%D9%84%D9%85%D9%85%D9%84%D9%83%D8%A9_%D8%A7%D9%84%D8%B9%D8%B1%D8%A8%D9%8A%D8%A9_%D8%A7%D9%84%D8%B3%D8%B9%D9%88%D8%AF%D9%8A%D8%A9
     */
    protected static $subdivisions = array(

        'أريانة المدينة', 'حي التضامن', 'قلعة الأندلس', 'المنيهلة',  'رواد',  'سيدي ثابت', 'سكرة',  'عمدون', 'باجة الشمالية', 'باجة الجنوبية', 'قبلاط', 'مجاز الباب', 'نفزة', 'تبرسق',  'تستور', 'تيبار', 'بن عروس المدينة', 'بومهل البساتين', 'المروج', 'الزهراء', 'فوشانة', 'حمام الشط', 'حمام الأنف', 'المحمدية', 'المدينة الجديدة',  'مقرين', 'مرناق', 'رادس', 'بنزرت المدينة', 'جومين',  'العالية', 'غزالة', 'ماطر', 'منزل بورقيبة', 'منزل جميل', 'رأس الجبل', 'سجنان', 'تينجة', 'أوتيك', 'جرزونة',  'قابس المدينة', 'قابس الغربية', 'قابس الجنوبية', 'غنوش', 'الحامة', 'مارث', 'مطماطة', 'مطماطة الجديدة', 'منزل الحبيب', 'المطوية', 'بلخير', 'قفصة الشمالية', 'قفصة الجنوبية', 'القطار', 'القصر', 'المظيلة', 'المتلوي', 'أم العرائس', 'الرديف', 'السند', 'سيدي عيش', 'جندوبة المدينة', 'عين دراهم', 'بلطة بوعوان', 'بوسالم', 'فرنانة', 'غار الدماء',  'جندوبة الشمالية', 'وادي مليز',  'طبرقة',  'العلا', 'بوحجلة', 'الشبيكة',  'الشراردة', 'حفوز', 'حاجب العيون', 'القيروان الشمالية', 'القيروان الجنوبية', 'نصر الله',  'الوسلاتية', 'السبيخة', 'العيون',  'الزهور',  'فريانة',  'فوسانة',  'حاسي الفريد', 'حيدرة', 'جدليان', 'القصرين الشمالية', 'القصرين الجنوبية', 'ماجل بلعباس', 'سبيطلة', 'سبيبة', 'تالة', 'دوز الشمالية', 'دوز الجنوبية', 'الفوار', 'قبلي الشمالية', 'قبلي الجنوبية', 'سوق الأحد',  'الدهماني',  'السرس',  'الجريصة',  'القلعة الخصبة', 'قلعة سنان', 'الكاف الشرقية', 'الكاف الغربية', 'القصور', 'نبر', 'ساقية سيدي يوسف', 'تاجروين',  'المهدية المدينة', 'بومرداس', 'الشابة', 'شربان', 'الجم', 'هبيرة', 'قصور الساف', 'ملولش', 'أولاد الشامخ', 'سيدي علوان', 'السواسي',  'منوبة المدينة', 'برج العامري',  'دوار هيشر', 'البطان',  'الجديدة', 'المرناقية', 'وادي الليل',  'طبربة',  'بنقردان',  'بني خداش',  'جربة عجيم',  'جربة ميدون',  'جربة حومة السوق', 'مدنين الشمالية', 'مدنين الجنوبية',  'سيدي مخلوف', 'جرجيس', 'المنستير', 'المدينة', 'البقالطة', 'بنبلة', 'بني حسان',  'جمال', 'قصر هلال', 'قصيبة المديوني', 'المكنين', 'الوردانين', 'الساحلين', 'صيادة', 'لمطة', 'بوحجر', 'طبلبة', 'زرمدين',  'نابل المدينة',  'بني خلاد',  'بني خيار',  'بوعرقوب', 'دار شعبان الفهري', 'الميدة', 'قرمبالية', 'حمام الأغزاز', 'الحمامات', 'الهوارية', 'قليبية', 'قربة', 'منزل بوزلفة', 'منزل تميم', 'سليمان', 'تاكلسة', 'صفاقس المدينة', 'عقارب', 'بئر علي بن خليفة',  'العامرة', 'الغريبة', 'الحنشة', 'جبنيانة',  'قرقنة',  'المحرس',  'منزل شاكر', 'ساقية الدائر', 'ساقية الزيت',  'صفاقس الغربية', 'صفاقس الجنوبية', 'الصخيرة', 'طينة', 'بئر الحفي', 'جلمة', 'المزونة', 'المكناسي', 'منزل بوزيان',  'أولاد حفوز', 'الرقاب', 'السبالة', 'سيدي علي بن عون', 'سيدي بوزيد الشرقية', 'سيدي بوزيد الغربية', 'السوق الجديد', 'برقو', 'بوعرادة', 'العروسة', 'الكريب', 'قعفور', 'كسرى', 'مكثر', 'الروحية', 'سيدي بورويس', 'سليانة الشمالية', 'سليانة الجنوبية', 'سوسة المدينة', 'أكودة',  'بوفيشة', 'النفيضة', 'حمام سوسة', 'هرقلة', 'القلعة الكبرى', 'القلعة الصغرى', 'كندار', 'مساكن', 'سيدي بوعلي', 'سيدي الهاني', 'معتمدية سوسة جوهرة', 'سوسة الرياض', 'سوسة سيدي عبد الحميد', 'الزاوية قصيبة الثريات', 'بئر الأحمر', 'الذهيبة', 'غمراسن', 'رمادة', 'الصمار', 'تطاوين الشمالية', 'تطاوين الجنوبية', 'توزر المدينة', 'دقاش', 'حزوة', 'نفطة', 'تمغزة', 'تونس المدينة', 'باب البحر', 'باب السويقة', 'باردو', 'ضفاف البحيرة', 'قرطاج', 'حي الخضراء', 'المنزه', 'الوردية', 'حي التحرير', 'الزهور', 'الحرايرية', 'جبل الجلود', 'الكبارية', 'حلق الوادي', 'المرسى (تونس)', 'الكرم (تونس)', 'العمران', 'العمران الأعلى', 'سيدي البشير', 'سيدي حسين', 'السيجومي', 'زغوان المدينة', 'بئر مشارقة', 'الفحص', 'الناظور', 'صواف'

    );

    /**
     * @link https://ar.wikipedia.org/wiki/%D9%82%D8%A7%D8%A6%D9%85%D8%A9_%D9%85%D8%AD%D8%A7%D9%81%D8%B8%D8%A7%D8%AA_%D8%A7%D9%84%D8%B3%D8%B9%D9%88%D8%AF%D9%8A%D8%A9
     */
    protected static $governorates = array(
        'أريانة', 'باجة',  'بن عروس',  'بنزرت',  'قابس',   'قفصة',  'جندوبة',  'القيروان',  'القصرين',   'قبلي',   'الكاف',   'المهدية',  'منوبة',   'مدنين',   'المنستير',   'نابل',   'صفاقس',   'سيدي بوزيد',   'سليانة',   'سوسة',   'تطاوين',  'توزر',  'تونس',  'زغوان'
    );

    protected static $buildingNumber = array('#####', '####', '##');

    protected static $postcode = array('#####', '#####-####');

    /**
     * @link http://www.nationsonline.org/oneworld/countrynames_arabic.htm
     */
    protected static $country = array(
        'الكاريبي', 'أمريكا الوسطى', 'أنتيجوا وبربودا', 'أنجولا', 'أنجويلا', 'أندورا', 'اندونيسيا', 'أورجواي', 'أوروبا', 'أوزبكستان', 'أوغندا', 'أوقيانوسيا', 'أوقيانوسيا النائية', 'أوكرانيا', 'ايران', 'أيرلندا', 'أيسلندا', 'ايطاليا',
        'بابوا غينيا الجديدة', 'باراجواي', 'باكستان', 'بالاو', 'بتسوانا', 'بتكايرن', 'بربادوس', 'برمودا', 'بروناي', 'بلجيكا', 'بلغاريا', 'بليز', 'بنجلاديش', 'بنما', 'بنين', 'بوتان', 'بورتوريكو', 'بوركينا فاسو', 'بوروندي', 'بولندا', 'بوليفيا', 'بولينيزيا', 'بولينيزيا الفرنسية', 'بيرو',
        'تانزانيا', 'تايلند', 'تايوان', 'تركمانستان', 'تركيا', 'ترينيداد وتوباغو', 'تشاد', 'توجو', 'توفالو', 'توكيلو', 'تونجا', 'تونس', 'تيمور الشرقية',
        'جامايكا', 'جبل طارق', 'جرينادا', 'جرينلاند', 'جزر الأنتيل الهولندية', 'جزر الترك وجايكوس', 'جزر القمر', 'جزر الكايمن', 'جزر المارشال', 'جزر الملديف', 'جزر الولايات المتحدة البعيدة الصغيرة', 'جزر أولان', 'جزر سليمان', 'جزر فارو', 'جزر فرجين الأمريكية', 'جزر فرجين البريطانية', 'جزر فوكلاند', 'جزر كوك', 'جزر كوكوس', 'جزر ماريانا الشمالية', 'جزر والس وفوتونا', 'جزيرة الكريسماس', 'جزيرة بوفيه', 'جزيرة مان', 'جزيرة نورفوك', 'جزيرة هيرد وماكدونالد', 'جمهورية افريقيا الوسطى', 'جمهورية التشيك', 'جمهورية الدومينيك', 'جمهورية الكونغو الديمقراطية', 'جمهورية جنوب افريقيا', 'جنوب آسيا', 'جنوب أوروبا', 'جنوب شرق آسيا', 'جنوب وسط آسيا', 'جواتيمالا', 'جوادلوب', 'جوام', 'جورجيا', 'جورجيا الجنوبية وجزر ساندويتش الجنوبية', 'جيبوتي', 'جيرسي',
        'دومينيكا',
        'رواندا', 'روسيا', 'روسيا البيضاء', 'رومانيا', 'روينيون',
        'زامبيا', 'زيمبابوي',
        'ساحل العاج', 'ساموا', 'ساموا الأمريكية', 'سانت بيير وميكولون', 'سانت فنسنت وغرنادين', 'سانت كيتس ونيفيس', 'سانت لوسيا', 'سانت مارتين', 'سانت هيلنا', 'سان مارينو', 'ساو تومي وبرينسيبي', 'سريلانكا', 'سفالبارد وجان مايان', 'سلوفاكيا', 'سلوفينيا', 'سنغافورة', 'سوازيلاند', 'سوريا', 'سورينام', 'سويسرا', 'سيراليون', 'سيشل',
        'شرق آسيا', 'شرق افريقيا', 'شرق أوروبا', 'شمال افريقيا', 'شمال أمريكا', 'شمال أوروبا', 'شيلي',
        'صربيا', 'صربيا والجبل الأسود',
        'طاجكستان',
        'عمان',
        'غامبيا', 'غانا', 'غرب آسيا', 'غرب افريقيا', 'غرب أوروبا', 'غويانا', 'غيانا', 'غينيا', 'غينيا الاستوائية', 'غينيا بيساو',
        'فانواتو', 'فرنسا', 'فلسطين', 'فنزويلا', 'فنلندا', 'فيتنام', 'فيجي',
        'قبرص', 'قرغيزستان', 'قطر',
        'كازاخستان', 'كاليدونيا الجديدة', 'كرواتيا', 'كمبوديا', 'كندا', 'كوبا', 'كوريا الجنوبية', 'كوريا الشمالية', 'كوستاريكا', 'كولومبيا', 'كومنولث الدول المستقلة', 'كيريباتي', 'كينيا',
        'لاتفيا', 'لاوس', 'لبنان', 'لوكسمبورج', 'ليبيا', 'ليبيريا', 'ليتوانيا', 'ليختنشتاين', 'ليسوتو',
        'مارتينيك', 'ماكاو الصينية', 'مالطا', 'مالي', 'ماليزيا', 'مايوت', 'مدغشقر', 'مصر', 'مقدونيا', 'ملاوي', 'منغوليا', 'موريتانيا', 'موريشيوس', 'موزمبيق', 'مولدافيا', 'موناكو', 'مونتسرات', 'ميانمار', 'ميكرونيزيا', 'ميلانيزيا',
        'ناميبيا', 'نورو', 'نيبال', 'نيجيريا', 'نيكاراجوا', 'نيوزيلاندا', 'نيوي',
        'هايتي', 'هندوراس', 'هولندا', 'هونج كونج الصينية',
        'وسط آسيا', 'وسط افريقيا',
    );

    protected static $cityFormats = array(
        '{{cityName}}',
    );

    protected static $streetNameFormats = array(
        '{{streetPrefix}} {{firstName}} {{lastName}}',
    );

    protected static $streetAddressFormats = array(
        '{{buildingNumber}} {{streetName}}',
        '{{buildingNumber}} {{streetName}} {{secondaryAddress}}',
    );

    protected static $addressFormats = array(
        "{{streetAddress}}\n{{city}}",
    );

    protected static $secondaryAddressFormats = array('شقة رقم. ##', 'عمارة رقم ##');

    /**
     * @example 'شرق'
     */
    public static function cityPrefix()
    {
        return static::randomElement(static::$cityPrefix);
    }

    /**
     * @example 'قبلي'
     */
    public static function cityName()
    {
        return static::randomElement(static::$cityName);
    }

    /**
     * @example 'شارع'
     */
    public static function streetPrefix()
    {
        return static::randomElement(static::$streetPrefix);
    }

    /**
     * @example 'شقة رقم. 350'
     */
    public static function secondaryAddress()
    {
        return static::numerify(static::randomElement(static::$secondaryAddressFormats));
    }

    /**
     * @example 'نابل'
     */
    public static function subdivision()
    {
        return static::randomElement(static::$subdivisions);
    }

    /**
     * @example 'قابس'
     */
    public static function governorate()
    {
        return static::randomElement(static::$governorates);
    }
}
