<?php

namespace Faker\Provider\ar_PS;

class Lorem extends \Faker\Provider\Lorem
{

	/**
	 * @link https://ar.wikipedia.org/wiki/%D9%84%D9%88%D8%B1%D9%8A%D9%85_%D8%A5%D9%8A%D8%A8%D8%B3%D9%88%D9%85
	 */
	protected static $wordList = array('خسائر', 'اللازمة', 'ومطالبة', 'حدة', 'بل', 'الآخر', 'الحلفاء', 'أن', 'غزو', 'إجلاء', 'وتنامت', 'عدد', 'مع', 'لقهر', 'معركة', 'لبلجيكا،', 'بـ', 'انه', 'ربع', 'الأثنان', 'المقيتة', 'في', 'اقتصّت', 'المحور', 'حدة', 'هذه', 'ما', 'طرفاً', 'عالمية', 'استسلام', 'الصين', 'وتنامت', 'حين', 'ونتج', 'والحزب', 'المذابح', 'كل', 'جوي', 'أسر', 'كارثة', 'المشتّتون', 'بل', 'وبعض', 'وبداية', 'الصفحة', 'غزو', 'قد', 'أي', 'بحث', 'تعداد', 'الجنوب', 'قصف', 'المسرح', 'واستمر', 'الإتحاد', 'في', 'ذات', 'أسيا', 'للغزو،', 'الخطّة', 'الآخر', 'لألمانيا', 'جهة', 'بل', 'في', 'سحقت', 'هيروشيما', 'البريطاني', 'يتم', 'غريمه', 'باحتلال', 'الأيديولوجية،', 'في', 'فصل', 'دحر', 'وقرى', 'لهيمنة', 'الإيطالية', '٣٠', 'استبدال', 'استسلام', 'القاذفات', 'عل', 'مما', 'ببعض', 'مئات', 'وبلجيكا،', 'قد', 'أما', 'قِبل', 'الدنمارك', 'حتى', 'كل', 'العمليات', 'اليابانية', 'انه', 'أن', 'حتى', 'هاربر', 'موسكو', 'ثم', 'وتقهقر', 'المنتصرة', 'حدة', 'عل', 'التي', 'فهرست', 'واشتدّت', 'أن', 'أسر', 'كانت', 'المتاخمة', 'التغييرات', 'أم', 'وفي', 'ان', 'وانتهاءً', 'باستحداث', 'قهر', 'ان', 'ضمنها', 'للأراضي', 'الأوروبية', 'ذات', 'حشد', 'الثقيل', 'المنتصر', 'ثم', 'أسر', 'قررت', 'تم', 'وغير', 'تصفح', 'الحزب', 'واستمر', 'مشروط', 'الساحلية', 'هذا', 'ان', 'أما', 'معركة', 'لبلجيكا،', 'من', 'الألوف', 'الثقيلة', 'الإنجليزية', 'أسر', '٣٠', '٣٠', 'دار', 'أمام', 'أحدث', 'أما', 'بحشد', 'الهادي', 'الدولارات', 'ما', 'هو', 'الحزب', 'الصفحة', 'محاولات', 'قبل', 'وبحلول', 'الخنادق', 'الأوروبية،', 'ان', 'غير', 'وليرتفع', 'برلين،', 'انه', 'انتباه', 'الوزراء', 'البولندي', 'تم', 'تلك');
}
