<?php

namespace Faker\Provider\ar_PS;

class Lorem extends \Faker\Provider\Lorem
{

    protected static $wordList = array(
        'أهم','مميزات','كل','صحيفة','هى','العنونة','أو','المانشيت','مثلا','يقال','معنونات','أو','مانشيتات','الصحافة','المصرية','اليوم','عنونت','الأخبار','أو','الأهرام','القاهرية','كذا','بينما','عنونت','البيان','السكندرية','وتابعتها','بنفس','العنونة','صحيفة','الشاهد','الأقصرية','وهكذا','جرى','العرف','أن','يطلق','اسم','“صحيفة”','على','“الجريدة”،','إلا','أنه','علمياً','فإن','الصحيفة','هي','كل','مطبوعة','دورية،','وبالتالي','يدخل','تحت','خانتها','المجلة','التي','يعمل','بها','“صحفيون”','أيضاً،','إلا','أن','المجلة','تتميز','بدورية','أطول','من','الجريدة','التي','تصدر','يومياً','أو','أسبوعياً،','في','حين','يمكن','للمجلة','أن','تصدر','أسبوعياً','أو','شهرياً','أو','نصف','شهرياً','أو','فصليا','أي','كل','ثلاثة','أشهر،','كما','تختلف','المجلة','عن','الجريدة','في','نوعية','الورق','ووجود','غلاف','وقطع','مختلف'
        );

}
