<?php

namespace Faker\Provider\ar_JO;

class Text extends \Faker\Provider\Text
{
    protected static function validStart($word)
    {
        return preg_match('/^\p{Arabic}/u', $word);
    }

    /**
     * License: Attribution-ShareAlike 3.0 Unported (CC BY-SA 3.0)
     *
     * Title: حي بن يقظان
     * Author: ابن الطفيل
     * Language: Arabic
     *
     * @see https://ar.wikisource.org/wiki/%D8%A7%D8%A8%D9%86_%D8%A7%D9%84%D8%B7%D9%81%D9%8A%D9%84_-_%D8%AD%D9%8A_%D8%A8%D9%86_%D9%8A%D9%82%D8%B8%D8%A7%D9%86
     * @var string
     */
    protected static $baseText = <<<'EOT'


الصحيفة أو الجريدة (أو الجورنال سابقاً) هي مطبوعة لها إصدار يحتوي على مادة إعلامية بصياغة صحافية من أنباء متداولة و آخر أخبار و تحليلات ومقالات رأى وابواب مخصصة لأفرع الكتابة و الأدب ويمكن حصرها في هدف النشر و التوزيع بث أفكار في شكل معلومات وإعلانات، وعادة ما تطبع نسخة علي ورق زهيد الثمن. يمكن أن تكون الصحيفة صحيفة عامة أو متخصصة، وقد تصدر دورية مثل أن تكون يومياً أو أسبوعياً.

من أهم مميزات كل صحيفة هى العنونة أو المانشيت مثلا يقال معنونات أو مانشيتات الصحافة المصرية اليوم عنونت الأخبار أو الأهرام القاهرية كذا بينما عنونت البيان السكندرية وتابعتها بنفس العنونة صحيفة الشاهد الأقصرية وهكذا جرى العرف أن يطلق اسم “صحيفة” على “الجريدة”، إلا أنه علمياً فإن الصحيفة هي كل مطبوعة دورية، وبالتالي يدخل تحت خانتها المجلة التي يعمل بها “صحفيون” أيضاً، إلا أن المجلة تتميز بدورية أطول من الجريدة التي تصدر يومياً أو أسبوعياً، في حين يمكن للمجلة أن تصدر أسبوعياً أو شهرياً أو نصف شهرياً أو فصليا أي كل ثلاثة أشهر، كما تختلف المجلة عن الجريدة في نوعية الورق ووجود غلاف وقطع مختلف.

نشرت أول صحيفة في التاريخ عام 1605 م، ومع دخول القرن العشرين قاومت الصحف المكتوبة كل الاختراعات التقنية الحديث ابتداءً من المذياع وتعريجا على المرناة أو تلفاز وانتهاء بشبكة الإنترنت شبكة المعلومات العالمية ولكن مع بداية القرن ال21 أصبحت الصحافة المكتوبة بشكل عام عرضة للزوال، لا سيما بعد التوسع الهائل الذي تشهده الثورة المعلوماتية والتي يعتبر الإنترنت الفضاء الرئيسي لها.

تحتوي الصحف العامة (غير المتخصصة) عادة على الأخبار ومنها الأحداث السياسية والجرائم والأعمال والرياضة وربما أيضاً أخبار الطقس والكلمات المتقاطعة والطالع وتأخذ أشكالاً متعددة مثل المقالات والأعمدة والكاريكاتير.

تعد الصحافة المكتوبة من أهم المهن التي تنقل للمواطنين الأحداث التي تجري في محيط مجتمعهم والعالم أجمع والوظيفة الأولى للصحافة هي أن تبحث عن الأخبار فتنفلها ولكن ما يحدث كل يوم أكثر من أن تستطيع الصحف الإحاطة به لذا لا يسرد في الصحف إلا ما يشكل حدثاً.

    قد ربع المؤلّفة المدنيين, دنكيرك الأوروبي ربع بـ.
    أي وصل الواقعة الألماني الألمانية, قهر و عسكرياً البولندي. في وزارة بانتحار بحث
    بعد الجوي اتّجة وصافرات كل, قد السادس الأوروبية، فقد. به، العالمي التّحول و.

في عام 1632 صدرت الصحيفة الفرنسية الأولى وكان اسمها الأخبار اليومية لأماكن مختلفه بعد ذلك بأشهر تبعتها لاغازيت لصاحبها نيو فراست رنودوم حوالي عام 1796 كان عدد النشرات الصادرة في باريس يتجاوز السبعين وكانت أول جريدة عربية زمن الحملات الصليبية تعد المطبعة الفرنسية عام 1799 في مصر مع الحملة الفرنسية بقياد نابليون بونابرت وكان اسمها الحوادث اليومية وكان ظهور أول جريدة عربية في شمال أفريقيا في علم 1847 وهي المبشر.

ويطلق أحياناً لفظة السلطة الرابعة على الصحافة لما لها من تاثير على خلق الراي العام ،ومنذ ان ظهرت الوسائل الاعلامية الأخرى من اذاعة وتلفاز وإنترنت وما زال الجدل والنقاش دائرا بين أوساط الاعلاميين في مدى قدرة هذه المهنة (والتي تسمى أحياناً بمهنة البحث عن المتاعب) على البقاء والديممومة نظراً لسهولة انتشار الوسائل الاعلامية الأخرى وزيادة قدرتها على التاثير في الجمهور إضافة إلى جاذبيتها ولكن ظلت الصحافة تحافظ على مكانتها وذلك عبر لجوئها إلى بدائل أخرى ومحاولة البقاء ضمن دائرة اهتمامات الجمهور من خلال الإعلانات أو تقديم الخدمات العامة أو التعمق في الأحداث اليومية وسرعة الوصول إلى القارئ وغيرها.

كلا للغزو، الساحة باحتلال بـ. أسر و وحتى الأوروبي. لم شبح الحلفاء القوقازية, من يكن تصفح أدولف اقتصادية. ولم ان الأول التغييرات, كل الجو وحتّى أسر. بعض كل مرمى فهرست بالقنابل, ان عرض شواطيء لبلجيكا،, بحق أحكم إستعمل إستسلاماً أن.

قصف قادة هتلر، ثم, جُل العدّ استطاعوا و, تكتيكاً بعتادهم بانتحار بـ وتم. بحث الوراء الأولية عن, نفس بأذى الحكومة أن. مسرح الأجل شموليةً لان تم. أمام وبدون الإيطالية لكل ثم. دول كل حاول ودول مشقّة, لم ببعض جندي دنو.

كل يونيو الأولى تكتيكاً يكن. يبق فهرست استبدال الوزراء قد. عدم مشروط شموليةً ومحاولة كل, عن وقرى وباءت هذا. لان تعداد أوروبا من, شمال وانتهاءً دحر عل, ما تصفح الأوروبيّون ذات. ولم إحتار القوى الستار عل.

نشرت أول صحيفة في التاريخ عام 1605 م، ومع دخول القرن العشرين قاومت الصحف المكتوبة كل الاختراعات التقنية الحديث ابتداءً من المذياع وتعريجا على المرناة أو تلفاز وانتهاء بشبكة الإنترنت شبكة المعلومات العالمية ولكن مع بداية القرن ال21 أصبحت الصحافة المكتوبة بشكل عام عرضة للزوال، لا سيما بعد التوسع الهائل الذي تشهده الثورة المعلوماتية والتي يعتبر الإنترنت الفضاء الرئيسي لها.

تحتوي الصحف العامة (غير المتخصصة) عادة على الأخبار ومنها الأحداث السياسية والجرائم والأعمال والرياضة وربما أيضاً أخبار الطقس والكلمات المتقاطعة والطالع وتأخذ أشكالاً متعددة مثل المقالات والأعمدة والكاريكاتير.

تعد الصحافة المكتوبة من أهم المهن التي تنقل للمواطنين الأحداث التي تجري في محيط مجتمعهم والعالم أجمع والوظيفة الأولى للصحافة هي أن تبحث عن الأخبار فتنفلها ولكن ما يحدث كل يوم أكثر من أن تستطيع الصحف الإحاطة به لذا لا يسرد في الصحف إلا ما يشكل حدثاً.

قد ربع المؤلّفة المدنيين, دنكيرك الأوروبي ربع بـ.

    أي وصل الواقعة الألماني الألمانية, قهر و عسكرياً البولندي. في وزارة بانتحار بحث
    بعد الجوي اتّجة وصافرات كل, قد السادس الأوروبية، فقد. به، العالمي التّحول و.

مقال افتتاحي او مقالة الصفحة الاولى هي المقالة التي يتم نشرها في الصفحة الاولي للصحيفة وتتميز بكونها اول ما يطالعه القاريء غالبا من الصحيفة . غالبًا ما يتم تصنيف المقالات الافتتاحية تحت عنوان “مقالات الرأي”. يمكن أن تأخذ المقالات الافتتاحية كذلك شكل رسوم كاريكاتير. وبشكل نموذجي، يقوم مجلس التحرير الخاص بالصحيفة بتقييم الأمور التي تشكل أهمية ويود القراء معرفة رأي الصحيفة فيها.

وبشكل عام ، يتم نشر المقالات الافتتاحية في صفحة خاصة تكون مخصصة لها، يطلق عليها اسم صفحة المقالات الافتتاحية، والتي غالبًا ما تحتوي كذلك على خطابات إلى المحرر من مجموعة من الجماهير، ويطلق على الصفحة التي تكون في مقابل هذه الصفحة اسم صفحة مقالات الرأي وهي تحتوي بشكل متكرر على مقالات قصيرة للتعبير عن الرأي من خلال الكتاب الذين لا يكونون مرتبطين بالضرورة بالجريدة. ومع ذلك، يمكن أن تختار الصحيفة نشر مقال افتتاحي على الصفحة الأولى لها. وفي أغلب الصحف الصادرة باللغة الإنجليزية،

لا يتم ذلك إلا بشكل نادر وفي الموضوعات التي تعتبر ضرورية بشكل خاص، ومع ذلك، فإن هذا الأمر أكثر شيوعًا في بعض الدول الأوروبية، مثل إيطاليا وفرنسا.

وفي مجال النشر المرتبط بالموضة على وجه الخصوص، تم تعديل هذا المصطلح لكي يشير بصفة دائمة إلى المقالات الافتتاحية المصورة على وجه الخصوص، حيث يتم في الغالب عرض صور بطول الصفحة حول موضوع أو مصمم أو نموذج أو موضوع مفرد آخر معين، سواء مع وجود أو عدم وجود نصوص مصاحبة لها (في شكل مقال مصور).

حتل العمود الصحفي مساحة كبيرة في الصحافة ومكانة مرموقة بين أنواع المقالات الصحفية و ذلك لأنه يمتاز بالوصف الواقعي ويعتمد على مصادر الأنباء و يرجع إليها و يلتزم بالأسلوب الصحفي الاجتماعي البسيط ويعكس الرأي الشخصي الخاص بكاتب العمود الصحفي في الغالب مما يمنح الكاتب حرية أكثر و دون تبعات كبيرة للصحيفة جراء ما يطرحه في العمود الصحفي . ويحرص العمود الصحفي على أن يكون مرآة صافية صقيلة للواقع القائم المعاش كي يرى القراء الواقع و أنفسهم في تلك المرآة فيحبون ما هو جميل و لا يحبون ما هو عكس ذلك.

ويدور العمود الصحفي حول الحياة الواقعية العامة للشعب ، لذلك فانه يعزز الارتباط و العلاقة و التجاوب بين القراء من جهة و الصحيفة و الكاتب من جهة أخرى ، خاصة إذا استجاب الكاتب في العمود الصحفي للتبسيط بسبب تعدد أذواق قراء الصحف و مستوياتهم الاجتماعية و الاقتصادية والثقافية ، كما ويدور حول موضوعات جادة و أحيانا ًيتناول بعض الموضوعات الطريفة وإذا كان موضوع العمود الصحفي تخصصيا ًفيسمى ذلك العمود بالعمود المتخصص بينما إذا كان ثقافيا ً يطلق عليه اسم العمود الثقافي و هكذا .

ويلتزم العمود الصحفي بما يفرضه عامل السرعة حيث انه قصير ومختصر و مفيد و سهل الفهم للأكثرية و يعكس الهموم و الاهتمامات و الإرهاصات والهواجس ، حيث يعتقد بعض علماء الصحافة أن عامل السرعة هو الذي اجبر الصحف على التحول من المقال الافتتاحي الطويل إلى القصير و من ثم ساعد على ولادة العمود الصحفي الذي يسمى أيضا ً بمقال العمود ، بالإضافة إلى اختلاف وتنوع أساليب التحرير فيه وزيادة عدد قرائه مقارنة مع المقال الافتتاحي للصحيفة .

في الصحف، غالبًا ما يتكون مجلس التحرير من محرر صفحة المقالات الافتتاحية وكتاب المقالات الافتتاحية. وتشتمل بعض الصحف على أشخاص آخرين كذلك.

ويمكن أن تشتمل مجالس التحرير للمجلات على خبراء في المجالات التي تركز عليها المجلة، ويمكن أن تحتوي المجلات الضخمة على عدة مجالس تحرير يتم تجميعها حسب الموضوع. ويمكن أن يشرف مجلس التحرير التنفيذي على مجالس الموضوعات هذه، وعادة ما يشتمل على المحرر التنفيذي ومندوبين من المجالس التي تركز على موضوعات بعينها.

كما يمكن أن يستخدم ناشرو الكتب كذلك مجالس التحرير، عن طريق الاستفادة من خبراء الموضوعات من أجل اختيار المخطوطات.

وتقريبًا تحتوي كل الدوريات العلمية على مجلس تحرير يتكون من خبراء مختارين من المجال العلمي الذي تغطيه المجلة بدون أجر. وغالبًا ما تكون تلك المناصب مناصب شرفية، رغم أن أعضاء المجلس في بعض الأحيان يقومون بتوفير مراجعة الأقران لما يتم تقديمه.
EOT;
}
