<?php

namespace Faker\Provider\zh_TW;

class Person extends \Faker\Provider\Person 
{

    protected static $maleNameFormats = array(
        '{{lastName}}{{firstNameMale}}',
    );

    protected static $femaleNameFormats = array(
        '{{lastName}}{{firstNameFemale}}',
    );

    /**
     * Override firstNameMail()
     **/
    public static function firstNameMale()
    {
        return static::randomElement(static::$firstName1Male) . static::randomElement(static::$firstName2Male);
    }

    /**
     * Override firstNameFemale()
     **/
    public static function firstNameFemale()
    {
        return static::randomElement(static::$firstName1Female) . static::randomElement(static::$firstName2Female);
    }

    protected static $lastName = array(
        //百家姓
        '趙','錢','孫','李','周','吳','鄭','王','馮','陳','褚','衛','蔣','沈','韓','楊','朱','秦','尤','許','何','呂','施','張','孔','曹','嚴','華','金','魏','陶','姜',
        '戚','謝','鄒','喻','柏','水','竇','章','雲','蘇','潘','葛','奚','范','彭','郎','魯','韋','昌','馬','苗','鳳','花','方','俞','任','袁','柳','酆','鮑','史','唐',
        '費','廉','岑','薛','雷','賀','倪','湯','滕','殷','羅','畢','郝','鄔','安','常','樂','於','時','傅','皮','卞','齊','康','伍','余','元','卜','顧','孟','平','黃',
        '和','穆','蕭','尹','姚','邵','湛','汪','祁','毛','禹','狄','米','貝','明','臧','計','伏','成','戴','談','宋','茅','龐','熊','紀','舒','屈','項','祝','董','梁',
        '杜','阮','藍','閔','席','季','麻','強','賈','路','婁','危','江','童','顏','郭','梅','盛','林','刁','鐘','徐','邱','駱','高','夏','蔡','田','樊','胡','凌','霍',
        '虞','萬','支','柯','咎','管','盧','莫','經','房','裘','繆','干','解','應','宗','宣','丁','賁','鄧','郁','單','杭','洪','包','諸','左','石','崔','吉','鈕','龔',
        '程','嵇','邢','裴','陸','榮','翁','荀','羊','於','惠','甄','魏','加','封','芮','羿','靳','糜','松','井','段','富','巫','烏','焦','巴','弓',
        '牧','隗','山','谷','車','侯','宓','蓬','全','郗','班','仰','秋','仲','伊','宮','寧','仇','甘','厲','戎','祖','武','符','劉','姜','詹','束','龍',
        '葉','幸','司','韶','郜','黎','薊','薄','印','宿','白','懷','蒲','台','從','鄂','索','咸','籍','賴','卓','藺','屠','蒙','池','喬','陰','郁','胥','能','蒼','雙',
        '聞','莘','黨','翟','譚','貢','勞','逄','姬','申','扶','堵','冉','宰','酈','雍','卻','璩','桑','桂','濮','牛','壽','通','邊','扈','燕','冀','郟','浦','尚','農',
        '溫','別','莊','晏','柴','瞿','閻','充','慕','連','茹','習','宦','艾','魚','容','向','古','易','慎','戈','廖','庚','終','暨','居','衡','步','都','耿','滿','弘',
        '匡','國','文','寇','廣','祿','闕','東','毆','殳','沃','利','蔚','越','夔','隆','師','鞏','厙','聶','晁','勾','敖','融','冷','訾','辛','闞','那','簡','饒','空',
        '曾','鞠','豐','巢','關','蒯','相','查','後','江','紅','游','竺','權','南宮','司馬','上官','歐陽','夏侯','諸葛','聞人','東方','赫連','皇甫','尉遲','公羊','澹台','公冶','濮陽','淳于','仲孫','太叔','申屠','宇文','司徒','長孫','慕容','軒轅','令狐','公孫'
    );

    protected static $firstName1Male = array(
        '偉', '成', '承', '安', '賓', '德', '高', '光', '國', '冠',
        '昊', '浩', '皓', '和', '弘', '宏', '鴻', '華', '嘉',
        '建', '堅', '健', '經', '景', '俊', '天', '峻', '季',
        '', '', '', '', ''
    );

    protected static $firstName2Male = array(
        '邦', '福', '歌', '國', '和', '康', '瀾', '民', '寧', '平', '然', '順',
        '翔', '晏', '宜', '怡', '易', '志', '然', '雄',
        '白', '鴻', '實', '彬', '炳', '郁', '斌', '蔚', '海', '光', '鴻', '峻',
        '濤', '瀚', '超', '達', '厚', '簡', '明', '容', '贍', '涉', '實', '濤',
        '文', '學', '雅', '延', '藝', '易', '裕', '遠',
        '捷', '良', '藝', '英', '哲', '俊', '和', '弘', '化', '濟', '禮', '龍',
        '仁', '雙', '天', '文', '業', '益', '蔭', '周', '安', '弼', '德', '恩',
        '福', '基', '教', '平', '嗣', '天', '望', '宣', '顏', '業', '悅', '允',
        '運', '載', '澤', '志',
        '本', '海', '厚', '華', '輝', '惠', '容', '潤', '壽', '水', '馨', '曜',
        '業', '義', '庸', '佑', '宇', '元', '運', '澤', '明',
        '豪', '潔', '捷', '毅', '昂', '岑', '暢', '超', '馳', '達', '澹', '飛',
        '芬', '峰', '峰', '歌', '格', '寒', '翰', '傑', '潔', '峻', '朗', '麗',
        '邈', '旻', '明', '爽', '興', '軒', '雅', '揚', '陽', '義', '誼', '逸',
        '懿', '原', '遠', '韻', '卓', '赫', '華', '輝', '濟', '霽', '亮', '臨',
        '明', '啟', '熙', '耀', '譽', '遠', '安', '興', '源', '宇', '玉',
        '昱', '日', '暢', '滌', '亮', '忍', '容', '潤', '涵', '煦', '蓄', '衍',
        '意', '映', '育', '采', '池', '飛', '海', '翮', '林', '墨', '學', '音',
        '玥', '藻', '海', '漠', '蒼', '昊', '空', '乾', '穹', '然', '然', '天',
        '焱', '英', '波', '博', '初', '大', '宕', '蕩', '歌', '廣', '涆', '瀚',
        '浩', '慨', '曠', '闊', '漫', '淼', '渺', '邈', '氣', '然', '穰', '壤',
        '思', '言', '軒', '藹', '安', '璧', '昶', '暢', '風', '歌', '光', '平',
        '洽', '愜', '順', '碩', '頌', '泰', '悌', '通', '同', '煦', '雅', '宜',
        '怡', '玉', '裕', '豫', '悅', '韻', '澤', '正', '志', '軒', '博', '大',
        '方', '光', '和', '厚', '化', '濟', '闊', '亮', '量', '深', '盛', '圖',
        '偉', '文', '新', '雅', '揚', '業', '義', '益', '毅', '懿', '致', '壯',
        '伯', '博', '才', '暢', '達', '大', '放', '富', '峻', '浚', '愷', '曠',
        '闊', '朗', '茂', '邈', '儒', '深', '勝', '盛', '爽', '碩', '偉', '揚',
        '義', '逸', '毅', '遠', '壯', '寶', '波', '博', '才', '彩', '暢', '疇',
        '達', '德', '飛', '風', '福', '光', '暉', '朗', '文', '熙', '羲', '禧',
        '信', '軒', '煊', '煊', '雪', '羽', '遠', '雲', '運', '哲', '禎', '振',
        '志', '卓', '奧', '采', '彩', '燦', '藏', '池', '翰', '皓', '暉', '輝',
        '茂', '美', '清', '榮', '容',
        '賜', '德', '福', '良', '茂', '木', '慕', '納', '年', '平', '慶', '榮',
        '容', '瑞', '勝', '石', '實', '樹', '澍', '熙', '禧', '祥', '歆', '許',
        '勳', '言', '誼', '懿', '穎', '佑', '玉', '譽', '悅', '運', '澤', '珍',
        '禎', '志', '致', '白', '壁', '秉', '成', '誠', '安', '白', '柏', '本',
        '弼', '德', '華', '明', '茗', '木', '樹', '同', '修', '業', '義', '元',
        '章', '中', '柏', '鑫', '程', '瑜', '鵬', '賦', '亙', '國', '略', '綸',
        '緯', '武', '業', '義', '藝', '澄', '福', '煥', '輝', '輝', '龍', '明',
        '山', '勝', '鑠', '天', '同', '曜', '琪', '昊', '浩', '艾', '拔', '弼',
        '才', '材', '馳', '楚', '達', '德', '發', '風', '豪', '健', '傑', '捷',
        '郎', '力', '良', '邁', '茂', '美', '民', '名', '明', '楠', '能', '人',
        '爽', '悟', '晤', '俠', '賢', '雄', '雅', '彥', '逸', '英', '友', '語',
        '譽', '遠', '哲', '喆', '智', '熙', '萌', '同'
    );

    protected static $firstName1Female = array(
        '雅', '含', '谷', '飛', '芳', '安', '碧', '采', '虹', '瑩',
        '慧', '寒', '晶', '靜', '家', '娟', '麗', '蘭', '玲', '鈴',
        '佳', '嘉', '潔', '凌', '靈', '婉', '嬌', '恬', '淑', '玟',
        '思', '惜', '欣', '心', '秀', '湘', '文', '雨', '憶', '瑩',
        '語', '雲', '韻', '玉', '珠', '寶', '珍', '金', '銀', '珊',
        '瓊', '瑤', '琳', '玲', '璧',
        ''  , '', '', ''
    );

    protected static $firstName2Female = array(
        '玉','珠','寶','珍','金','銀','珊','瑩','瓊','瑤','琳','玲',
        '璧','彩','豔','紅','綠','紫','彤','青','翠','秀','美','麗',
        '倩','素','黃','絳','丹','碧','貞','淑','賢','端','莊','嫻',
        '靜','潔','慧','巧','雅','花','蘭','菊','蓮','梅','柳','莉',
        '茜','薇','鳳','凰','鸞','鶯','燕','雁','鵑','釵','環','繡',
        '錦','纓','黛','香','線','瓶','琴'
    );
}