<?php


namespace Faker\Provider\ko_KR;

class Lorem extends \Faker\Provider\Lorem
{

    /**
     * 자주 쓰이는 한국어 낱말
     *
     * @licence https://creativecommons.org/licenses/by-sa/3.0/deed.ko
     * @see     https://wikimediafoundation.org/wiki/Terms_of_Use/
     * @link https://ko.wiktionary.org/wiki/%EB%B6%80%EB%A1%9D:%EC%9E%90%EC%A3%BC_%EC%93%B0%EC%9D%B4%EB%8A%94_%ED%95%9C%EA%B5%AD%EC%96%B4_%EB%82%B1%EB%A7%90_5800
     *
     * @var array
     */
    protected static $wordList = array(
        '것', '하다', '있다', '되다', '수', '하다', '나', '그', '없다', '않다', '사람', '우리', '이', '그', '아니다', '보다', '등', '때', '거', '보다', '같다', '주다', '대하다', '가다', '년', '한', '말', '일', '이', '때문', '말하다', '위하다', '그러나', '오다', '알다', '씨', '그렇다', '크다', '또', '일', '사회', '많다', '안', '좋다', '더', '받다', '그것', '집', '나오다', '따르다', '그리고', '문제', '그런', '살다', '저', '못하다', '생각하다', '모르다', '속', '만들다', '데', '두', '앞', '경우', '중', '어떤', '잘', '그녀', '먹다', '오다', '자신', '문화', '원', '생각', '어떻다', '명', '통하다', '그러다', '소리', '다시', '다른', '이런', '여자', '개', '정도', '뒤', '듣다', '다', '좀', '들다', '싶다', '보이다', '가지다', '함께', '아이', '지나다', '많이', '시간', '너', '주다', '인간', '사실', '나다', '이렇다', '어머니', '눈', '뭐', '점', '의하다', '시대', '다음', '이러하다', '누구', '전', '곳', '여러', '안', '하나', '세계', '버리다', '위', '운동', '퍼센트', '학교', '자기', '가장', '대통령', '가지', '들다', '시작하다', '바로', '어느', '그래서', '무엇', '정부', '모든', '번', '그거', '돈', '국가', '그런데', '날', '여기', '모두', '여성', '친구', '마음', '후', '가다', '놓다', '관계', '아버지', '남자', '어디', '몸', '얼굴', '들어가다', '왜', '나타나다', '말다', '지역', '다르다', '모습', '물', '만나다', '내다', '보이다', '쓰다', '이것', '없이', '이번', '길', '생활', '쓰다', '지금', '뿐', '사이', '방법', '새롭다', '우리나라', '내다', '앉다', '처음', '손', '몇', '그때', '과정', '삶', '갖다', '찾다', '특히', '시', '이상', '지금', '나가다', '이야기', '교육', '사다', '경제', '아직', '잡다', '같이', '선생님', '예술', '서다', '못', '역사', '읽다', '이제', '결과', '내용', '물론', '동안', '책', '일어나다', '당신', '시장', '넣다', '중요하다', '무슨', '느끼다', '어렵다', '힘', '너무', '나라', '부르다', '의미', '자리', '밝히다', '죽다', '이미', '쪽', '정치', '국민', '생명', '얘기', '학생', '연구', '엄마', '이름', '하나', '내리다', '사건', '및', '쉽다', '짓다', '또한', '이유', '또는', '필요하다', '글', '생기다', '사용하다', '남편', '들어오다', '밖', '세상', '작다', '타다', '대학', '작품', '상황', '가운데', '보내다', '두다', '즉', '따라서', '상태', '이후', '당시', '문학', '더욱', '아주', '지방', '밤', '높다', '최근', '채', '현실', '환경', '컴퓨터', '먼저', '다니다', '얼마나', '자체', '열다', '머리', '묻다', '남다', '부분', '기업', '거기', '변화', '아들', '뜻', '아', '기다리다', '떨어지다', '선거', '관하다', '그냥', '나누다', '이용하다', '거의', '곧', '중심', '활동', '오늘', '서로', '관심', '역시', '이거', '애', '광고', '나다', '방', '정신', '이르다', '땅', '이루다', '아침', '웃다', '현상', '두다', '떠나다', '기술', '전체', '그래', '얻다', '분', '아름답다', '끝', '민족', '간', '조사', '듯', '입', '뭐', '그대로', '영화', '필요', '줄', '하늘', '년대', '과학', '듯하다', '자연', '정말', '구조', '결국', '밥', '입다', '오히려', '프로그램', '네', '이루어지다', '남', '하루', '그림', '적', '터', '마시다', '치다', '혼자', '나가다', '이제', '교수', '술', '사랑', '의식', '전화', '끝나다', '돌아오다', '맞다', '아빠', '걸리다', '지키다', '한번', '커피', '가슴', '길다', '바라보다', '알아보다', '회사', '맛', '대부분', '산업', '매우', '오르다', '음식', '표정', '꼭', '일부', '요즘', '계획', '느낌', '얼마', '고개', '성격', '계속', '세기', '세우다', '아내', '가족', '현재', '세', '놓다', '발전', '차', '놀다', '향하다', '관련', '형태', '각', '도시', '작업', '분위기', '그러하다', '자기', '나이', '우선', '믿다', '바꾸다', '낳다', '바', '정보', '열리다', '좋아하다', '그리다', '만큼', '배우다', '시', '역할', '옆', '행동', '어', '국내', '비하다', '기관', '입장', '만하다', '예', '아래', '방식', '영향', '그럼', '나서다', '흐르다', '저', '깊다', '배', '내', '모양', '산', '새', '하지만', '조건', '문', '꽃', '단계', '올리다', '그동안', '교사', '갑자기', '넘다', '지니다', '바람', '잘하다', '마을', '어리다', '대표', '가능성', '방향', '대회', '목소리', '노래', '바다', '힘들다', '공부', '움직이다', '의원', '노력', '못하다', '전혀', '언니', '단체', '분', '알려지다', '가능하다', '능력', '주장하다', '자식', '돌리다', '불', '주민', '모으다', '자료', '존재', '학년', '신문', '가지다', '이해하다', '제품', '분야', '선생', '돌아가다', '사업', '행위', '수준', '지난해', '표현', '기분', '대', '젊다', '동시', '옷', '기능', '순간', '전쟁', '전', '꿈', '할머니', '회의', '방송', '이야기하다', '나무', '자다', '연극', '오늘', '마찬가지', '걷다', '노동', '이때', '과거', '가치', '시간', '집단', '현대', '살펴보다', '장관', '차이', '풀다', '시절', '물건', '직접', '개인', '근데', '발', '작가', '효과', '불교', '끌다', '대로', '빨리', '시작되다', '둘', '말다', '설명하다', '우주', '시기', '마치', '살', '생산', '바라다', '강하다', '경험', '음악', '최고', '나타내다', '아프다', '적다', '비', '고향', '놀라다', '다양하다', '울다', '농민', '드러나다', '은행', '지내다', '결혼', '동생', '법', '소설', '예', '오후', '질서', '담다', '모이다', '시민', '회장', '빠르다', '스스로', '아기', '아저씨', '옛날', '이날', '제대로', '달', '던지다', '참', '공간', '이곳', '딸', '마지막', '벌이다', '병원', '자세', '강조하다', '경찰', '맡다', '저녁', '한편', '그러면', '기자', '넓다', '시험', '잠', '주로', '훨씬', '면', '통일', '들어서다', '건강', '가깝다', '건물', '시설', '외국', '밑', '어른', '주변', '대신', '원인', '팔다', '차례', '군', '열심히', '일하다', '재산', '조금', '팀', '부모', '약간', '언어', '요구하다', '올라가다', '첫', '감독', '그날', '사실', '자주', '당하다', '삼다', '약', '기간', '담배', '일으키다', '일단', '할아버지', '조직', '태어나다', '공장', '벌써', '즐기다', '지', '환자', '변하다', '사고', '그래도', '아무리', '맞추다', '쌀', '일반', '재미있다', '가르치다', '대화', '막다', '올해', '형', '달리', '버리다', '붙이다', '인물', '늘', '모두', '전국', '마치다', '전', '다만', '도움', '가정', '걸다', '빠지다', '멀다', '버스', '오늘날', '잠시', '농업', '대다', '식', '의견', '무대', '사진', '주장', '표현하다', '인하다', '이상하다', '제일', '붙다', '아마', '얘기하다', '잇다', '조금', '경기', '목적', '태도', '남성', '주위', '대책', '그만', '발생하다', '다리', '아무', '어쩌다', '재료', '각각', '결코', '옮기다', '항상', '해', '잃다', '자유', '책임', '바뀌다', '비슷하다', '심하다', '경쟁', '달러', '사랑하다', '아니', '여름', '자라다', '회', '구체적', '기회', '실시하다', '지구', '번째', '소비자', '싫다', '규모', '기준', '말', '반드시', '셈', '갖추다', '그러니까', '받아들이다', '값', '현장', '건설', '꺼내다', '노동자', '동네', '언제나', '완전히', '자동차', '전하다', '존재하다', '개월', '맞다', '별로', '어린이', '정하다', '한마디', '유지하다', '이데올로기', '공부하다', '대중', '늘어나다', '닦다', '만', '말씀', '괜찮다', '눈물', '각종', '빛', '아니', '피하다', '거치다', '나아가다', '야', '지식', '현재', '여전히', '주인', '발견하다', '선', '인류', '특징', '드리다', '선수', '형식', '마련하다', '반', '발표하다', '주제', '걸치다', '겪다', '관점', '귀', '기본', '미터', '사라지다', '어떠하다', '감정', '기억', '놈', '인기', '배', '아파트', '가끔', '구성', '술', '실제로', '짧다', '고맙다', '관리', '그곳', '달다', '보다', '비롯하다', '과연', '들리다', '달리다', '바쁘다', '이전', '인정하다', '자', '중앙', '나쁘다', '불구하다', '시키다', '게임', '국제', '그룹', '인생', '전통', '기르다', '잔', '조사하다', '커다랗다', '있다', '시인', '언제', '외', '평가', '내려오다', '위치', '줄이다', '가격', '달라지다', '비다', '삼국', '손님', '원하다', '통신', '확인하다', '모임', '수', '아무', '웃음', '기계', '모양', '물질', '아나운서', '뉴스', '살아가다', '펴다', '배', '수업', '겨울', '종교', '층', '자연스럽다', '장', '돌다', '식사', '안다', '이해', '잊다', '제시하다', '반', '불과하다', '혹은', '엄청나다', '편', '텔레비전', '파악하다', '편', '실천', '노력하다', '보호', '씻다', '한편', '늦다', '이웃', '편지', '공동', '까닭', '방안', '센티미터', '팔', '분명하다', '분석', '소녀', '지나가다', '차', '상품', '설명', '훌륭하다', '관계자', '새로', '세', '이어지다', '티브이', '봄', '종류', '낮다', '어깨', '지적하다', '부부', '오래', '요구', '키우다', '눕다', '발달하다', '발전하다', '여행', '죽음', '고통', '등장하다', '공', '듯이', '어울리다', '오월', '쉬다', '알리다', '차다', '과', '멀리', '빼다', '예정', '오빠', '즐겁다', '한계', '흔히', '바탕', '사월', '싸우다', '언제', '예쁘다', '갈등', '느껴지다', '의지', '전문', '정확하다', '초기', '나중', '등', '맛있다', '며칠', '신경', '찾아오다', '미', '사용', '시선', '아무런', '언론', '투자', '지원', '결정하다', '경영', '목표', '성장', '숲', '없어지다', '작년', '내려가다', '떠오르다', '미치다', '새벽', '쓰레기', '얼른', '임금', '피해', '한', '무섭다', '직장'
    );


    /**
     * Generate a random sentence
     *
     * @param integer $nbWords around how many words the sentence should contain
     * @param boolean $variableNbWords set to false if you want exactly $nbWords returned,
     *                                  otherwise $nbWords may vary by +/-40% with a minimum of 1
     * @return string
     * @example 'Lorem ipsum dolor sit amet.'
     */
    public static function sentence($nbWords = 6, $variableNbWords = true)
    {
        if ($nbWords <= 0) {
            return '';
        }
        if ($variableNbWords) {
            $nbWords = self::randomizeNbElements($nbWords);
        }

        $words = static::words($nbWords);

        // $words[0] = ucwords($words[0]); // Korean is not support this function.

        return implode(' ', $words) . '.';
    }


    /**
     * Generate a text string.
     * Depending on the $maxNbChars, returns a string made of words, sentences, or paragraphs.
     *
     * @example 'Sapiente sunt omnis. Ut pariatur ad autem ducimus et. Voluptas rem voluptas sint modi dolorem amet.'
     *
     * @param  integer $maxNbChars Maximum number of characters the text should contain (minimum 5)
     *
     * @return string
     */
    public static function text($maxNbChars = 200)
    {
        if ($maxNbChars < 5) {
            throw new \InvalidArgumentException('text() can only generate text of at least 5 characters');
        }

        $type = ($maxNbChars < 25) ? 'word' : (($maxNbChars < 100) ? 'sentence' : 'paragraph');

        $text = array();
        while (empty($text)) {
            $size = 0;

            // until $maxNbChars is reached
            while ($size < $maxNbChars) {
                $word   = ($size ? ' ' : '') . static::$type();
                $text[] = $word;

                $size += strlen($word);
            }

            array_pop($text);
        }

        if ($type === 'word') {
            // capitalize first letter
            //$text[0] = ucwords($text[0]); // Korean is not support this function.

            // end sentence with full stop
            $text[count($text) - 1] .= '.';
        }

        return implode('', $text);
    }
}
