<?php

namespace Faker\Provider\ar_JO;

class Address extends \Faker\Provider\Address
{
    protected static $streetPrefix = array('شارع');

    protected static $cityPrefix = array('شمال', 'شرق', 'غرب', 'جنوب', 'وسط', );

    /**
     * {@link} http://ar.wikipedia.org/wiki/%D9%85%D9%84%D8%AD%D9%82:%D9%82%D8%A7%D8%A6%D9%85%D8%A9_%D9%85%D8%AF%D9%86_%D8%A7%D9%84%D8%A3%D8%B1%D8%AF%D9%86
     **/
    protected static $cityName = array(
    'عمان', 'الزرقاء', 'اربد', 'العقبة', 'البلقاء', 'مادبا', 'الجبيهه', 'مخيم البقعه', 'المفرق', 'جرش', 'معان', 'الهاشمية', 'الطفيلة', 'كفرنجه', 'عجلون', 'الحصن', 'الكرك', 'الصريح', 'ايدون', 'بيت راس', 'عنجره'
    );

    protected static $buildingNumber = array('#####', '####', '##');

    protected static $postcode = array('#####', '#####-####');

    /**
     * {@link} http://ar.wikipedia.org/wiki/%D9%85%D9%84%D8%AD%D9%82:%D9%82%D8%A7%D8%A6%D9%85%D8%A9_%D8%A7%D9%84%D9%88%D9%84%D8%A7%D9%8A%D8%A7%D8%AA_%D8%A7%D9%84%D8%A3%D9%85%D8%B1%D9%8A%D9%83%D9%8A%D8%A9_%D8%AD%D8%B3%D8%A8_%D8%A7%D9%84%D9%85%D8%B3%D8%A7%D8%AD%D8%A9
     **/
    protected static $state = array(
     'ألاسكا', 'تكساس', 'كاليفورنيا', 'مونتانا', 'نيو ميكسيكو', 'أريزونا', 'نيفادا', 'كولورادو', 'أوريجون', 'وايومنغ', 'ميشيغان', 'مينيسوتا', 'يوتاه', 'أيداهو', 'كانساس', 'نبراسكا', 'داكوتا الجنوبية', 'واشنطن', 'داكوتا الشمالية', 'أوكلاهوما', 'ميسوري', 'فلوريدا', 'ويسكنسن', 'جورجيا', 'إلينوي', 'أيوا', 'نيويورك (ولاية)', 'كارولينا الشمالية', 'أركنساس', 'الاباما', 'لويزيانا', 'مسيسيبي', 'بنسيلفانيا', 'أوهايو', 'فرجينيا', 'تينيسي', 'كنتاكي', 'إنديانا', 'ماين', 'كارولينا الجنوبية', 'فرجينيا الغربية', 'ميريلاند', 'هاواي', 'ماساتشوستس', 'فيرمونت', 'نيوهامشير', 'نيو جيرسي', 'كونيتيكت', 'ديلاوير', 'رود آيلاند', 'واشنطن العاصمة', 'بورتو ريكو', 'جزر ماريانا الشمالية', 'الجزر العذراء الأمريكية', 'ساموا الأمريكية', 'غوام',  'أركنساس', 'آيوا', 'أريزونا', 'ألاباما', 'ألاسكا', 'إلينوي', 'إنديانا', 'أوريغون', 'أوكلاهوما', 'أوهايو', 'أيداهو', 'بنسيلفانيا', 'تكساس', 'تينيسي', 'جورجيا', 'داكوتا الجنوبية', 'داكوتا الشمالية', 'ديلاوير', 'رود آيلاند', 'فيرجينيا', 'فيرجينيا الغربية', 'فلوريدا', 'فيرمونت', 'كارولاينا الجنوبية', 'كارولاينا الشمالية', 'كاليفورنيا', 'كانساس', 'كونيتيكت', 'كنتاكي', 'كولورادو', 'لويزيانا', 'ماريلاند', 'ماساتشوستس', 'مسيسيبي', 'ميشيغان', 'مونتانا', 'ميزوري', 'مين', 'مينيسوتا', 'نبراسكا', 'نيفادا', 'نيو جيرسي', 'نيومكسيكو', 'نيوهامشير', 'نيويورك', 'هاواي', 'واشنطن', 'وايومنغ', 'يوتا', 'ويسكنسن',
    );
    protected static $stateAbbr = array(
       'AK', 'AL', 'AR', 'AZ', 'CA', 'CO', 'CT', 'DC', 'DE', 'FL', 'GA', 'HI', 'IA', 'ID', 'IL', 'IN', 'KS', 'KY', 'LA', 'MA', 'MD', 'ME', 'MI', 'MN', 'MO', 'MS', 'MT', 'NC', 'ND', 'NE', 'NH', 'NJ', 'NM', 'NV', 'NY', 'OH', 'OK', 'OR', 'PA', 'RI', 'SC', 'SD', 'TN', 'TX', 'UT', 'VA', 'VT', 'WA', 'WI', 'WV', 'WY'
    );

    /**
     * {@link} http://www.nationsonline.org/oneworld/countrynames_arabic.htm
     **/
    protected static $country = array(
        'أفغانستان', 'ألبانيا', 'الجزائر', 'ساموا-الأمريكي', 'أندورا', 'أنغولا', 'أنغويلا', 'أنتاركتيكا', 'أنتيغوا وبربودا', 'الأرجنتين', 'أرمينيا', 'أروبا', 'أستراليا', 'النمسا', 'أذربيجان', 'الباهاماس', 'البحرين', 'بنغلاديش', 'بربادوس', 'روسيا البيضاء', 'بلجيكا', 'بيليز', 'بنين', 'جزر برمود', 'بوتان', 'بوليفيا', 'البوسنة و الهرسك', 'بوتسوانا', 'البرازيل', 'بروني', 'بلغاريا', 'بوركينا فاسو', 'بوروندي', 'كمبوديا', 'كاميرون', 'كندا', 'الرأس الأخضر', 'جمهورية أفريقيا الوسطى', 'تشاد', 'شيلي', 'جمهورية الصين الشعبية', ' ', 'كولومبيا', 'جزر القمر', 'جمهورية الكونغو الديمقراطية', 'جمهورية الكونغو', 'جزر كوك', 'كوستاريكا', 'ساحل العاج', 'كرواتيا', 'كوبا', 'قبرص', 'الجمهورية التشيكية', 'الدانمارك', 'جيبوتي', 'دومينيكا', 'الجمهورية الدومينيكية', 'تيمور الشرقية', 'إكوادور', 'مصر', 'إلسلفادور', 'غينيا الاستوائي', 'إريتريا', 'استونيا', 'أثيوبيا', 'جزر فوكلاند', 'جزر فارو', 'فيجي', 'فنلندا', 'فرنسا', 'غويانا الفرنسية', 'بولينيزيا الفرنسية', 'الغابون', 'غامبيا', 'جيورجيا', 'ألمانيا', 'غانا', 'اليونان', 'جرينلاند', 'غرينادا', 'جزر جوادلوب', 'جوام', 'غواتيمال', 'غينيا', 'غينيا-بيساو', 'غيانا', 'هايتي', 'الكرسي الرسولي', 'هندوراس', 'هونغ كونغ', 'المجر', 'آيسلندا', 'الهند', 'أندونيسيا', 'إيران', 'العراق', 'جمهورية أيرلندا', 'إسرائيل', 'إيطاليا', 'جمايكا', 'اليابان', 'الأردن', 'كازاخستان', 'كينيا', 'كيريباتي', 'كوريا الشمالية', 'كوريا الجنوبية', 'الكويت', 'قيرغيزستان', 'لاوس', 'لاتفيا', 'لبنان', 'ليسوتو', 'ليبيريا', 'ليبيا', 'ليختنشتين', 'لتوانيا', 'لوكسمبورغ', 'ماكاو', 'جمهورية مقدونيا', 'مدغشقر', 'مالاوي', 'ماليزيا', 'المالديف', 'مالي', 'مالطا', 'جزر مارشال', 'مارتينيك', 'موريتانيا', 'موريشيوس', 'المكسيك', 'ولايات ميكرونيسيا المتحدة', 'مولدافيا', 'موناكو', 'منغوليا', 'الجبل الأسو', 'مونتسيرات', 'المغرب', 'موزمبيق', 'ميانمار', 'ناميبيا', 'ناورو', 'نيبال', 'هولندا', 'جزر الأنتيل الهولندي', 'كاليدونيا الجديدة', 'نيوزيلندا', 'نيكاراجوا', 'النيجر', 'نيجيريا', 'نييوي', 'جزر ماريانا الشمالية', 'النرويج', 'عُمان', 'باكستان', 'بالاو', 'الأراضي الفلسطينية', 'بنما', 'بابوا غينيا الجديدة', 'باراغواي', 'بيرو', 'الفليبين', 'بولندا', 'البرتغال', 'بورتوريكو', 'قطر', 'رومانيا', 'روسيا', 'رواندا', 'سانت كيتس ونيفس', 'سانت لوسيا', 'سانت فنسنت وجزر غرينادين', 'المناطق', 'سان مارينو', 'ساو تومي وبرينسيبي', 'المملكة العربية السعودية', 'السنغال', 'جمهورية صربيا', 'سيشيل', 'سيراليون', 'سنغافورة', 'سلوفاكيا', 'سلوفينيا', 'جزر سليمان', 'الصومال', 'جنوب أفريقيا', 'جنوب السودان', 'إسبانيا', 'سريلانكا', 'السودان', 'سورينام', 'سوازيلند', 'السويد', 'سويسرا', 'سوريا', 'تايوان', 'طاجيكستان', 'تنزانيا', 'تايلندا', 'تبت', 'توغو', 'تونغا', 'ترينيداد وتوباغو', 'تونس', 'تركيا', 'تركمانستان', 'توفالو', 'أوغندا', 'أوكرانيا', 'الإمارات العربية المتحدة', 'المملكة المتحدة', 'الولايات المتحدة', 'أورغواي', 'أوزباكستان', 'فانواتو', 'دولة مدينة الفاتيكان', 'فنزويلا', 'فيتنام', 'الجزر العذراء البريطانية', 'الجزر العذراء الأمريكي', 'والس وفوتونا', 'الصحراء الغربية', 'اليمن', 'زامبيا', 'زمبابوي',
    );
    protected static $cityFormats = array(
        '{{cityPrefix}} {{cityName}}',
        '{{cityName}}',

    );
    protected static $streetNameFormats = array(
        '{{streetPrefix}} {{firstName}} {{lastName}}',
    );
    protected static $streetAddressFormats = array(
        '{{buildingNumber}} {{streetName}}',
        '{{buildingNumber}} {{streetName}} {{secondaryAddress}}',
    );
    protected static $addressFormats = array(
        "{{streetAddress}}\n{{city}}",
    );
    protected static $secondaryAddressFormats = array('شقة رقم. ###', 'بناية رقم #');

    /**
     * @example 'شرق'
     */
    public static function cityPrefix()
    {
        return static::randomElement(static::$cityPrefix);
    }

    /**
     * @example 'عمان'
     */
    public static function cityName()
    {
       return static::randomElement(static::$cityName);
    }

    /**
     * @example 'شارع'
     */
    public static function streetPrefix()
    {
        return static::randomElement(static::$streetPrefix);
    }

    /**
     * @example 'شقة رقم. 350'
     */
    public static function secondaryAddress()
    {
        return static::numerify(static::randomElement(static::$secondaryAddressFormats));
    }

    /**
     * @example 'كاليفورنيا'
     */
    public static function state()
    {
        return static::randomElement(static::$state);
    }

    /**
     * @example 'CA'
     */
    public static function stateAbbr()
    {
        return static::randomElement(static::$stateAbbr);
    }
}
