<?php

namespace Faker\Provider\ar_JO;

class Lorem extends \Faker\Provider\Lorem
{
    /**
     * {@link} http://ar.lipsum.com/
     */
    protected static $wordList = array(
        'أحياناً', 'أخذتها', 'أخرى', 'أصول', 'أقاصي', 'أكثر', 'ألدوس', 'أن', 'أو', 'أول', 'أولاً', 'أي', 'أيضاً', 'إبسوم', 'إدخال', 'إصدار', 'إعادة', 'إفتراضي', 'إلى', 'إليها', 'إليها.', 'إن', 'إيبسوم', 'إيبسوم.', 'إيبسوم،', 'اتضح', 'استخدام', 'اكتشف', 'الأحرف', 'الأحرف.', 'الأخلاق،', 'الأدب', 'الأسفل.', 'الأصلي', 'الأصلية،', 'الأقسام', 'الأنواع', 'الأول', 'الإلكتروني', 'الإلكتروني.', 'الإنترنت', 'الإنترنت.', 'الإنكليزية', 'البحث.', 'البروفيسور', 'البلاستيكية', 'التركيز', 'التكرار،', 'التي', 'الجمل', 'الحاجة،', 'الحديثة', 'الحقيقي.', 'الخارجي', 'الخامس', 'الخير', 'الزمن', 'السائد', 'السطر', 'السنين', 'الشكل', 'الشكلي', 'الصدفة،', 'الصفحة', 'الطباعة', 'العام', 'العبارات', 'العديد', 'العشوائية', 'العهد', 'الغالبية', 'الغاية', 'الغير', 'الفقرات', 'الفكاهية', 'القارئ', 'القدم.', 'القرن', 'القسم', 'القياسي', 'الكتاب', 'الكتاب.', 'الكلاسيكي', 'الكلمات', 'الكلمة', 'اللاتيني', 'اللاتينية', 'اللغة', 'المتوفرة', 'المحتوى', 'المصدر', 'المطابع', 'المعيار', 'المقروء', 'المكتبي', 'المواقع', 'الميلاد.', 'الميلاد،', 'الناتح', 'النشر', 'النشر.', 'النص', 'النص.', 'النص،', 'النموذجية،', 'النهضة.', 'النوادر', 'الويب', 'انتشر', 'انه',
        'بإدخال', 'باستخدام', 'بالبحث', 'بالنسخ', 'بايج', 'ببساطة', 'بترجمتها', 'بحث', 'برامج', 'برامح', 'برص', 'بروفيسور', 'بشكل', 'بصيغها', 'بعض', 'بل', 'بما', 'بمثابة', 'بمعنى', 'بوضع', 'بينما',
        'تأتي', 'تبدو', 'تتبعه', 'تتحقق', 'تتطلبه', 'تحرير', 'تحوي', 'تريد', 'تستخدم', 'تعديلها', 'تعطي', 'تعمل', 'تقضي', 'تكرار', 'تم', 'توزيعاَ', 'توضع', 'توفير', 'تينية،',
        'جامعة', 'جديدة', 'جذور', 'جميع',
        'حتى', 'حد', 'حقيقة', 'حقيقي', 'حوت', 'حول',
        'خالي', 'خلافاَ', 'خمسة',
        'دليل',
        'ذو',
        'رقائق', 'ريتشارد',
        'زمن',
        'ستظهر', 'ستينيّات', 'سطر', 'سيلهي',
        'شابه.', 'شعبية', 'شكل', 'شكلي', 'شيشيرون',
        'صار', 'صفحات', 'صناعات',
        'طبيعياَ',
        'طريق', 'طريقة', 'طويل',
        'ظهرت', 'ظهور',
        'عام', 'عبارات', 'عبر', 'عدة', 'عشر', 'عشوائي', 'عشوائياً،', 'عصر', 'علمية', 'على', 'عليك', 'عمد', 'عن', 'عندما', 'عوضاً',
        'غامضة', 'غير',
        'فإن', 'فتجعلها', 'فلقد', 'في', 'فيرجينيا',
        'قابل', 'قام', 'قامت', 'قاموس', 'قبل', 'قرون', 'قريب', 'قمت', 'قمنا',
        'كإدخال', 'كان', 'كبير', 'كبيرة', 'كتاب', 'كتبه', 'كتيّب', 'كلمات', 'كلمة', 'كنت', 'كنموذج',
        'لأنها', 'لا', 'لائقة', 'لاتينية', 'لتكوين', 'لتكوّن', 'لصفحة', 'للأحرف', 'للإعتقاد', 'للشك.', 'للمفكر', 'للمهتمين', 'للنص', 'لم', 'لمؤلفه', 'لنصوص', 'له', 'لها', 'لهذه', 'لوريم', 'ليتراسيت', 'ليس', 'لينتشر', 'لينتوك', 'مؤخراَ',
        'ما', 'ماك', 'مايكر', 'مثبتة', 'مثل', 'مجموعة', 'مجهولة', 'محتوى', 'محرجة', 'محرك', 'مخبأة', 'مدى', 'مرات', 'مرة', 'مرجع', 'مرفقة', 'مستخدماً', 'مضاف', 'مطبعة', 'مطولة', 'مع', 'مقاطع', 'مقالة', 'مقروء.', 'مما', 'من', 'منذ', 'منطقي',
        'مولّد', 'مولّدات', 'مولّدنا',
        'نتائج', 'نسخ', 'نص', 'نص،', 'نصاَ', 'نصوص', 'نصي', 'نصي،', 'نظرية', 'نفسه',
        'هامبدن سيدني', 'هذا', 'هـ.راكهام', 'هنا', 'هناك', 'هنالك', 'هو', 'هي',
        'و', 'وأحياناً', 'وإذا', 'والتنضيد', 'والتي', 'والذي', 'والشر', 'والمُستخدم', 'وبالتالي', 'وبرامح', 'وبشكله', 'وتم', 'وخلال', 'ودور', 'وعاد', 'وكأنها', 'وكان', 'ولايزال', 'ولذلك', 'ولكن', 'وليس', 'ومختلفة', 'وهذا', 'وهو', 'وهي', 'ويُستخدم',
        'يأتي', 'يتم', 'يجعله', 'يحوي', 'يقرأها.', 'يقوم', 'يكون', 'يوجد',
    );
}
