<?php

namespace Faker\Provider\ar_JO;

class Person extends \Faker\Provider\Person
{
    protected static $maleNameFormats = array(
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{titleMale}} {{firstNameMale}} {{lastName}}',
    );

    protected static $femaleNameFormats = array(
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{titleFemale}} {{firstNameFemale}} {{lastName}}',
    );

    /**
     * {@link} http://muslim-names.us/
     **/ 
    protected static $firstNameMale = array(
      'آدب آدم', 'آساد', 'آسر', 'آصف', 'أبي', 'أدهم', 'أمجد', 'أنيس', 'أواب', 'أويس', 'أيوب', 'إبراهيم',  'إسلام', 'إسماعيل', 'إلسى', 'إلياس', 'إمام', 'إياد', 'إياس', 
'باب', 'باتر', 'باتك', 'باتل', 'بادر', 'بادع', 'بادي', 'باذخ', 'بارز', 'بارع', 'بارق', 'بازي', 'باسل', 'باش', 'باشق', 'باقر', 'باهر', 'باهي',  'بخيت', 'بدار', 'بدر', 'بدرة', 'بدري', 
'تأمور', 'تاج', 'تامر', 'تربان', 'ترف', 'تركي', 'تعليل', 'تعليم', 'تغلب', 'تفان', 'تقي', 'تليد', 'تميم', 'تهامي', 'تواب',  
 'ثابت', 'ثاقب', 'ثامر', 'ثاني', 'ثبار', 'ثروان', 'ثري', 'ثقيف', 'ثمامة', 'ثمود', 'ثمير', 'ثمين', 'ثنيان', 'ثواب', 'ثوبان', 'ثول', 'ثيب', 
'جابر', 'جاد', 'جادل', 'جازم', 'جاسر', 'جاسم', 'جامع', 'جبر', 'جبران', 'جبري', 'جبل', 'جبل', 'جبير', 'جبيل', 'جبيل', 'جذلان', 'جذيمة', 'جرفاس', 'جرهم', 'جريال', 'جرير', 'جزوة', 'جساس', 'جسر', 'جعبة', 
'حاتم', 'حادة', 'حازم', 'حذامي', 'حسام', 'حسين', 'حمدى', 'حمدي', 'حمود', 'حميده', 
'خابر', 'خابور', 'خاتم', 'خادم', 'خارف', 'خازم', 'خازن', 'خاشع', 'خاطر', 'خافق', 'خالد', 'خالص', 'خباب', 'خبيب', 'خبير', 'خداري', 'خز', 'خزاعة', 'خزاعي', 'خزرج', 'خزرجي', 'خزيمة', 'خشاب', 'خشيف', 'خصيب', 
'دؤاد', 'دؤوب', 'دائل', 'دارع', 'داري', 'داعج', 'داعم', 'دالي', 'دامث', 'دانية', 'داهش', 'داود', 'داوود', 'دثار', 'دخيل', 'در', 'دراج', 'درار', 'درباس', 'درع', 'درغام', 'درنوف', 'درويش', 'دري', 'درير', 
'ذؤابة', 'ذؤيب', 'ذئب', 'ذابر', 'ذاخر', 'ذافر', 'ذاكر', 'ذبيان', 'ذخر', 'ذر', 'ذراع', 'ذروة', 'ذروع', 'ذريعة', 'ذزوة', 'ذفر', 'ذكوان', 'ذكي', 'ذليق', 'ذمار', 'ذمام', 'ذمام', 'ذمر', 'ذهب', 'ذهين', 
'راتب', 'راتق', 'راتي', 'راجي', 'رازي', 'راسخ', 'راسل', 'راسم', 'راسي', 'راشد', 'راصد', 'راضي', 'راغب', 'رافع', 'رافه', 'راقي', 'رامور', 'رامي', 'رانف', 'راني', 'راهي', 'راوي', 'رباط', 'ربعي', 'ربيع', 
'زائد', 'زاخر', 'زافر', 'زاكي', 'زامل', 'زاهد', 'زاهر', 'زاهي', 'زبرقان', 'زبير', 'زخر', 'زخري', 'زرياب', 'زريق', 'زعزع', 'زعفران', 'زعيم', 'زغلول', 'زكريا', 'زكي', 'زمام', 'زمان', 'زمزم', 'زمعة', 'زميت', 
'سائف', 'سابغ', 'سابقي', 'ساجع', 'سادن', 'ساري', 'ساعي', 'سالك', 'سالم', 'سامد', 'سامر', 'سامل', 'سامي', 'ساهج', 'ساهر', 'ساير', 'سباعي', 'سباق', 'سبر', 'سبع', 'سبيع', 'سبيعي', 'سجود', 'سخاء', 'سخي', 
'شأس', 'شؤبوب', 'شائع', 'شابن', 'شادي', 'شارف', 'شارق', 'شاطر', 'شاعر', 'شافع', 'شافعي', 'شافي', 'شاكر', 'شامخ', 'شامل', 'شاهب', 'شاهد', 'شاهر', 'شاهق', 'شاهين', 'شباب', 'شباب', 'شبل', 'شبلي', 'شبيب', 
'صائن', 'صابر', 'صادر', 'صادق', 'صارم', 'صاري', 'صاعد', 'صاغي', 'صافن', 'صافي', 'صامت', 'صامد', 'صاهل', 'صبري', 'صبور', 'صخر', 'صدقي', 'صدوق', 'صديق', 'صرخد', 'صعود', 'صفا', 'صفو', 'صفوان', 'صفوة', 
'ضائف', 'ضارع', 'ضاري', 'ضافر', 'ضافي', 'ضامر', 'ضامن', 'ضاهر', 'ضاهري', 'ضاوي', 'ضبع', 'ضبعان', 'ضحى', 'ضرار', 'ضرام', 'ضرغام', 'ضليم', 'ضماضم', 'ضمام', 'ضمير', 'ضميم', 'ضمين', 'ضوء', 'ضياء', 'ضياء العين', 
'ظافر', 'ظالع', 'ظاهر', 'ظاهري', 'ظبيان', 'ظراب', 'ظريف', 'ظفار', 'ظفر', 'ظفري', 'ظفير', 'ظل', 'ظلال', 'ظليل', 'ظليم', 'ظهر', 'ظيان ظهور', 
'طائر', 'طائع', 'طائل', 'طارف', 'طارق', 'طالب', 'طالع', 'طاهر', 'طبع', 'طبيب', 'طخام', 'طراد', 'طرف', 'طرفة', 'طروق', 'طريف', 'طعموس', 'طفيل', 'طلال', 'طلبة', 'طلق', 'طلوق', 'طليق', 'طموم', 'طه', 
   'عاقب', 'عباس', 'عبدي', 'عثمان', 'عدان', 'عدل', 'عدلي', 'عدنان', 'عدوان', 'عدواني', 'عدوي', 'عدي', 'عدي', 'عديل', 'عذب', 'عذبي', 'عذف', 'عذق', 'عرادي', 'عرار', 'عراق', 'عربي', 'عرفات', 'عرفان', 'عرفة',    
'غادي', 'غازي', 'غالب', 'غالي', 'غامد', 'غامر', 'غانم', 'غاني', 'غدير', 'غذيم', 'غراس', 'غربيب', 'غريد', 'غرير', 'غريز', 'غريف', 'غزل', 'غزلام', 'غزوان', 'غسان', 'غصن', 'غصين', 'غضنفر', 'غضير', 'غطاس', 
'فائد', 'فائز', 'فائق', 'فاتك', 'فاخر', 'فادي', 'فارد', 'فارس', 'فارع', 'فارق', 'فاروق', 'فاضل', 'فاهم', 'فايد', 'فخر', 'فخري', 'فدعان', 'فدك', 'فراج', 'فراد', 'فراس', 'فرانق', 'فرج', 'فرزدق', 'فرقد', 
'قائد', 'قابس', 'قابل', 'قابوس', 'قادر', 'قادم', 'قارب', 'قاسط', 'قاسم', 'قاصد', 'قاضي', 'قانت', 'قانع', 'قاهر', 'قبلان', 'قتادة', 'قتيبة', 'قثم', 'قثوم', 'قحطان', 'قدامة', 'قدري', 'قدوة', 'قدور', 'قرير', 
'كاتب', 'كاتم', 'كارم', 'كاسب', 'كاسر', 'كاشف', 'كاظم', 'كافل', 'كافي', 'كامل', 'كامي', 'كايد', 'كباس', 'كبيس', 'كتاب', 'كتكوت', 'كتوم', 'كثير', 'كركي', 'كرم', 'كروان', 'كريت', 'كريم', 'كساب', 'كسار', 
'لأي', 'لؤلؤ', 'لؤي', 'لئير', 'لامع', 'لباب', 'لبيب', 'لبيد', 'لجام', 'لطفي', 'لطيف', 'لغيم', 'لقاء', 'لقان', 'لقمان', 'لكان', 'لمار', 'لمعان', 'لمعي', 'لميع', 'لواء', 'لوجينا', 'لوذ', 'لور', 'ليالي نجد', 
'مؤنس', 'ماجد', 'مادلين', 'مالك', 'ماهيرال', 'مجيد', 'محمد', 'محمد أمين', 'مدحت', 'مرام', 'مرشد', 'مرشد', 'مروى', 'مضاوي', 'مطر', 'مظفر', 'معان', 'معتز', 'معتوه', 'معن', 'مفاز', 'مكشخ', 'منال', 'منبر', 'منتظر', 
'نائل', 'نابغ', 'نابغة', 'ناجي', 'نادر', 'ناشد', 'ناصر', 'ناصف', 'ناض', 'ناظر', 'ناظم', 'ناغي', 'نافع', 'نافل', 'نامق', 'ناهض', 'ناهور', 'نايف', 'نبهان', 'نبوي', 'نبيل', 'نبيه', 'نجاتي', 'نجدي', 'نجل', 
'هائم', 'هاتور', 'هادي', 'هاذل', 'هارون', 'هاشم', 'هالب', 'هامة', 'هامس', 'هانيء', 'هايدى', 'هبار', 'هبرزي', 'هتاف', 'هتان', 'هترك', 'هجان', 'هجل', 'هدف', 'هديد', 'هديل', 'هذلول', 'هذيل', 'هرامس', 'هرطال', 
'وائل', 'واتن', 'واثق', 'وادع', 'وازع', 'واسع', 'واسل', 'واصف', 'وافي', 'واقد', 'والي', 'وثاق', 'وجدي', 'وداعة', 'ودقة', 'وديد', 'وديع', 'وديعة', 'وراد', 'ورد', 'وردان', 'ورشان', 'ورقة', 'وسام', 'وسامة', 
'ياسر', 'ياسين', 'يافع', 'ياقوت', 'يامن', 'ياموم', 'يانع', 'يخلد', 'يراع', 'يربوع', 'يرفأ', 'يريم', 'يزد', 'يزداد', 'يزن', 'يسار', 'يسري', 'يسوم', 'يشكر', 'يعرب', 'يعسوب', 'يعقوب', 'يعلى', 'يعمر', 'يعيش', 

    );

    /**
     * {@link} http://muslim-names.us/
     **/ 
    protected static $firstNameFemale = array(
        
'آصال', 'آطام', 'آمال', 'آمة', 'آمةالسلام', 'آمنة', 'آنسة', 'آنية', 'آية', 'أبدار', 'أبراح', 'أبرار', 'أبكار', 'أبلة',     
   'باتعة', 'باحث', 'باحور', 'بادح', 'بادرة', 'بادية', 'باذلة', 'بارح', 'بارعة', 'بارقة', 'باسقة', 'باسكة', 'باسمة', 'باشة', 'باكورة', 'بانة', 'باهرة', 'باهية', 'باهيز', 'باهين', 'ببنة', 'بتات', 'بتراء', 'بتلاء', 'بتوت',    
'تائبة',  'تاجالنساء', 'تاجة', 'تالة', 'تالدة', 'تامة', 'تامرة', 'تامورة', 'تاهور', 'تباريح', 'تباشير', 'تبالة', 'تبراء', 'تبرق', 'تبريس', 'تبهر', 'تحاسين', 'تحبب', 'تحرير', 'تحسين', 'تحفة', 'تحمد', 'تحنان', 
'ثابتة', 'ثاقبة', 'ثامرة', 'ثبيتة', 'ثجاج', 'ثراء', 'ثروات', 'ثروة', 'ثريا', 'ثريات', 'ثقيبة', 'ثمار', 'ثمام', 'ثمرة', 'ثمرةالصابرين', 'ثمول', 'ثناء', 'ثناءالدين', 'ثناءالله', 'ثنى', 'ثنيا', 'ثوايا', 'ثويبة', 
'جابرة', 'جادالحق', 'جادالله', 'جادي', 'جاذبية', 'جارالله', 'جارية', 'جالية', 'جام', 'جامة', 'جانا', 'جانح', 'جاه', 'جاهدة', 'جبائر', 'جبرة', 'جبلات', 'جبلة', 'جبول', 'جبيرة', 'جدا', 'جداد', 'جداول', 'جدايا', 'جداية', 
'حدهم', 'حسن', 'حسناء', 'حنين', 'حواء', 'حيدر', 
'خاتون', 'خاطرة', 'خالدة', 'خالدية', 'خالصة', 'خدائج', 'خداج', 'خدال', 'خدر', 'خدلة', 'خدور', 'خديجة', 'خذام', 'خزام', 'خزامى', 'خزامىالصحراء', 'خزامىنجد', 'خزانة', 'خزنة', 'خصال', 'خضارة', 'خضراء', 'خطوات', 'خفار', 'خفاف', 
'دأماء', 'دائبة', 'داح', 'داحة', 'دادي', 'دارين', 'داعي', 'داليا', 'دالية', 'دامغة', 'دانة', 'دانية', 'دجانة', 'دجوى', 'دجى', 'دجينة', 'دحام', 'دخدار', 'دخنة', 'دخيل', 'دخيلالله', 'ددن', 'دراري', 'درة', 'درةالشمال', 
'ذات الدل', 'ذات الفضول', 'ذات المجد', 'ذات الهمة', 'ذاخرة', 'ذاريات', 'ذاكرة', 'ذاكية', 'ذاير', 'ذبار', 'ذخيرة', 'ذرا', 'ذرائع', 'ذروة', 'ذروف', 'ذرى', 'ذرية', 'ذفراء', 'ذكاء', 'ذكاء', 'ذكرى', 'ذكية', 'ذماء', 'ذمارة', 'ذمامة', 
   'رءوم', 'رأد', 'رأدة', 'رأفة', 'رأل', 'رأي', 'رؤد', 'رؤود', 'رؤى', 'رئال', 'رئام', 'رئيسة', 'رئيفة', 'رائعة', 'رائعةالجمال', 'رائقة', 'رابحة', 'رابطة', 'رابعة', 'رابية', 'راتانيا', 'راتبة', 'راجح', 'راجحة', 'راجية',    
'زائدة', 'زاجل', 'زاخرة', 'زادالجمال', 'زادالخير', 'زان', 'زانة', 'زاهرة', 'زاهرية', 'زاهية', 'زبدة', 'زبدة', 'زبرجد', 'زبيدة', 'زخاري', 'زرنباد', 'زرود', 'زروف', 'زعافير', 'زعفرانة', 'زفوف', 'زكريا', 'زلال', 'زلخاء', 'زمانة', 
   'سؤدد', 'سائح', 'سائغة', 'سابغة', 'سابية', 'ساجدة', 'ساجية', 'سادة', 'سادح', 'سارح', 'ساره', 'سارية', 'سافن', 'سالمة', 'سالى', 'سالي', 'سامح', 'سامراء', 'سامرة', 'سامية', 'ساميه', 'سبحة', 'سبرة', 'سبل', 'سبلاء',    
'شآبيب', 'شؤون', 'شائعة', 'شادن', 'شادية', 'شاذل', 'شاكرة', 'شامخة', 'شاملة', 'شامية', 'شانة', 'شاهة', 'شباب', 'شتن', 'شجرالدر', 'شجرة', 'شجون', 'شحرورة', 'شحرورةالوجدان', 'شدخة', 'شدف', 'شدو', 'شدوالبلابل', 'شدوة', 'شدون', 
'صائبة', 'صابرة', 'صابرين', 'صاحب', 'صاحبة', 'صاحي', 'صادح', 'صادقة', 'صارية', 'صافح', 'صافية', 'صافيةالأديم', 'صالح', 'صالحة', 'صامدة', 'صبا', 'صباح', 'صبانجد', 'صبايا', 'صبح', 'صبحاء', 'صبحة', 'صبحي', 'صبحية', 'صبراء', 
'ضاحكة', 'ضاحي', 'ضاحية', 'ضارعة', 'ضافية', 'ضالة', 'ضباب', 'ضباح', 'ضحاك', 'ضحة', 'ضحوة', 'ضحوك', 'ضحى', 'ضفا', 'ضفاف', 'ضفة', 'ضفوة', 'ضفور', 'ضفوف', 'ضفون', 'ضمائر', 'ضمرة', 'ضنين', 'ضهوة', 'ضوءالصباح', 
'ظافرة', 'ظامنة', 'ظباء', 'ظبية', 'ظروف', 'ظريفة', 'ظفائر', 'ظفرة', 'ظلال', 'ظليفة', 'ظليلة', 'ظوافر', 
'طائلة', 'طاب', 'طاقة', 'طالبة', 'طامح', 'طاهرة', 'طبيبة', 'طحان', 'طرائف', 'طرائق', 'طراف', 'طرفاء', 'طرفة', 'طرفة', 'طرفة', 'طروب', 'طعمة', 'طعمة', 'طعمة', 'طفلةالأنامل', 'طفول', 'طلاوة', 'طلبا', 'طلة', 'طلحة', 
   'عائدة', 'عائشة', 'عائشه', 'عابدة', 'عابرةسبيل', 'عاتقة', 'عادلة', 'عاذرة', 'عاربة', 'عازمة', 'عاسلة', 'عاشقة', 'عاطرة', 'عاطفة', 'عافية', 'عاقلة', 'عالمة', 'عالية', 'عامرة', 'عاهدة', 'عبد الرحيم', 'عبد المجيد',    
'غادة', 'غادةاليم', 'غادية', 'غالبة', 'غالية', 'غامدة', 'غامرية', 'غانية', 'غاية', 'غايةالأمل', 'غايةالمنى', 'غدائر', 'غداف', 'غداني', 'غدف', 'غدفان', 'غدن', 'غراء', 'غراد', 'غرار', 'غرام', 'غروب', 'غروف', 'غريفة', 'غزال', 
'فائدة', 'فائزة', 'فاتح', 'فاتن', 'فاتنةالألباب', 'فاتنةالإحساس', 'فاتنةالروح', 'فاتنةالقوام', 'فاخرة', 'فادية', 'فارعة', 'فاضلة', 'فاطمة', 'فاطنة', 'فافان', 'فالة', 'فالح', 'فامية', 'فامين', 'فتاحة', 'فتانةالعينين', 'فتحالله', 'فتحي', 'فتحية', 'فتنة', 
'قانتة', 'قبائل', 'قبال', 'قبلة', 'قبيلة', 'قحافة', 'قحطان', 'قدا', 'قداس', 'قداف', 'قدم', 'قدوم', 'قرانيا', 'قرةالعين', 'قرنفل', 'قرى', 'قريبة', 'قسمة', 'قشيب', 'قطا', 'قطاف', 'قطبالدين', 'قطرالندى', 'قطوف', 'قلبية', 
'كائنة', 'كاتبة', 'كادحة', 'كادي', 'كاذي', 'كارين', 'كاسبة', 'كاعب', 'كافلة', 'كافور', 'كاملة', 'كبرياء', 'كحلاء', 'كحيلة', 'كرامة', 'كربل', 'كرمة', 'كريمة', 'كريمةالأصل', 'كسبة', 'كسكرا', 'كفاء', 'كفاح', 'كفاف', 'كفاية',
'لآلئ', 'لؤلؤة', 'لاتح', 'لاحق', 'لارا', 'لاعة', 'لالاهم', 'لامة', 'لانا', 'لبانة', 'لبنى', 'لبوة', 'لبيبة', 'لبيس', 'لتاح', 'لتوب', 'لتين', 'لثم', 'لجم', 'لجين', 'لحاة', 'لحاظ', 'لحظ', 'لحوب', 'لحوظ', 
   'الأخيرة', 'مآب', 'مآثر', 'مآرب', 'مآل', 'مأذ', 'مأرب', 'مؤنة', 'مؤنسة', 'مؤونة', 'مئناف', 'مئيد', 'مائسة', 'ماتعة', 'ماتي', 'مادي', 'ماذريون', 'ماذي', 'مارية', 'مازنة', 'مازية', 'ماسه', 'ماش', 'مانحة', 'ماهرة', 'ماوية',    'الأخيرة', 
   'نائفة', 'نائلة', 'نابهة', 'ناجح', 'ناجلة', 'ناجية', 'نادرة', 'نادرةالوجود', 'نادية', 'نازك', 'ناشل', 'ناصح', 'ناصية', 'ناضرة', 'ناعمة', 'ناغية', 'نافذة', 'نافعة', 'نافلة', 'نالة', 'نامية', 'ناهد', 'ناهر', 'ناهزة', 'ناهضة',    
'هائلة', 'هائمة', 'هاتن', 'هاجر', 'هادئة', 'هادر', 'هاشمية', 'هالة', 'هانئة', 'هبات', 'هبة', 'هبةالله', 'هبوب', 'هتون', 'هجود', 'هد', 'هداد', 'هداهد', 'هدايا', 'هداية', 'هدايةالله', 'هدب', 'هدباء', 'هدنة', 'هدنة', 
'وئام', 'واثر', 'واجدة', 'واحة', 'وادعة', 'وارفة', 'واصلة', 'واصلين', 'واعية', 'وتار', 'وتان', 'وتيرة', 'وتين', 'وثاب', 'وثوب', 'وج', 'وجاح', 'وجاد', 'وجاهة', 'وجد', 'وجدان', 'وجدة', 'وجنة', 'وجود', 'وجيدة', 
'يارا', 'ياسرة', 'ياسم', 'ياقد', 'ياقوتة', 'يام', 'يامنة', 'يبروح', 'يتوع', 'يثرب', 'يحيى', 'يزن', 'يسر', 'يسرى', 'يسرية', 'يسيرة', 'يشب', 'يشم', 'يعافير', 'يعفور', 'يقنة', 'يقين', 'يليل', 'يمامة', 'يمنى', 
    );

    protected static $lastName = array(
 'السلطية', 'العناسوة',  'الدعجة', 'العمرية', 'العدوان',  'عباد', 'الشمالي', 'المجالي', 'الحجايا', 'الطراونة', 'البتراء', 'بني حسن', 'عجلون', 'قبيلة', 'وادي', 'الكركي', 'المحاميد', 'العضيبات', 'معاني', 'الزعبية', 'بني صقر', 'سحاب', 'الروابدة', 'الجوالدة', 'المشاهره', 'عشيرة', 'المومنى', 'الكردي', 'عشيرة', 'الصرايرة', 'شمر', 'عشيرة', 'النعيمات',  'المساعيد', 'الضمور', 'المحاميد', 'الفاعوري', 'عشيرة', 'مطير', 'الوشاح', 'الطويل', 'القطيشات', 'الحوراني', 'عابدين', 'السراج', 'الروسان', 'الطباع', 'الفاخوري', 'الرشدان', 'الرفاعي', 'العنانبه', 'الجرَّاح', 'النشاشيبي', 'المصري', 'الشطناوي', 'آلهامي', 'الريماوي', 'الهلسة' 'الشريدة', 'الردايدة', 'النسور', 'الغريب', 'الجوابره', 'الشامي', 'الصرايرة', 'السعد', 'الفناطسة', 'السحيمات', 'المواجدة', 'العمري', 'الطويسات', 'البلبيسي', 'الامام', 'السحاقات', 'المبيضين', 'المومنية', 'الشريف', 'المعشر', 'الترابين',  'السيوف', 'الجبارات', 'أبو الرب', 'ابو رحمة', 'الصمادي', 'الاردنية', 'عناسوة',  
    ); 

    private static $prefix = array('أ.','د.', 'أ.د','م.'); //TODO: complete... 

    /**
     * @example 'أ.'
     */
    public static function prefix()
    {
        return static::randomElement(static::$prefix);
    }
}
