<?php

namespace Faker\Provider\hy_AM;

class Address extends \Faker\Provider\Base
{
	protected static $cityPrefix = array('քաղաք');

	protected static $regionSuffix = array('մարզ');
	protected static $streetSuffix = array(
		'փողոց.', 'փակուղի', 'պողոտա', 'խճուղի', 'հրապարակ');

	protected static $buildingNumber = array('##'); protected static $postcode = array('####');
	protected static $country = array('Աբխազիա', 'Ադրբեջան', 'Ալբանիա', 'Ալժիր', 'Աղվանք',
		'Ամերիկա', 'Ամերիկայի Միացյալ Նահանգներ', 'Անգլիա', 'Անգոլա', 'Անդորրա', 'Ավստրալիա', 'Ավստրիա',
		'Արաբական Միացյալ Էմիրություններ', 'Արգենտինա', 'Արևելյան Թիմոր', 'Արևմտյան Սահարա',
		'Աֆղանստան', 'Բահամներ', 'Բահրեյն', 'Բանգլադեշ', 'Բելառուս', 'Բելգիա', 'Բելիզ', 'Բենին',
		'Բիրմա', 'Բոթսվանա', 'Բոլիվիա', 'Բոսնիա և Հերցոգովինա', 'Բոտսվանա', 'Բութան', 'Բութանիա',
		'Բուլղարիա', 'Բուրկինա Ֆասո', 'Բուրունդի', 'Բրազիլիա', 'Բրիտանիա', 'Բրունեյ', 'Գաբոն',
		'Գաղատիա', 'Գամբիա',  'Գայանա', 'Գանա', 'Գերմանիա', 'Գերմանիայի Դաշնային Հանրապետություն',
		'Գվատեմալա', 'Գվինեա', 'Գրենադա', 'Դանիա', 'Դոմինիկա', 'Դոմինիկյան Հանրապետության', 'Եգիպտոս',
		'Եգիպտոսի Արաբական Հանրապետություն', 'Եթովպիա', 'Եմեն', 'Եվրամիություն', 'Զամբիա', 'Զիմբաբվե',
		'Էկվադոր', 'Էստոնիա', 'Էրիտրեա', 'Թաիլանդ', 'Թայվան', 'Թունիս', 'Թուրքիա', 'Թուրքմենստան',
		'Թրակիա', 'Ինդոնեզիա', 'Իռլանդիա', 'Իսլանդիա', 'Իսպանիա', 'Իսրայել', 'Իտալիա', 'Իրան', 'Իրաք',
		'Լաոս', 'Լատվիա', 'Լեհաստան', 'Լեռնային Ղարաբաղ', 'Լեռնային Ղարաբաղի Հանրապետություն', 'Լեսոթո',
		'Լիբանան', 'Լիբերիա', 'Լիբիա', 'Լիխտենշտեյն', 'Լիկիա', 'Լիտվա', 'Լյուքսեմբուրգ', 'Խորվաթիա',
		'Կաբո-Վերդե', 'Կամբոջա', 'Կամերուն', 'Կանադա', 'Կապադովկիա', 'Կատալոնիա', 'Կարիա', 'Կիպրոս',
		'Կոլումբիա', 'Կողքիս', 'Կոնգո', 'Կոսովո', 'Կոստա Ռիկա', 'Կոտ դԻվուար', 'Կորեա', 'Կուբա',
		'Հաիթի', 'Հայաստան', 'Հայաստանի Հանրապետություն', 'Հարավային Կորեա', 'Հարավաֆրիկյան
		Հանրապետություն', 'Հյուսիսային Իռլանդիա', 'Հյուսիսային Կորեա', 'Հնդկաստան', 'Հոլանդիա',
		'Հոնդուրաս', 'Հորդանան', 'Հունաստան', 'Հունգարիա', 'Ղազախստան', 'Ղրղզստան', 'Ճամայկա',
		'Ճապոնիա', 'Մադագասկար', 'Մալայզիա', 'Մալավի', 'Մալդիվներ', 'Մալթա', 'Մալի', 'Մակեդոնիա',
		'Մավրիտանիա', 'Մավրիտիուս', 'Մարշալյան Կղզիներ', 'Մարոկկո', 'Մեծ Բրիտանիա', 'Մեքսիկա', 'Միացյալ
		Թագավորություն', 'Միկրոնեզիա', 'Մյանմար', 'Մոզամբիկ', 'Մոլդովա', 'Մոնակո', 'Մոնղոլիա',
		'Մոնտենեգրո', 'Նամիբիա', 'Նաուրու', 'Նեպալ', 'Նիգեր', 'Նիգերիա', 'Նիդերլանդներ', 'Նիկարագուա',
		'Նոր Զելանդիա', 'Նորվեգիա', 'Շոտլանդիա', 'Շվեդիա', 'Շվեյցարիա', 'Շրի Լանկա', 'Ուգանդա', 'Ուելս',
		'Ուզբեկստան', 'Ուկրաինա', 'Ուրուգվայ', 'Չադ', 'Չեխիա', 'Չեխիայի Հանրապետություն', 'Չեռնոգորիա',
		'Չիլի', 'Չինաստան', 'Չինաստանի Ժողովրդական Հանրապետություն', 'Պակիստան', 'Պաղեստին', 'Պանամա',
		'Պապուա Նոր Գվինեա', 'Պարագվայ', 'Պարսկաստան', 'Պերու', 'Պիսիդիա', 'Պոնտոս', 'Պորտուգալիա',
		'Պուերտո Ռիկո', 'Ջիբութի', 'Ռուանդա', 'Ռումինիա', 'Ռուսաստան', 'Սալվադոր', 'Սան Մարինո',
		'Սաուդյան Արաբիա', 'Սենեգալ', 'Սերբիա', 'Սինգապուր', 'Սիրիա', 'Սլովակիա', 'Սլովենիա', 'Սոմալի',
		'Սուդան', 'Սուրինամ', 'Սվազիլենդ', 'Վանուատու', 'Վատիկան', 'Վենեսուելա', 'Վիետնամ', 'Վրաստան',
		'Տանզանիա', 'Տաջիկստան', 'Տիբեթ', 'Տոգո', 'Տրինիդադ և Տոբագո', 'Փղոսկրի Ափ', 'Փռյուգիա',
		'Քաթար', 'Քենիա', 'Քուվեյթ', 'Օման', 'Ֆարերյան կղզիներ', 'Ֆարերներ', 'Ֆիլիպիններ', 'Ֆինլանդիա',
		'Ֆիջի', 'Ֆրանսիա');

	protected static $region = array('Արագածոտն', 'Արարատ', 'Արմավիր', 'Գեղարքունիք', 'Կոտայք', 'Լոռի', 
		'Շիրակ', 'Սյունիք', 'Տավուշ', 'Վայոց Ձոր');

	protected static $city = array('Աբովյան', 'Ագարակ', 'Ալավերդի', 'Ախթալա', 'Այրում', 'Աշտարակ',
		'Ապարան', 'Արարատ', 'Արթիկ', 'Արմավիր', 'Արտաշատ', 'Բերդ', 'Բյուրեղավան', 'Գավառ', 'Գյումրի',
		'Գորիս', 'Դաստակերտ', 'Դիլիջան', 'Եղեգնաձոր', 'Եղվարդ', 'Երևան', 'Էջմիածին', 'Թալին',
		'Թումանյան', 'Իջևան', 'Ծաղկաձոր', 'Կապան', 'Հրազդան', 'Ճամբարակ', 'Մասիս', 'Մարալիկ',
		'Մարտունի', 'Մեծամոր', 'Մեղրի', 'Նոր Հաճն', 'Նոյեմբերյան', 'Շամլուղ', 'Չարենցավան', 'Ջերմուկ',
		'Սիսիան', 'Սպիտակ', 'Ստեփանավան', 'Սևան', 'Վայք', 'Վանաձոր', 'Վարդենիս', 'Վեդի', 'Տաշիր',
		'Քաջարան');



	protected static $street = array(
		'Աբովյան', 'Կոմիտաս', 'Բաղրամյան', 'թումանյան', 'Սայաթ-Նովա'
	);

	protected static $addressFormats = array(
		"{{postcode}}, {{region}} {{regionSuffix}}, {{cityPrefix}} {{city}}, {{street}} {{streetSuffix}}, {{buildingNumber}}",
	);

	public static function buildingNumber()
	{
		return static::numerify(static::randomElement(static::$buildingNumber));
	}

	public function address()
	{
		$format = static::randomElement(static::$addressFormats);
		return $this->generator->parse($format);
	}

	public static function country()
	{
		return static::randomElement(static::$country);
	}

	public static function postcode()
	{
		return strtoupper(static::bothify(static::randomElement(static::$postcode)));
	}

	public static function regionSuffix()
	{
		return static::randomElement(static::$regionSuffix);
	}

	public static function region()
	{
		return static::randomElement(static::$region);
	}

	public static function cityPrefix()
	{
		return static::randomElement(static::$cityPrefix);
	}

	public static function city()
	{
		return static::randomElement(static::$city);
	}

	public static function streetSuffix()
	{
		return static::randomElement(static::$streetSuffix);
	}

	public static function street()
	{
		return static::randomElement(static::$street);
	}
}
