<?php

namespace Faker\Provider\hy_AM;

class Person extends \Faker\Provider\Person
{
	protected static $formats = array(
		'{{firstName}} {{lastName}}',
		'{{firstName}} {{middleName}} {{lastName}}',
		'{{lastName}} {{firstName}}',
	);

	protected static $firstName = array('Աբգար', 'Աբել',  'Աբրահամ', 'Ադամ',  'Ազատ', 'Ազնավուր', 'Աթաբեգ  (Աթաբեկ)', 'Ալբերտ',
										'Ալեքսան',  'Ալֆրեդ', 'Ահարոն',  'Աղասի',  'Անաստաս',  'Անդրանիկ', 'Անդրեաս',  'Անտոն',
										'Անուշավան',  'Աշոտ', 'Առաքել',  'Ասատուր',  'Ասպետ', 'Ավագ',  'Ավետ', 'Ավետ',  'Ավետ',
										'Ավետիս',  'Ավետիք',  'Ատոմ',  'Արա',   'Արամ',  'Արայիկ',  'Արբակ',  'Արգամ',  'Արեգ',
										'Արթուր', 'Արծրունի', 'Արկադի', 'Արման', 'Արմեն', 'Արշակ', 'Արշավիր', 'Արսեն', 'Արտակ',
										'Արտաշես',  'Արտավազդ',   'Արտեմ',  'Բաբգեն  (Բաբկեն)',  'Բաբիկ',   'Բագրատ',  'Բադալ',
										'Բաղդասար',  'Բարսեղ',  'Բենիկ',  'Բորիս',  'Գաբրիել',  'Գագիկ',  'Գալուստ',  'Գառնիկ',
										'Գեղամ',  'Գենադի',  'Գևորգ', 'Գնել',  'Գոռ',  'Գրիգոր',  'Գրիշա', 'Գուրգեն',  'Գարիկ',
										'Դանիել', 'Դավիթ',  'Դերենիկ', 'Դմիտրի', 'Եգոր', 'Եդիգար',  'Եղիշե', 'Եսայի', 'Երանոս',
										'Երեմիա', 'Երվանդ', 'Եփրեմ', 'Զավեն', 'Զաքարիա', 'Զոհրաբ', 'Զորավար', 'Զորիկ', 'Էդգար',
										'Էդիլ', 'Էդուարդ', 'Էմիլ', 'Էմին', 'Էմմանուել', 'Թաթուլ', 'Թելման', 'Թովմաս', 'Թորգոմ',
										'Թորոս', 'Ժան', 'Ժան',  'Ժիրայր', 'Ժոզեֆ', 'Իգիթ', 'Իգոր',  'Իլյա', 'Իսահակ', 'Լեոնիդ',
										'Լեվոն',  'Լիպարիտ',   'Լյուդվիգ',  'Խաժակ',  'Խաչիկ',  'Խոսրով',   'Խորեն',  'Ծառուկ',
										'Ծատուր', 'Կամո', 'Կարապետ', 'Կարեն',  'Կարլեն', 'Կարլոս', 'Կիմ', 'Կիրակոս', 'Կոմիտաս',
										'Կորյուն',  'Հակոբ',  'Համբարձում',  'Համլետ', 'Հայկ',  'Հայկազ',  'Հենրիկ',  'Հմայակ',
										'Հովիկ', 'Հովհաննես', 'Հովսեփ', 'Հրայր',  'Հրանտ', 'Հրաչ', 'Հրաչյա', 'Հունան', 'Ձոնիկ',
										'Ղազար',  'Ղազարոս',  'Ղեվոնդ',  'Ղուկաս',  'Մաթեվոս',  'Մալխաս',  'Մամիկոն',  'Մանաս',
										'Մանվել',  'Մավրիկ',  'Մարատ',  'Մարգար',  'Մարկոս',  'Մարտին',  'Մարտիրոս',  'Մաքսիմ',
										'Մելիք', 'Մելքոն',  'Մեհրաբ', 'Միհրան', 'Մինաս', 'Միսաք',  'Միքայել', 'Մխիթար', 'Մհեր',
										'Մովսես',  'Մուրադ',  'Յուրի', 'Նաիրի',  'Նարեկ',  'Նելսոն',  'Ներսես', 'Նշան',  'Նոյ',
										'Նորայր',  'Նորիկ', 'Նվեր',  'Շահեն', 'Շավարշ',  'Շմավոն', 'Ոսկան',  'Պավել', 'Պարթեվ',
										'Պարսամ',  'Պարույր',  'Պետրոս',  'Ջանիբեկ',  'Ջանիկ',  'Ջիվան',  'Ռազմիկ',  'Ռաֆայել',
										'Ռաֆիկ',  'Ռշտունի',   'Ռոլան',  'Ռոլանդ',  'Ռոբերտ',  'Ռոման',   'Ռուստամ',  'Ռուբեն',
										'Ռուդոլֆ',  'Ռուսլան',  'Սահակ',  'Սամվել', 'Սամսոն',  'Սանասար',  'Սարգիս',  'Սասուն',
										'Սարիբեկ',  'Սարո',  'Սեդրակ', 'Սեթ',  'Սեյրան',  'Սևակ',  'Սերգեյ', 'Սերգո',  'Սերոբ',
										'Սիմոն', 'Սիսակ',  'Սիրակ', 'Սլավիկ',  'Սմբատ', 'Սոկրատ', 'Սողոմոն',  'Սոս', 'Սպարտակ',
										'Ստեփան',  'Սուրեն',   'Սուքիաս',  'Վազգեն',  'Վախթանգ',  'Վահագն',   'Վահան',  'Վահե',
										'Վահրամ',  'Վաղարշակ',   'Վաղինակ',  'Վանիկ',  'Վաչագան',  'Վաչե',   'Վասակ',  'Վասիլ',
										'Վասպուր',  'Վարազդատ', 'Վարդան',  'Վարշամ', 'Վարոս',  'Վարուժան', 'Վելիխան',  'Վիգեն',
										'Վլադիմիր',  'Վռամ', 'Վրեժ',  'Վրույր', 'Տարոն',  'Տիգրան', 'Տիրան',  'Տրդատ', 'Րաֆֆի',
										'Ցոլակ', 'Փայլակ', 'Փավստոս', 'Փիրում',  'Քալանթար', 'Քաջիկ', 'Քրիստ', 'Օգսեն', 'Օհան',
										'Օնիկ',  'Ֆելիքս',  'Ֆրունզիկ', 'Արեն',  'Ագապի',  'Ագնես',  'Աիդա', 'Ալինա',  'Ալիսա',
										'Ալվարդ',  'Ալվինա', 'Ամալյա',  'Անահիտ',  'Անգին', 'Անժելա',  'Անի', 'Աննա',  'Անուշ',
										'Աշխեն',  'Ասյա',  'Աստղիկ',  'Ավրորա',  'Արևիկ',  'Արմենուհի',  'Արմինե',  'Արուսյակ',
										'Արփինե',  'Բելլա',  'Գալյա',  'Գայանե',  'Գեղանուշ',  'Գյուլնարա',  'Գոհար',  'Գրետա',
										'Դիանա', 'Դինա', 'Դոնարա', 'Ելենա',  'Ելիզավետա', 'Եվա', 'Եվգինե', 'Երանուհի', 'Զաբել',
										'Զարինե',  'Զարուհի', 'Զինաիդա',  'Զոյա', 'Զվարթ',  'Էլլադա', 'Էլիզ',  'Էլինա', 'Էլյա',
										'Էմիլիա', 'Էմմա', 'Էվելինա', 'Թագուհի',  'Թամար', 'Թեհմինե', 'Թերեզա', 'Թինա', 'Ժաննա',
										'Ժասմեն',  'Ժենյա',  'Իդա',  'Իզաբելլա',  'Ինգա', 'Ինեսա',  'Իննա',  'Իռա',  'Իսկուհի',
										'Իրինա', 'Լալա', 'Լարիսա',  'Լաուրա', 'Լենա', 'Լիա', 'Լիդա',  'Լիզա', 'Լիլիա', 'Լիլիթ',
										'Լյուդմիլա', 'Լուիզա',  'Լուսինե', 'Լուսվարդ',  'Ծաղիկ', 'Ծովիկ',  'Ծովինար', 'Կարինե',
										'Կիմա',  'Կիրա',  'Կլարա',  'Հայկուհի',   'Հասմիկ',  'Հեղինե',  'Հերմինե',  'Հռիփսիմե',
										'Հրանուշ',   'Հրաչուհի',  'Մագդա',   'Մանե',  'Մանան',   'Մանիկ',  'Մանյա',   'Մանուշ',
										'Մարգարիտ',  'Մարթա',  'Մարիամ',  'Մարիետա',  'Մարինե',  'Մարիյա',  'Մարլենա',  'Մարո',
										'Մելանյա',  'Մելսիդա',  'Մետաքսյա',  'Նադեժդա',  'Նազելի',  'Նազիկ',  'Նաիրա',  'Նանե',
										'Նատալյա',  'Նարինե', 'Նելլի',  'Նինա',  'Նոննա', 'Նորա',  'Նվարդ', 'Նունե',  'Նուշիկ',
										'Շամամ',  'Շամիրամ',  'Շողիկ',  'Շուշանիկ', 'Ոսկեհատ',  'Չինար',  'Ջեմմա',  'Ջուլիետա',
										'Ռաիսա',  'Ռայա',  'Ռեբեկա', 'Ռեգինա',  'Ռիմա',  'Ռիտա',  'Ռոզա', 'Ռուզան',  'Սաթենիկ',
										'Սալոմե',   'Սառա',  'Սեդա',   'Սիլվա',  'Սիմա',   'Սիրանուշ',  'Սիրարփի',   'Սիրվարդ',
										'Սյուզաննա', 'Սոնա', 'Սոֆյա', 'Սվետլանա', 'Ստելլա', 'Սրբուհի', 'Սուսաննա', 'Վալենտինա',
										'Վանուհի',   'Վարդուհի',  'Վարսենիկ',   'Վերա',   'Վերգինե',  'Վերոնիկա',   'Վիկտորյա',
										'Վիոլետա',  'Տաթևիկ', 'Տատյանա',  'Ցողիկ',  'Փառանձեմ',  'Փիրուզ', 'Քնարիկ',  'Քսենյա',
										'Քրիստինե',       'Օլգա',       'Օվսաննա',      'Օֆելյա',       'Ֆարիդա',       'Ֆլորա'
										);

	protected static $middleName = array(
		'Արմենի', 'Կարապետի', 'Արտաշեսի', 'Արամայիսի', 'Վրեժի',	'Սուրենի', 'Սամվելի', 'Աշոտի', 'Մովսեսի'
	);

	protected static $lastName = array(
										'Աբազյան',  'Աբալյան', 'Աբաղյան',  'Աբաջյան', 'Աբգարյան',  'Աբելյան', 'Աբովյան',  'Աբրահամյան',
										'Ադամյան', 'Ադիլխանյան',  'Ադյան', 'Ազատյան', 'Ազարյան', 'Ազգալդյան',  'Ազիզբեկյան', 'Ազիզյան',
										'Ազիրյան',  'Ազոյան', 'Ազրյան',  'Աթաբեկյան',  'Աթամալյան',  'Աթայան', 'Աթանեսյան',  'Աթանյան',
										'Աթաջանյան',   'Աթասյան',   'Աթեշյան',   'Աթոյան',   'Ալավերդյան',   'Ալեքյան',   'Ալեքսանյան',
										'Ալթունյան',  'Ալիխանյան',   'Ալխասյան',  'Ալոյան',  'Ալուխանյան',   'Ահարոնյան',  'Աղաբաբյան',
										'Աղաբաբով',   'Աղաբալյան',   'Աղաբեկյան',   'Աղամալյան',  'Աղամյան',   'Աղայան',   'Աղաջանյան',
										'Աղասարյան', 'Աղասյան',  'Աղավելյան', 'Աղբալյան',  'Աղեկյան', 'Աճեմյան',  'Ամարյան', 'Ամեխյան',
										'Ամիլյան',  'Ամիրաղյան',  'Ամիրբարյան',  'Ամիրզադյան', 'Ամիրխանյան',  'Ամիրյան',  'Ամիրջանյան',
										'Ամյան', 'Ամրոյան',  'Այդինյան', 'Այվազյան', 'Անանիկյան', 'Անանյան',  'Անդակյան', 'Անդրեասյան',
										'Անդրյան', 'Անիբարյան', 'Անիկյան', 'Անտոնյան',  'Աչըքգյոզյան', 'Աչոյան', 'Ապելյան', 'Ապրեսյան',
										'Ապրիկյան',  'Աջամյան',  'Առաքելյան',  'Առստամյան',  'Առստամով',  'Առուշանյան',  'Առուստամյան',
										'Առուստամով',   'Ասադյան',   'Ասատրյան',   'Ասատուրով',   'Ասիլյան',   'Ասիրյան',   'Ասլանյան',
										'Ասլիբեկյան',   'Ասլիկյան',  'Ասլոյան',   'Ասկարյան',  'Ասմարյան',   'Ասրիբաբայան',  'Ասրիյան',
										'Ասրյան',   'Ասցատրյան',   'Ավագիմյան',   'Ավագյան',  'Ավագումյան',   'Ավալյան',   'Ավակիմյան',
										'Ավանեսյան',   'Ավանեսով',   'Ավանիսյան',   'Ավանյան',  'Ավդալյան',   'Ավդեյան',   'Ավետիսյան',
										'Ավետիսյան-Մարտիրոսյան', 'Ավետիքյան', 'Ավետյան', 'Ավթանդիլյան', 'Ավթյան', 'Ավշարյան', 'Ավոյան',
										'Արաբաչյան', 'Արամյան',  'Արարատյան', 'Արեֆև', 'Արզոյան', 'Արզումանյան',  'Արշակյան', 'Արոյան',
										'Արսենյան',  'Արտաշեսյան', 'Արտեմյան',  'Ացելյան',  'Ափինյան',  'Ափոյան', 'Աքելյան',  'Աֆոյան',
										'Բաբալյան',  'Բաբախանյան',   'Բաբայան',  'Բաբաջանյան',  'Բաբլումյան',   'Բաբկենյան',  'Բաբյան',
										'Բաբումյան',   'Բաբուտչյան',  'Բադադյան',   'Բադալյան',  'Բադասյան',   'Բադիշյան',  'Բադիրյան',
										'Բադոյան', 'Բադունց', 'Բազիկյան', 'Բազիրյանց',  'Բազոյան', 'Բալաբեկյան', 'Բալայան', 'Բալաչյան',
										'Բալասանյան', 'Բալբաբյան', 'Բալդոյան', 'Բալթյան',  'Բալյան', 'Բալույան', 'Բախշիյան', 'Բախշյան',
										'Բախչագուլյան', 'Բակունց', 'Բաղդագուլյան', 'Բաղդասարյան', 'Բաղդիկյան', 'Բաղիրյան', 'Բաղմանյան',
										'Բաղյան', 'Բաղրամյան',  'Բաղրյան', 'Բաղումյան', 'Բաղունց', 'Բաշոյան',  'Բաշրատյան', 'Բարաթյան',
										'Բարբարյան',  'Բարդանյան', 'Բարեղամյան',  'Բարխյան', 'Բարխուդարյան',  'Բարսամյան', 'Բարսեղյան',
										'Բարության', 'Բաքիրյան',  'Բդեջյան', 'Բդոյան',  'Բեբուրյան', 'Բեգիյան',  'Բեգլարյան', 'Բեգյան',
										'Բեգջանյան',  'Բեդյան',  'Բեժանյան',   'Բեյբության',  'Բեջանյան',  'Բեսկարովեյնի',  'Բեքարյան',
										'Բիդեջյան',   'Բլբուլյան',   'Բլդոյան',   'Բոզոյան',  'Բոյախչյան',   'Բոյաջյան',   'Բոջուկյան',
										'Բրուտյան',   'Բուգաեվ-Աբաղյան',   'Բուդաղյան',    'Բուլղադարյան',   'Բունիաթյան',   'Գաբոյան',
										'Գաբրիելյան',   'Գաբուզյան',  'Գադյան',   'Գազազյան',   'Գալոյան',  'Գալստյան',   'Գալուստյան',
										'Գայամյան',  'Գանջալյան',   'Գառնիկյան',  'Գասպարյան',  'Գասումյան',   'Գարաքյան',  'Գենջոյան',
										'Գեոջյան', 'Գեվորգյան',  'Գևորգյան', 'Գզիրյան', 'Գիզիրյան', 'Գիժլարյան',  'Գինոսյան', 'Գիշյան',
										'Գլոբա', 'Գյագունց',  'Գյոզալյան', 'Գյուլազյան', 'Գյուլումյան',  'Գյումշուդյան', 'Գյուրջինյան',
										'Գյուրջյան',   'Գոգորյան',  'Գոգչյան',   'Գոլեցյան',   'Գոնջարյան',  'Գորգիսյան',   'Գոքորյան',
										'Գրիգորյան',  'Գուբուշկին', 'Գուլանյան',  'Գուլումյան', 'Գուլքանյան',  'Գուշյան', 'Գուրգենյան',
										'Դագարյան', 'Դադամյան', 'Դադայան', 'Դադյան', 'Դալաքյան', 'Դալլաքյան', 'Դալվաթյան', 'Դանիելյան',
										'Դանղյան',  'Դաշտոյան', 'Դավայան',  'Դավեյան',  'Դավթյան',  'Դավիդյան', 'Դավիդով',  'Դավիթյան',
										'Դավոյան',   'Դարբինյան',  'Դարմոյան',   'Դարչինյան',   'Դելեյան',  'Դեմիրճյան',   'Դերձակյան',
										'Դերմենջյան', 'Դիլանյան', 'Դոլմաջյան',  'Դոլուխանյան', 'Դովլաթյան', 'Դումիկյան', 'Դունամալյան',
										'Դուրինյան', 'Դուրյան'
										);

	/**
	 * Return middle name 
	 * 
	 * @example 'Иванович'
	 *
	 * @access public
	 *
	 * @return string Middle name
	 */
	public function middleName()
	{
		return static::randomElement(static::$middleName);
	}

}
