<?php

namespace Faker\Provider\hy_AM;

class Person extends \Faker\Provider\Person
{
    protected static $formats = array(
        '{{firstName}} {{lastName}}',
        '{{firstName}} {{lastName}}',
        '{{firstName}} {{lastName}}',
        '{{firstName}} {{lastName}}',
        '{{firstName}} {{lastName}}',
    );

    protected static $firstName = array(
        'Աբգար','Աբել','Աբրահամ','Ազատ','Ալբերտ','Ալեքս','Ահարոն',
        'Աղասի','Ալեքսանդր','Աղվան','Անդրանիկ','Անտոն','Անուշավան',
        'Աշոտ','Ասատուր','Ավետ','Ավետիս','Ավետիք','Ատոմ','Արա',
        'Արամ','Արամայիս','Արայիկ','Արարատ','Արգիշտի','Արեգ','Արթուր',
        'Արկադի','Արման','Արմեն','Արմենակ','Արշալույս','Արշակ','Արշավիր',
        'Արսեն','Արտակ','Արտաշես','Արտավազդ','Արտեմ',
        'Բաբգեն','Բագրատ','Բաղդասար','Բարսեղ','Գաբրիել','Գագիկ',
        'Գալուստ','Գառնիկ','Գասպար','Գարեգին','Գասևան','Գեղամ',
        'Գևորգ','Գնել','Գոռ','Գրիգոր','Գուրգեն','Դանիել','Դավիթ','Դերենիկ',
        'Եղիշե','Երվանդ','Զավեն','Էդգար','Էդուրադ','Էմիլ','Թաթուլ','Ժան',
        'Ժիրայր','Իշխան','Իսահակ','Լևոն','Խաչատուր','Խաչիկ','Խորեն',
        'Կարապետ','Կարեն','Հակոբ','Համբարձում','Համլետ','Հայկ',
        'Հարություն','Հենրիկ','Հմայակ','Հովիկ','Հովհաննես','Հովսեփ',
        'Հրայր','Հրանտ','Հրաչ','Մամիկոն','Մանվել','Մանուկ','Մարտին',
        'Մարիտորս','Մեսրոպ','Միհրան','Միհրդատ','Մինաս','Միսաք',
        'Միքայել','Մխիթար','Մկրտիչ','Մհեր','Մովսես','Մուշեղ','Մուրադ',
        'Նաիրի','Նարեկ','Նելսոն','Ներսես','Նվեր','Ոսկան','Պետրոս','Պողոս',
        'Ռազմիկ','Ռաֆայել','Ռոբերտ','Սամվել','Սարգիս','Սիմոն','Սոս','Ստեփան',
        'Սուրեն','Վազգեն','Վահագն','Վարդգես','Տիգրան','Ալվարդ','Ալինա',
        'Աղավնի','Անահիտ','Անգին','Անժելա','Անի','Աննա','Անուշ','Աշխեն',
        'Աստղիկ','Արևիկ','Արմենուհի','Արմինե','Գայանե','Գեղեցիկ','Գոհար',
        'Դիանա','Ելենա','Եվա','Զարուհի','Էմմա','Թագուհի','Ժաննա',
        'Իննա','Լենա','Լիզա','Լիլիթ','Լուսիկ','Կարինե','Համեստ','Հասմիկ',
        'Մագգա','Մարիամ','Մարինե','Մարո','Նազիկ','Նաիրա','Նարինե',
        'Նոննա','Նվարդ','Նվեր','Նունե','Շողիկ','Շուշանիկ','Ռուզաննա',
        'Սաթենիկ','Սառա','Սեդա','Սիլվա','Սոնա','Սոֆյա','Սրբուհի',
        'Սուսաննա','Վարդիթեր','Վարդուհի','Վիկտորյա','Տաթևիկ',
        'Քրիստինե','Օֆելյա','Ֆլորա',
    );

    protected static $lastName = array(
        'Կարապետյան','Ասատրյան','Հովսեփյան','Մուրադյան','Հովհաննիսյան',
        'Աբգարյան','Գրիգորյան','Կարապետյան','Հայրապետյան','Ավագյան',
        'Պետրոսյան','Պողոսյան','Աբդալյան','Բադալյան','Մելիքյան','Մկրտչյան',
        'Դարբինյան','Կիրակոսյան','Հակոբյան','Խաչատրյան','Վարդանյան',
        'Համբարձումյան','Սարգսյան',
    );

    private static $prefix = array('Պարոն','');

    private static $suffix = array('',);

    /**
     * @example 'Mrs.'
     */
    public static function prefix()
    {
        return static::randomElement(static::$prefix);
    }

    /**
     * @example 'PhD'
     */
    public static function suffix()
    {
        return static::randomElement(static::$suffix);
    }
}
