<?php

namespace Faker\Provider\hi_IN;

class Company extends \Faker\Provider\Company
{
    protected static $formats = array(
        '{{lastName}} {{companySuffix}}',
        '{{lastName}}-{{lastName}}',
        '{{lastName}}, {{lastName}} and {{lastName}}',
    );

    protected static $catchPhraseWords = array(
        array(
            'अनुकूली', 'उन्नत', 'सुव्यवस्थित', 'आत्मनिर्भर', 'स्वचालित', 'संतुलित', 'व्यापार-केंद्रित', 'केंद्रीयीकृत', ' ',' क्रॉस-प्लेटफॉर्म ',' ग्राहक केंद्रित ',' अनुकूलन ',' विकेंद्रीकृत ',' डी-इंजीनियर ',' विकृत ',' डिजिटलीकृत ',' वितरित ',' विविध ',' डाउन साइज़',  'उन्नत', 'एंटरप्राइज़-वाइड', 'एर्गोनोमिक', 'एक्सक्लूसिव', 'एक्सपेन्डेड', 'एक्स्ट्राडेड', 'फैक्सफोसे', 'फोकस', 'फ्रंट-लाइन', 'फुल-कॉन्फिगरेबल', 'फ़ंक्शन-आधारित ',' मूलभूत ',' भविष्य-सिद्ध ',' घास-जड़ ',' क्षैतिज ',' कार्यान्वयन ',' अभिनव ',' एकीकृत ',' सहज ज्ञान युक्त ',' उलटा ',' प्रबंधित ',' अनिवार्य ', 'मॉनिटर', 'मल्टी-चैनल', 'मल्टी-लेडील', 'मल्टी लेयर', 'मल्टी-टायर', 'नेटवर्क', 'ऑब्जेक्ट-आधारित', 'ओपन-आर्किटेक्टेड', 'ओपन सोर्स', 'ऑपरेटिव', 'अनुकूलित', 'वैकल्पिक', 'कार्बनिक', 'संगठित', 'पर्सिविंग', 'पर्सिस्टेंट', 'फेज', 'प्री-एम्प्टीवी', 'प्रोएक्टिव', 'प्रॉफिट-फोकस ',' गहरा ',' प्रोग्राम ',' प्रगतिशील ',' सार्वजनिक-कुंजी ', 'रिएक्ट-इंजीनियर', 'रिवर्स-इंजीनियर', 'राइट-आकार', 'सशक्त', 'सीमलेस', 'रिएक्टिव', 'रिएक्टिनेटेड', 'री-इंजिनियरिंग', 'सिक्योरिज्ड ',' सिनर्जीज ',' सिनर्जीज ',' टीम उन्मुख ',' कुल ',' सिक्योरिज्ड ', 'ट्रिपल बफ़ेड ',' यूनिवर्सल ',' अप-साइज ',' अपग्रेडेबल ',' उपयोगकर्ता-केंद्रित ',' उपयोगकर्ता-अनुकूल ',' बहुमुखी ',' आभासी ',' दृष्टि ',' विजन-ओरिएंटेड ',
        ),
        array(
            '24 घंटे', '24 / 7 ',' तीसरा जनरेशन ',' 4th Generation ',' 5th Generation ',' 6th Generation ',' एक्ट्यूटिंग ',' विश्लेषण ',' एसिमेट्रिक ',' एसिंक्रोनस ',' रवैया-ओरिएंटेड ',' पृष्ठभूमि ', 'बैंडविड्थ मॉनिटर', 'द्वि-दिशात्मक', 'बिफर्केटेड', 'निचला-रेखा', 'स्पष्ट-सोच', 'क्लाइंट-संचालित', 'क्लाइंट-सर्वर', 'सुसंगत', 'संयोजक', 'संमिश्र', 'संदर्भ-संवेदनशील', 'संदर्भ-आधारित', 'सामग्री-आधारित', 'समर्पित', 'मांग-चालित', 'व्यवहारिक', 'दिशात्मक', 'असतत', 'विहीनता', 'गतिशील ',' पर्यावरण-केंद्रित ',' सशक्तीकरण ',' समाहित ',' यहां तक ​​कि, ',' कार्यकारी ',' स्पष्ट ',' एक्सयूडींग ',' गलती-सहनशील ',' अग्रभूमि ',' ताजा सोच ', 'पूर्ण सीमा', 'वैश्विक', 'ग्रिड-सक्षम', 'अनुमानी', 'उच्च-स्तरीय', 'समग्र', 'समरूप', 'मानव-संसाधन', 'संकर', 'प्रभावकारी', 'वृद्धिशील ',' अमूर्त ',' इंटरैक्टिव ',' इंटरमीडिएट ',' एसेडीज ',' स्थानीय ',' लॉजिस्टिक ',' मैक्सिमिज्ड ',' मेथिकल ',' मिशन-क्रिटिकल ',' मोबाइल ',' मॉड्यूलर ',' प्रेरणादायक ',' मल्टीमीडिया ',' मल्टी-स्टेट ',' मल्टी टास्किंग ' , 'राष्ट्रीय', 'जरूरत-आधारित', 'तटस्थ', 'अगली अगुवाई', 'गैर-वाष्पशील', 'वस्तु-उन्मुख', 'इष्टतम', 'अनुकूलन', 'क्रांतिकारी', 'वास्तविक समय', ' पारस्परिक ',' क्षेत्रीय ',' उत्तरदायी ',' स्केलेबल ',' माध्यमिक ',' समाधान-उन्मुख ',' स्थिर ',' स्थिर ',' व्यवस्थित ',' प्रणालीगत ',' प्रणाली योग्य ',' मूर्त ' , 'तृष्णात्मक', 'संक्रमणकालीन', 'वर्दी', 'ऊपरी-ट्रेंडिंग', 'यूजर-फेसिंग', 'वैल्यू-वर्ड', 'वेब-सक्षम', 'वेल-मॉडेलेटेड', 'ज़ीरऑस्ट्रिशमेंट', 'ज़िरोडेप्टेक्ट' , 'शुन्य सहनशक्ति',
        ),
        array(
            'क्षमता', 'एक्सेस', 'एडेप्टर', 'एल्गोरिथ्म', 'गठबंधन', 'विश्लेषक', 'आवेदन', 'दृष्टिकोण', 'वास्तुकला', 'पुरालेख', 'कृत्रिम दृष्टिकोण', 'सरणी', 'रवैया ',' बेंचमार्क ',' बैजलिफार्मियमेंट ',' क्षमता ',' क्षमता ',' चुनौती ',' सर्किट ',' सहयोग ',' जटिलता ',' अवधारणा ',' समूह ',' आकस्मिकता ',' कोर ', 'ग्राहक मित्रता', 'डेटाबेस', 'डेटा-वेअरहाउस', 'परिभाषा', 'अनुकरण', 'एन्कोडिंग', 'एन्क्रिप्शन', 'एक्स्ट्रानेट', 'फर्मवेयर', 'लचीलापन', 'फोकसग्रुप', 'पूर्वानुमान', 'फ्रेम', 'फ्रेमवर्क', 'फ़ंक्शन', 'फ़ंक्शनलिटी', 'ग्राफिक इंटरफेस', 'ग्रुपवेयर', 'ग्राफिकल यूज़र इंटरफेस', 'हार्डवेयर', 'हेल्प-डेस्क', 'पदानुक्रम', 'हब', 'कार्यान्वयन', 'सूचना-दिशानिर्देश', 'बुनियादी ढांचा', 'पहल', 'स्थापना', 'निर्देश', 'इंटरफ़ेस', 'इंटरनेट्यूसन', 'इंट्रानेट', 'ज्ञान', 'नॉलेजबेस', 'लोकेलरियनवर्क', 'लीवरेज', 'मैट्रिक्स', 'मैट्रिक्स', 'पद्धति', 'मिडलवेयर', 'माइग्रेशन', 'मॉडल', 'मॉडरेटर', 'मॉनिटरिंग', 'अधिस्थगन', 'न्यूरल-ने', 'प्रोजेक्ट', 'प्रोडक्टिफिकेशन', 'प्रोडक्ट', 'प्रोडक्टिविटी', 'प्रोजेक्ट', 'ओपन अलचचरचर', 'ओप्लास्टिटेक्चर', 'ऑर्केस्टेशन', 'पैराडाइम', 'समांतरता', 'पॉलिसी', 'पोर्टल' , 'प्रक्षेपण', 'प्रोटोकॉल', 'सिक्योरटिलाइन', 'सर्विस-डेस्क', 'सॉफ़्टवेयर', 'समाधान', 'मानकीकरण', 'रणनीति', 'संरचना', 'सफलता', 'अधिरचना', 'समर्थन' , 'सिनर्जी', 'सिस्टमएन्जीन', 'टास्क-फोर्स', 'थ्रूपुट', 'टाइम-फ्रेम', 'टूल्स-मेट', 'यूजेंटेशन', 'वेबसाइट', 'वर्कफोर्स',
        ),
    );

    protected static $bsWords = array(
        array(
            'लागू', 'उपयोग', 'एकीकृत', 'सुव्यवस्थित', 'अनुकूलन', 'विकसित', 'परिवर्तन', 'गले लगाओ', 'सक्षम', 'आर्केस्ट्रा', 'लीवर', 'पुनर्निर्मित', ', ',' वास्तुकार ',' वृद्धि ',' प्रोत्साहन ',' स्वर ',' सशक्ती ',' कल्पना ',' मुद्रीकरण ',' दोहन ',' सुविधा ',' जब्त ',' विहीनता ',' समन्वय ', 'रणनीकृत', 'तैनात', 'ब्रांड', 'बढ़ते', 'लक्ष्य', 'सिंडिकेट', 'संश्लेषित', 'उद्धार', 'मेष', 'सेते', 'संलग्न', 'अधिकतम', 'बेंचमार्क ',' प्रत्याशित ',' पुनर्निर्मित ',' व्हाइटबोर्ड ',' विज़ुअलाइज़ ',' रिप्रोवॉज़ ',' नवाचार ',' स्केल ',' अनलेश ',' ड्राइव ',' विस्तार ',' इंजीनियर ',' क्रांतिकारी ', 'उत्पन्न', 'शोषण', 'संक्रमण', 'ई-सक्षम', 'पुनरावृत्त', 'खेती', 'मैट्रिक्स', 'उत्पादक', 'पुनः परिभाषित', 'पुनर्निर्मित करना',
        ),
        array(
            'क्लिक-एंड-मोर्टार', 'वैल्यू-वर्ड', 'वर्टिकल', 'सक्रिय', 'मजबूत', 'क्रांतिकारी', 'स्केलेबल', 'अग्रणी-बढ़त', 'अभिनव', 'सहज ज्ञान युक्त', 'रणनीतिक ',' ई-बिज़नेस ',' मिशन-क्रिटिकल ',' स्टिकी ',' एक-टू-वन ', '24 / 7', 'एंड टू एंड', 'ग्लोबल', 'बी 2 बी', 'बीसीसी', 'खूनी', 'घर्षण', 'आभासी', 'वायरल', 'गतिशील', '24 / 365 ',' सर्वश्रेष्ठ-की-नस्ल ',' हत्यारा ',' चुंबकीय ',' खून बह रहा-किनारे ', 'वेब-सक्षम', 'इंटरैक्टिव', 'डॉट-कॉम', 'सेक्सी', 'बैक-एंड', 'रीयल-टाइम', 'कुशल', 'फ्रंट एंड', 'वितरित', 'सीमलेस', 'एक्स्टेंसिबल', 'टर्न-की', 'वर्ल्ड-क्लास', 'ओपन सोर्स', 'क्रॉस-प्लेटफॉर्म', 'क्रॉस-मीडिया', 'सिनर्जी', 'ईंटों और क्लिक्स', 'बाहर - बॉक्स', 'उद्यम', 'एकीकृत', 'प्रभावकारी', 'वायरलेस', 'पारदर्शी', 'अगली पीढ़ी', 'अत्याधुनिक', 'उपयोगकर्ता-केंद्रित', 'दूरदर्शी', 'अनुकूलित ',' सर्वव्यापी ',' प्लग-एंड-प्ले ',' सहयोगी ',' सम्मोहक ',' समग्र ',' अमीर ',
        ),
        array(
            'सहकर्मी', 'वेब-तैयारी', 'पैराडाइम्स', 'मार्केट', 'साझेदारी', 'इन्फ्रास्ट्रक्चर्स', 'प्लेटफॉर्म', 'पहल', 'चैनल', 'आंखों', 'समुदाय', 'आरओआई', 'समाधान', 'ई-टेलर', 'ई-सेवा', 'एक्शन-मद', 'पोर्टल्स', 'एनआईसीज़', 'टेक्नोलॉजीज', 'कंटेंट', 'vortals', 'आपूर्ति-चेन', 'अभिसरण ',' रिश्तों ',' आर्किटेक्चर ',' इंटरफेस ',' ई-मार्केट ',' ई-कॉमर्स ',' सिस्टम ',' बैंडविड्थ ',' इन्फॉमेडीयरीज़ ',' मॉडल ',' दिमाटरशेयर ',' डिलीवरबल ', 'उपयोगकर्ता', 'स्कीमा', 'नेटवर्क',
        ),
    );

    /**
     * Source - http://www.careerplanner.com/ListOfJobs.cfm
     */
    protected static $jobTitleFormat = array(
        'खाता प्रबंधक', 'अकाउंटेंट', 'एक्टोरर', 'एक्ट्यूवर', 'एडजस्टमेंट क्लार्क', 'एडमिन', 'एडमिनिस्ट्रेटिव लॉ जज', 'एडमिनिस्ट्रेटिव सर्विस मैनेजर', 'एडमिनिस्ट्रेटिव सपोर्ट सुपरवाइजर', 'विज्ञापन प्रबंधक या प्रचार प्रबंधक ', 'विज्ञापन बिक्री एजेंट', 'एयरोस्पेस इंजीनियर', 'कृषि फसल कृषि प्रबंधक', 'कृषि फसल कर्मचारी', 'कृषि इंजीनियर', 'कृषि उपकरण ऑपरेटर', 'कृषि निरीक्षक', 'कृषि प्रबंधक', 'कृषि उत्पाद ग्रादर सॉर्टर', 'कृषि सेल्स प्रतिनिधि', 'कृषि विज्ञान तकनीशियन', 'कृषि विज्ञान शिक्षक', 'कृषि तकनीशियन', 'कृषि कामगार', 'एयर क्रू सदस्य', 'एयर क्रू ऑफिसर', ' एयर ट्रैफिक कंट्रोलर ', 'एयरकंड असेंबलर', 'एयरक्राफ्ट बॉडी रिपॉयरर', 'एयरक्राफ्ट कार्गो हैंडलिंग सुपरवाइजर', 'एयरक्राफ्ट इंजन स्पेशलिस्ट', 'एयरक्राफ्ट लॉन्च एंड रिकवरी ऑफिसर', 'एयरक्राफ्ट लॉन्च स्पेशलिस्ट', 'एयरक्राफ्ट मैकेनिक्स', 'या एयरक्राफ्ट सर्विस तकनीशियन ',' एयरक्राफ्ट रिगिंग असेंबलर ',' एयरक्राफ्ट ', 'स्ट्रक्चर असेंबलर्स ',' एयरफ़ील्ड ऑपरेशंस स्पेशलिस्ट ',' एयरफ्रेम मैकेनिक ',' एयरलाइन पायलट या कॉपिलॉट या फ्लाइट इंजिनियर ',' एल्गोरिथ्म डेवलपर ',' परिवर्तन दर्जी ',' एम्बुलेंस चालक ',' मनोरंजन अभिकर्ता ',' एनेस्थिसोलॉजिस्ट ', 'पशु ब्रीडर ',' पशु देखभाल कार्यकर्ता ',' पशु नियंत्रण कार्यकर्ता ',' पशुपालन कार्यकर्ता ',' पशु वैज्ञानिक ',' पशु प्रशिक्षक ',' एनीलिंग मशीन ऑपरेटर ',' उद्घोषक ',' उत्तर देना सेवा ',' मानवविज्ञानी ' , 'नृविज्ञान विशेषज्ञ या पुरातत्त्व', 'नृविज्ञान शिक्षक', 'उपकरण रिपैकर', 'मध्यस्थता', 'पुरातात्विक', 'आर्किटेक्ट', 'वास्तुकला प्रारूपक', 'वास्तुकला प्रारूपक या सिविल ड्राफ्टर्स', 'आर्किटेक्चर टीचर', 'आर्किविस्ट', 'आर्टिलरी क्रू सदस्य ',' आर्टिस्ट ',' असेंबलर ',' एसेसर ',' आर्टिलरी क्रू सदस्य ',' आर्मड आटोल्ट वाहन क्रू सदस्य ',' बख्तरबंद हमला वाहन अधिकारी ',' कला निर्देशक ',' आर्ट टीचर ',' आर्टिलरी ऑफिसर ', 'खगोल विज्ञानी ',' एथलीट्स एंड स्पोर्ट्स प्रतियोगी ',' एथलेटिक ट्रेनर ',' वायुमंडलीय और अंतरिक्ष वैज्ञानिक ',' ऑडियो और वीडियो उपकरण तकनीशियन ' , 'ऑडियोलॉजिस्ट', 'ऑडिओ-विज़ुअल कलेक्शंस स्पेशलिस्ट', 'ऑडिटर', 'ऑडिटर', 'ऑटोमेटिव बॉटर रिपॉयरर', 'ऑटोमोटिव ग्लास इंस्टॉर्टर', 'ऑटोमोटिव मास्टर मैकेनिक', 'ऑटोमोटिव मैकेनिक' , 'ऑटोमोटिव स्पेशलिटी तकनीशियन', 'मोटर वाहन तकनीशियन', 'सहायक उपकरण ऑपरेटर', 'एविएशन','इंस्पेक्टर', 'एविऑनिक्स टेक्नीशियन', 'बेलीफ', 'बेकर', 'नाई', 'बारटेन्डर', 'बारटेन्डर हेल्पर', 'बैटरी रिपैरियर', 'बेलहॉप', 'बैंच ज्वेलर', 'बेनिफिट्स स्पेशलिस्ट', 'साइकिल रिपॉयरर', 'बिल एंड अकाउंट कलेक्टर ',' बाइंडरी मशीन ऑपरेटर ',' बाइंडरी वर्कर ',' बायोकैमिस्ट ',' बायोकेमेस्ट या बायोफिज़िसिस्ट ',' बायोलॉजिकल साइंस टीचर ',' जैविक वैज्ञानिक ',' जैविक तकनीशियन ',' जीवविज्ञानी ',' बायोमेडिकल इंजीनियर ',' बायोफिज़िसिस्ट', 'बोर्ड संचालक', 'बोट बिल्डर एंड शिपराइट', 'बॉयलर ऑपरेटर', 'बोइलर्मर', 'बुकबिंकर', 'बुककीपर', 'ब्रेक मशीन सेटर', 'ब्रैटनिस बिल्डर', 'ब्रेजर', 'ब्राज़िंग मशीन ब्रोकरेज क्लर्क ',' बजट विश्लेषक ',' बफिंग एंड पॉलिशिंग ऑपरेटर ',' बिल्डिंग क्लीनिंग वर्कर ',' ब्रॉडकास्टिंग टेक्निक्स ',' ब्रॉडकास्ट टेक्निक्शियन', 'बिल्डिंग इंस्पेक्टर ',' बुलडोजर ऑपरेटर ',' बस चालक ',' बिज़नेस डेवलपमेंट मैनेजर ',' बिज़नेस मैनेजर ',' बिज़नेस ऑपरेशंस स्पेशलिस्ट ',' बिज़नेस टीचर ',' बुचर ',' क्रेता ',
    'कैबिनेट मेकर, कैफेटेरिया कुक, कैलिब्रेशन तकनीशियन या इंस्ट्रुमेंटेशन तकनीशियन, कैमेरा ऑपरेटर, कैमेरा रिपैरियर, कैप्टन, कैप्शन राइटर, कार्डियोवास्कुलर टेक्नोलॉजिस्ट, कैरियर काउंसलर, कार्पेन्टर।', 'कारपेंटर असेंबलर एंड रिप्रेयर', 'कालीन इंस्टालर', 'काटोग्राफ़र', 'कार्टूनिस्ट', 'कार्वर', 'कैशियर', 'कास्टिंग मशीन ऑपरेटर', 'कास्टिंग मशीन सेट-अप ऑपरेटर', 'सीसीसी', 'छत टाइल', 'सीमेंट मेसन एंड कंक्रीट फाइनर', 'सेंट्रल ऑफिस', 'सेंट्रल ऑफिस और पीबीएक्स इंस्टालर', 'सेंट्रल ऑफिस ऑपरेटर', 'सीईओ', 'सीएफओ', 'शेफ', 'केमिकल इंजीनियर', 'केमिकल उपकरण', 'केमिकल शिक्षक ऑपरेटर', 'केमिकल उपकरण ऑपरेटर', 'केमिकल उपकरण निविदा', 'केमिकल प्लांट ऑपरेटर', 'केमिकल तकनीशियन', 'केमिस्ट', 'केमिस्ट्री टीचर', 'चाइल्ड केयर', 'चाइल्ड केयर वर्कर', 'कायरोप्रैक्टर', 'कोरियोग्राफर', 'सिटी', 'सिटी प्लानिंग सहयोगी', 'सिविल ड्राफ्टर्स', 'सिविल इंजीनियर', 'सिविल इंजीनियरिंग तकनीशियन', 'दावे समायोजक', 'दावे निष्कर्ष', 'दावों की सुरक्षाकर्ता', 'क्लीनिक ऑफ वाहनिक', 'क्लिनिक', 'क्लिनिकल साइकोलॉजिस्ट', 'क्लीनिकल स्कूल मनोचिकित्सक', 'कोच एंड स्काउट', 'कोटिंग मशीन ऑपरेटर', 'कॉयल वाइंडर्स', 'कमान नियंत्रण केंद्र अधिकारी', 'कमांड कंट्रोल सेंटर विशेषज्ञ', 'वाणिज्यिक और औद्योगिक डिजाइनर', 'वाणिज्यिक डाइवर', 'वाणिज्यिक पायलट', 'संचार उपकरण रिपैकर', 'संचार उपकरण कर्मचारी', 'संचार उपकरण ऑपरेटर', 'संचार शिक्षक', ' सामुदायिक सेवा प्रबंधक ',' कॉम्पैक्टिंग मशीन ऑपरेटर ',' मुआवजा और लाभ प्रबंधक ',' अनुपालन अधिकारी ',' कम्पोज़र ',' कंप्यूटर ',' कंप्यूटर हार्डवेयर इंजीनियर ','डांसर', 'डेटा एंट्री ऑपरेटर', 'डाटा प्रोसेसिंग उपकरण रिपॉयरर', 'डाटाबेस प्रशासक', 'डाटाबेस मैनेजर', 'डेबर्रिंग मशीन ऑपरेटर', 'डेकोरेटर', 'दंत चिकित्सा सहायक', 'दॅनेटिव हेजिस्ट', 'डेंटल लैबोरेटरी', 'डायनेमिक मेडिकल सोनोग्राफर', 'डायमंड वर्कर', 'डीजल इंजन विशेषज्ञ', 'डायटेटिक टेक्नशियन', 'बिजनेस डेवलपर्स के निदेशक', ' डायरेक्टर ऑफ मार्केटिंग ',' सोशल मीडिया मार्केटिंग के डायरेक्टर ',' प्रतिभा अधिग्रहण के निदेशक ',' डायरेक्टर धार्मिक गतिविधियां ',' डायरेक्टरी असिस्टंट ऑपरेटर ',' डिशवॉशर ',' डिस्पैचर मैनेजर ',' दरवाजा से दरवाजा बिक्री ', 'डॉट एचर', 'ड्रेफ्टर', 'ड्रैगलाइन ऑपरेटर', 'ड्रेज ऑपरेटर', 'ड्रिलिंग एंड बोरिंग मशीन टूल्स सेटर', 'ड्रायवर-सेल्स वर्कर', 'ड्राई स्केलिंग मशीन ऑपरेटर', 'ड्रायवल कंसिलिंग टाइल इंस्टालर', 'ड्रायवल इंस्टॉलर',
    );

    protected static $companySuffix = array('Inc', 'and Sons', 'LLP', 'Group', 'PLC', 'Ltd');

    /**
     * @example 'Robust full-range hub'
     */
    public function catchPhrase()
    {
        $result = array();
        foreach (static::$catchPhraseWords as &$word) {
            $result[] = static::randomElement($word);
        }

        return join($result, ' ');
    }

    /**
     * @example 'integrate extensible convergence'
     */
    public function bs()
    {
        $result = array();
        foreach (static::$bsWords as &$word) {
            $result[] = static::randomElement($word);
        }

        return join($result, ' ');
    }
}
