<?php

namespace Faker\Provider\hi_IN;

class Person extends \Faker\Provider\Person
{
    
    
    protected static $maleNameFormats = array(
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{lastName}}',
        '{{firstNameMale}} {{middleNameMale}} {{lastName}}',
        '{{firstNameMale}} {{middleNameMale}} {{lastName}}',
        '{{firstNameMale}} {{firstNameMale}} {{lastName}}',
    );

    protected static $femaleNameFormats = array(
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{lastName}}',
        '{{firstNameFemale}} {{firstNameMale}} {{lastName}}',
    );

    /**
     * @link http://www.indiaonlinepages.com/babynames/
     */
    protected static $firstNameMale = array(
        'आयुषमन', 'अमृत', 'आनंद', 'अभिनव', 'अनिल', 'एनिमेशन', 'अर्पिट', 'अखिल', 'अजिंक्य', 'अनिरुद्ध', 'अरुण', 'अतुल', 'अजय', 'अभिषेक', 'आदित्य', 'अजीत', 'अक्षय', 'अर्जुन', 'अरविंद', 'आदिल', 'आदिश', 'अमीर', 'आरिफ', 'आतिफ', 'अब्बास', 'असलम', 'अजार', 'अनीस', 'एलेक्स', 'अल्बर्ट', 'बहादुर', 'बलदेव', 'बालकृष्ण', 'बालाजी', 'भारत', 'भोला', 'बिजॉय', 'बिनोद', 'बिरेन', 'बिष्णु', 'बाबर', 'बिनो', 'ब्रोक', 'चित्तरंजन', 'चिराग', 'चिन्मय', 'चरनिप', 'चांद', 'चार्ली', 'दीप', 'डायन', 'शॉ', 'देवेंद्र', 'दीपेश', 'धीरज', 'मिरर', 'धनुष', 'डेनिस', 'डेविड', 'एकुलुल', 'एहसान', 'अलीस', 'इमरान', 'आदि', 'फक्राद्दीन', 'फैसल', 'फरारज', 'फरदीन', 'फिरोज', 'गणेश', 'गोविंद', 'ग्यान', 'घनश्याम', 'गौरव', 'गनीश', 'गजेंद्र', 'गुलजार', 'गलीब', 'हरि', 'हिमेश', 'हेमेंद्र', 'हनुमान', 'हिटान', 'ऋषिकेश', 'हिमांशू', 'हबीब', 'हसन', 'हरभजन', 'हरप्रीत', 'इब्राहिम', 'इकबाल', 'इसाहत', 'जतिन', 'जगत', 'जगदीश', 'जसवंत', 'जवाहर', 'जमशेद', 'जावेद', 'जब्दी', 'जैक', 'जॉन', 'कार्तिक', 'कौशल', 'कीर्ति', 'कुशाल', 'कैलाश', 'कल्याण', 'कृष्णा', 'कमलेश', 'कल्पना', 'कबीर', 'करीम', 'ललित', 'लक्ष्मी', 'मोहिन', 'मनीष', 'मोती', 'मोगल', 'मोहनलाल', 'मितेश', 'मनोज', 'मोनिन', 'मोहिन', 'मोहन', 'महमूद', 'मलिक', 'मेहुल', 'मुस्तफा', 'मनप्रीत', 'मुकुल', 'मुनफ', 'नारायण', 'नारायण', 'नारायण', 'नारायण', 'नारायण', 'नरेन्द्र', 'निर्मल', 'नारायण', 'नकुल', 'नवना', 'नटवर', 'नसीर', 'नजीर', 'नवाब', 'प्रवीण', 'प्रवीण', 'प्रभात', 'प्रदीप', 'प्रसून', 'रघु', 'राजेश', 'राजेश', 'राम', 'रतन', 'राम', 'गोपाल', 'रुपेश', 'प्रित', 'प्रणय', 'परवेज़', 'परजाद', 'पीटर', 'उमर', 'ओबैद', 'ओवैस', 'रघु', 'रमेश', 'रहिम', 'रहिम', 'राशिद', 'राघवन', 'सोमनाथ', 'सुशांत', 'समीर', 'सुमित', 'शशांक', 'सिरीश', 'सतीश', 'सौरभ', 'सुभाष', 'सूरज', 'सन', 'सैल', 'सोहेल', 'सतीश्वर', 'श्रीनिवासन', 'शरद', 'साईं', 'सिद्धार्थ', 'सी', 'उथमान', 'विवेक', 'डी', 'सुरेश', 'तरुण', 'तनय', 'तुषार', 'तबीद', 'ताहिद', 'उमेश', 'उदय', 'उज्जवाल', 'वजू', 'वाडु', 'यश', 'यो', 'गेश', 'जाद', 'शाहीर', 'ज़ीशन',
    );

    protected static $firstNameFemale = array(
        'आभा', 'आरती', 'आरुषि', 'आस्थ', 'ऐयूशी', 'अदिति', 'आफरीन', 'ऐशा', 'ऐश्वर्या', 'आकांक्षा', 'अखिल', 'अलकनंदा', 'अलका ',' अल्पा ',' अंशु ',' अंबिका ',' अनन्या ',' अमृता ',' अमोलिका ',' अंजना ',' अंकिता ','अनुसूला ',' अनुष्णा ',' अरुणा ',' अस्था ', 'अवंतिका', 'बबिता', 'बसंत', 'बागती', 'भाग्यश्री', 'भैरवी', 'भानुप्रिया', 'बनिता', 'बिमला', 'चमेली', 'चारू', 'छवी', 'चित्र', 'छाया', 'चांदनी', 'दमिणी', 'देविका', 'दीप्ति', 'दिव्या', 'द्रष्टि', 'दीया', 'ईशा', 'फल्गुनी', 'फराह', 'फातिमा', 'गायत्री', 'गीतांजली', 'गौरी', 'गुलाब', 'गुंजन', 'हीना', 'हीर', 'हेमा', 'हिमानी', 'हिरा', 'हिना', 'इंद्राणी', 'ईशा', 'इंदिरा', 'जागृति', 'जस्मीन', 'जयश्री', 'जिया', 'जुही', 'ज्योति', 'जूली', 'कल्पना', 'कल्याणी', 'कामिनी', 'कस्तुरी', 'किरण', 'कोमल', 'कुसुम', 'कृष्ण', 'कनिका', 'कस्तूरबा', 'कुंती', 'काजल', 'काजोल ',' कीर्ति ',' किम ', 'लता', 'ललिता', 'लीला', 'लीलावली', 'लक्ष्मी', 'लवने', 'मधु', 'माधवी', 'माया', 'मायावती', 'मेघा', 'मोना', 'मृदुला', 'मुक्ति', 'मेघना', 'मांजारी', 'मुक्ति', 'मिनी', 'मुन्नी ',' मोनिका ', 'नगमा', 'नैना', 'नलिनी', 'नमिता', 'नन्सी', 'नंदिनी', 'नमिता', 'नर्मदा', 'नीला', 'नेहा', 'निधि', 'निकिता', 'नीलम ',' निलिमा ',' निशी ',' निशिता ',' नूपुर ',' नूतन ',' निटिका ',' नियति ',' नूपुर ',' नवमी ',' निष्ठा ', 'पद्मा', 'पद्मिनी', 'पायल', 'पूनम', 'प्रभा', 'प्रियंका', 'पुष्पा', 'पूजा', 'प्रेरणा', 'पामेला', 'पिंकी', 'परमिंदर', 'प्रेसिता ', 'राधा', 'राधिका', 'रागिनी', 'राखी', 'रिचा', 'रिधि', 'रितिका', 'रिया', 'रोहिणी', 'रोमा', 'रुची', 'राहेल', 'रीटा ',' रोज़ी ',' रिमि ',' रनजून ', 'सबिना', 'समीरा', 'समीधा', 'सपना', 'सारा', 'सीमा', 'शांति', 'शीतल', 'शोभा', 'सविता', 'स्मृती', 'स्नेहा', 'सोना ',' सुनीता ',' सुप्रिया ',' सुष्मिता ', 'स्वाती ',' स्वेटा ',' श्वेता ',' सुकुर्ती ', 'तनुजा', 'तेजस्वानी', 'तुलसी', 'तृष्णा', 'तेना', 'उमा', 'उर्मि', 'उर्मिला', 'उर्वशी', 'उषा', 'उपासना', 'विनीता', 'विमला', 'वीणा', 'वैशाली', 'यामिनी', 'यास्मीन', 'ज़ीनत', 'जारा'
    );

    /**
     * @link http://genealogy.familyeducation.com/browse/origin/indian
     */
    protected static $lastName = array(
        'आचार्य', 'अग्रवाल', 'आगाटे', 'अग्रवाल', 'अग्रवाल', 'अहलूवालिया', 'अहुजा', 'अम्बल', 'अमीन', 'आनंद', 'एंड्रा', 'ऐनी', 'एंथनी', 'आप्टे', 'अरोड़ा', 'आर्य', 'अटवाल', 'अरोड़ा', 'बाबू', 'बादल', 'बादामी', 'बहल', 'बाहरी', 'जमानत', 'बैंस', 'बजाज', 'बाजवा', 'बक्शी', 'बाल', 'बाला', 'बालकृष्णन', 'बालन', 'बालसुब्रमण्यन', 'बाली', 'बंदी', 'बनर्जी', 'बानिक', 'बंसल', 'बराड़', 'बराल', 'बारिया', 'बर्मन', 'बसाक', 'बस्सी', 'बसु', 'स्नान', 'बत्रा', 'बट्टा', 'बावा', 'बावा', 'बेदी', 'बहल', 'बेन', 'बेरा', 'भगत', 'भक्त', 'भल्ला', 'भंडारी', 'भारद्वाज', 'भार्गव', 'भसीन', 'भट', 'भाटिया', 'भटनागर', 'भट्ट', 'भट्टाचार्य', 'भट्टी', 'भावसर', 'बीर', 'बिस्वास', 'बियानी', 'बोरा', 'बोराह', 'बोर्डे', 'बोर्रा', 'बोस', 'ब्रह्मभट्ट', 'ब्रार', 'बुक', 'चाको', 'चाड', 'चड्ढा', 'चड्ढा', 'चहल', 'चक्रवर्ती', 'चक्रवर्ती', 'चना', 'चंद', 'चंदा', 'चंदर', 'चंद्रा', 'चंद्रन', 'चार', 'चटर्जी', 'चौधरी', 'चौधरी', 'चौधरी', 'चौधरी', 'चौधरी', 'चौहान', 'चावला', 'चीमा', 'चेरियन', 'छाबड़ा', 'चिया', 'चौहान', 'मैसर्स', 'चोकशी', 'चोपड़ा', 'चौधरी', 'चौधरी', 'चौधरी', 'दाद', 'दारा', 'दास', 'दासगुप्ता', 'दैश', 'दास', 'दौद', 'दद', 'दला', 'दानी', 'दारा', 'दास', 'दास', 'चौधरी', 'चौधरी', 'ठेकेदार', 'दादा', 'दत्त', 'दत्ता', 'डेव', 'दयाल', 'डे', 'दीप', 'देव', 'देशमुख', 'देशपांडे', 'देवन', 'देवी', 'दीवान', 'डे', 'धालीवाल', 'धार', 'धवन', 'ढिल्लों', 'धींगरा', 'डायल', 'दीन', 'दीवान', 'दीक्षित', 'डॉक्टर', 'डोडिया', 'डोरा', 'दुआ', 'दुबे', 'दुबे', 'दुग्गल', 'दूगर', 'दत्त', 'दत्ता', 'डी', 'आलिया', 'दयाल', 'एडविन', 'गबा', 'गाडे', 'पर्व', 'गांधी', 'गणेशन', 'गणेश', 'गांगुली', 'गारा', 'गार्डे', 'गर्ग', 'जॉर्ज', 'गेरा', 'घोष', 'घोष', 'गिल', 'गोबिंद', 'गोड्डा', 'गोयल', 'गोखले', 'गोला', 'गोल', 'गोला', 'गोपाल', 'गोस्वामी', 'गौर', 'गोयल', 'ग्रेवाल', 'ग्रोवर', 'गुहा', 'गुलाटी', 'गुप्ता', 'हैदर', 'हंडा', 'हंस', 'हरि', 'हैयर', 'हेगडे', 'होरा', 'इनानी', 'अय्यंगार', 'अय्यर', 'याकूब', 'जग्गी', 'जैन', 'जनी', 'जयरामन', 'झा', 'झावेरी', 'जौल', 'जोशी', 'काबरा', 'काड़ा', 'कक्कड़', 'काला', 'काले', 'कलिता', 'कल्ला', 'कामदार', 'कांडा', 'कन्नन', 'कांत', 'कपाड़िया', 'कपूर', 'कपूर', 'कार', 'कारा', 'करण', 'कारी', 'कार्निक', 'कार्पे', 'कश्यप', 'काटा', 'कौल', 'कौर', 'कीर', 'खालसा', 'खान', 'खन्ना', 'खरे', 'खत्री', 'खोसला', 'खुराना', 'कोहली', 'कोंडा', 'कोशी', 'कोटा', '​​', 'कोठारी', 'कृष्णा', 'कृष्णमूर्ति', 'कृष्णन', 'कुलकर्णी', 'कुमार', 'कुंड', 'कुरीयन', 'कुरुविला', 'लक्ष्मण', 'लाड', 'लाल', 'लाला', 'लल', 'लल्ला', 'लंका', 'लता', 'लोदी', 'लोके', 'लोल', 'लूथरा', 'मदन', 'मगर', 'महाबीर', 'महादेव', 'महाजन', 'महल', 'महाराजा', 'माहेश्वरी', 'मजूमदार', 'मल्होत्रा', '​​', 'मॉल', 'मलिक', 'मालपानी', 'मेमन', 'मंड', 'मंदा', 'मंडल', 'मंदर', 'माने', 'मंगल', 'मंगत', 'मणि', 'मान', 'मन्नान', 'माने', 'मसीह', 'मास्टर', 'मथाई', 'मैथ्यू', 'माथुर', 'मेदा', 'मेहरा', 'मेहरोत्रा', '​​', 'मेहता', 'मेमन', 'मेनन', 'व्यापारी', 'मिन्हास', 'मिश्रा', 'मिश्रा', 'मिस्त्री', 'मित्तल', 'मित्रा', 'मित्तल', 'मित्तर', 'मोदी', 'मोदी', 'मुग़ल', 'महावीर', 'मोहन', 'मोहंती', 'मोरार', 'अधिक', 'मुखर्जी', 'मुखोपाध्याय', 'मुनी', 'मुन्शी', 'मूर्ति', 'मुर्ती', 'नाडकर्णी', 'नगर', 'नागराजजन', 'नागी', 'नागी', 'नायडू', 'नायक', 'नायर', 'नंदा', 'नारायण', 'नारंग', 'नरसिम्हन', 'नारायण', 'नारायणन', 'नारायण', 'नरूला', 'नटराजन', 'नाथ', 'Nattwar', 'नवल', 'एन', 'नायक', 'निगम', 'नोरी', 'ओक', 'ओम', 'ओमेन', 'ओझा', 'पद्मनाभन', 'पाई', 'पाल', 'पल', 'पल्ला', 'पांचाल', 'पांडे', 'पंडित', 'पंड्या', 'पंत', 'परदेशी', 'पारेख', 'पारिख', 'परमार', 'परमार', 'परसा', 'पटेल', 'पाठक', 'पाटिल', 'पऊ', 'पेरी', 'प्रसाद', 'फिलिप', 'पिल्लै', 'पिल्लै', 'पिंगले', 'प्रभाकर', 'प्रभु', 'प्रधान', 'राज', 'राजगोपाल', 'राजगोपालन', 'राज', 'राज', 'राज', 'राज', 'प्रसाद', 'प्रसाद', 'पुरी', 'पुरोहित', 'राधाकृष्णन', 'राघवन', 'राय', 'राजन', 'राजू', 'राम', 'राम', 'रामचंद्रन', 'रामकृष्णन', 'रमन', 'रामनाथन', 'रामास्वामी', 'रमेश', 'रामकिशन', 'एक', 'प्रकार', 'का', 'पौधा', 'राणा', 'रंधावा', 'रंगनाथन', 'राव', 'रस्तोगी', 'रतन', 'राव', 'रावल', 'घपला', 'रवि', 'रे', 'रेड्डी', 'रेगे', 'राउ', 'सभरवाल', 'सच्चर', 'सचदेव', 'सचदेव', 'सागर', 'साहा', 'साहनी', 'सैनी', 'सालवी', 'सम', 'सामी', 'संपत', 'सामरा', 'शमूएल', 'चप्पल', 'संधू', 'साने', 'संघ', 'संघवी', 'सनी', 'शंकर', 'शंकरन', 'संत', 'सरन', 'सरीन', 'सरकार', 'सरमा', 'सरना', 'सर्राफ', 'शास्त्री', 'साठे', 'सावंत', 'साहनी', 'सक्सेना', 'सहगल', 'सेखों', 'Se', 'मीटर', 'सेन', 'सेनगुप्ता', 'शेषाद्रि', 'सेठ', 'सेठी', 'शेट्टी', 'शा', 'शाह', 'शान', 'शंकर', 'शंकर', 'Sharaf', 'शर्मा', 'शेनॉय', 'शेर', 'सेठ', 'शेट्टी', 'श्रॉफ', 'शुक्ला', 'सिब्बल', 'सिद्धू', 'गाओ', 'सिंह', 'सिंघल', 'सिन्हा', 'सोढ़ी', 'सोलंकी', 'सोम', 'सोमन', 'सोमानी', 'सोनी', 'सूद', 'श्रीधर', 'श्रीनिवास', 'श्रीनिवासन', 'श्रीवास्तव', 'सुब्रमण्यम', 'सुब्रह्मण्यम', 'सुले', 'सुंदरम', 'सुंदर', 'सुर', 'सुरा', 'सुराणा', 'सुरेश', 'सूरी', 'स्वामीनाथन', 'स्वामी', 'तक', 'तलवार', 'टंडन', 'तनेजा', 'टैंक', 'तारा', 'टाटा', 'ठाकरे', 'ठक्कर', 'ठाकुर', 'थमान', 'थॉमस', 'तूर', 'त्रिपाठी', 'त्रिवेदी', 'उपाध्याय', 'उप्पल', 'उस्मान', 'वैद्य', 'वाल', 'वर्गीस', 'वरकी', 'वर्मा', 'वर्ती', 'वरुण', 'वोरा', 'वोरा', 'व्यास', 'वैबल', 'वरुण', 'वसा', 'वसा', 'वसा', 'वेंकटेश्वर', 'वेंकटेश', 'वर्मा', 'विग', 'विर्क', 'विश्वनाथन', 'वाधवा', 'वागल', 'वाली', 'वालिया', 'वाल्ला', 'योद्धा', 'वासन', 'यादव', 'योगी', 'योहन्नान', 'जचिया', 'जकर्याह',
    );

    /**
     * @link http://www.indianchild.com/indian_middle_names.htm
     */
    protected static $middleNameMale = array(
        'देव', 'चंद्रा', 'कुमार', 'लाल', 'प्रसाद', 'राज', 'सिंह', 'राव', 'राम', 'प्रताप', 'भाई',
    );
    
    /**
     * Return male middle name
     *
     * @example 'Kumar'
     *
     * @access public
     *
     * @return string Middle name
     */
    public function middleNameMale()
    {
        return static::randomElement(static::$middleNameMale);
    }
}
