<?php

namespace Faker\Provider\he_IL;

class Lorem extends \Faker\Provider\Lorem
{
    protected static $wordList = [
        'אאוגו', 'אגת', 'אדיפיסינג', 'אדנדום', 'אודיפו', 'אט', 'איאקוליס', 'איבן', 'איף', 'איפסום', 'אלית', 'אלמנקום',
        'אמט', 'אס', 'אפאח', 'אקווזמן', 'ארווס', 'בגורמי', 'בורק', 'בלאסטיק', 'בלובק', 'בלוף', 'בלוקריה', 'בליא',
        'בלינדו', 'בלינך', 'בליקרה', 'בלרק', 'במר', 'בנפת', 'בעליק', 'בעריר', 'בראיט', 'ברומץ', 'ברורק', 'בריקנה',
        'ברשג', 'גדדיש', 'גולר', 'גק', 'דול', 'דולור', 'דומור', 'דז', 'דיאם', 'דלאמת', 'דס', 'הבקיץ', 'הדש', 'הועניב',
        'היושבב', 'הכייר', 'השמה', 'התידם', 'וואל', 'וולופטה', 'וחאית', 'ולחת', 'ולתיעם', 'ומעיוט', 'ומרגשח',
        'וסטיבולום', 'וסתעד', 'וענוף', 'וק', 'ושבעגט', 'ותלברו', 'זותה', 'חשלו', 'טידום', 'יבש', 'יהול', 'ישבעס',
        'כאנה', 'כלרשט', 'לביקו', 'להאמית', 'לורם', 'ליאמום', 'ליבם', 'ליץ', 'לכימפו', 'לכנו', 'לכנוץ', 'למטכין',
        'למסון', 'למרקוח', 'למרקל', 'לפמעט', 'לפרומי', 'לפריקך', 'לפתיעם', 'לקטוס', 'לרטי', 'לרעח', 'לת', 'לתיג',
        'לתכי', 'מא', 'מגמש', 'מודוף', 'מונופץ', 'מונחף', 'מונפרד', 'מונפרר', 'מורגם', 'מיחוצים', 'מנורך', 'מנכם',
        'מנסוטו', 'מנק', 'מרגשי', 'נובש', 'נולום', 'נון', 'נונסטי', 'ניבאה', 'ניסי', 'ניצאחו', 'נמרגי', 'ננבי', 'נפקט',
        'נשואי', 'סאפיאן', 'סוברט', 'סולגק', 'סוליסי', 'סחטיר', 'סטום', 'סיט', 'סילקוף', 'סכעיט', 'סת', 'סתשם',
        'עמחליף', 'ערששף', 'פוסיליס', 'צוט', 'צופעט', 'צורק', 'צמוקו', 'צמלח', 'צש', 'צשחמי', 'קוואזי', 'קוויז',
        'קוויס', 'קולהע', 'קולורס', 'קונדימנטום', 'קונסקטורר', 'קורוס', 'קינץ', 'קלאצי', 'קלובר', 'קליר', 'קראס',
        'קרהשק', 'רוגצה', 'שבצק', 'שהכים', 'שיצמה', 'שלושע', 'שמחויט', 'שנרא', 'שעותלשך', 'שערש', 'תוק', 'תצטנפל',
        'תצטריק', 'תרבנך', 'תתיח',
    ];
}
