<?php

namespace Faker\Provider\he_IL;

class Text extends \Faker\Provider\Text
{
    protected static function validStart($word)
    {
        return preg_match('/^\p{Hebrew}/u', $word);
    }

    /**
     * The Little Prince
     * By Antoine de Saint-Exupéry.
     *
     * https://he.wikisource.org/wiki/%D7%94%D7%A0%D7%A1%D7%99%D7%9A_%D7%94%D7%A7%D7%98%D7%9F
     */
    protected static $baseText = <<<'EOT'
    פרק ראשון: פעם כשהייתי בן שש...
כשהייתי בן שש ראיתי פעם תמונה נהדרת בספר אשר שמו "סיפורים אמיתיים", אודות החיים ביערות בראשית. נראה בה נחש בואה בעת שהוא הוא בולע חיה. הנה העתק של התמונה:

בספר נאמר: "נחשי בואה בולעים את טרפם כשהוא שלם, בלי ללעוס אותו קודם לכן. לאחר זאת אין ביכולתם לזוז, והם ישנים במשך שישה חודשים תמימים, אשר נחוצים להם כדי לעכל את הטרף."
בימים ההם הרהרתי רבות אודות הרפתקאות בג'ונגל, ולאחר מספר נסיונות בעפרונות צבעוניים, הצלחתי לצייר את הציור הראשון שלי - ציור מספר אחד. הוא נראה כך:

הראיתי את יצירת המופת שלי למבוגרים, ושאלתי אותם אם התמונה מפחידה אותם. הם ענו: "מדוע שתמונה של כובע תפחיד אותנו?" אבל לא היה זה ציור של כובע, אלא ציור של נחש בואה בעת שהוא מעכל פיל. לכן ציירתי תמונה נוספת בה נראה תוכו של נחש הבואה, כדי שהמבוגרים יוכלו להבינה. תמיד יש להסביר להם דברים. ציור מספר שתיים שלי נראה כך:

הפעם המבוגרים יעצו לי להניח לציור נחשי בואה, מבחוץ או מבפנים, ותחת זאת להקדיש את מאמצי ללימוד גיאוגרפיה, היסטוריה, חשבון ודקדוק. זו הסיבה לכך שבגיל שש ויתרתי על מה שהיה עשוי להיות קריירה מפוארת של צייר. כשלונותיהם של ציור מס' אחד וציור מס' שתיים ריפו את ידי. מבוגרים לעולם אינם מבינים בעצמם, ומייגע הדבר עבור ילדים לשוב ולהסביר להם דברים.
אם כך, בחרתי במקצוע אחר ולמדתי להטיס אווירונים. טסתי מעט על פני כל העולם, ואמנם הגיאוגרפיה עזרה לי רבות. במבט חטוף יכולתי להבדיל בין סין לבין אריזונה. אם מישהו הולך לאיבוד בלילה, ידע כזה הוא רב ערך עבורו.
במהלך שנותי היו לי מפגשים רבים, עם הרבה אנשים רציניים. חייתי זמן רב בקרב המבוגרים. הכרתי אותם באופן אישי, מקרוב, והכרות זו לא שיפרה את דעתי עליהם.
בכל פעם שפגשתי אדם אשר נראה לי שמחשבתו צלולה, ערכתי את הניסוי של ציור מס' אחד, שנשאתי עימדי תמיד. כך ביקשתי לבדוק אם זהו אכן אדם בעל הבנה. אבל תמיד היו עונים לי: "זה כובע", ומאז לא שבתי לדבר עם אדם זה על נחשי בואה, או יערות בראשית, או כוכבים. שוחחתי אתו על דברים הקרובים לליבו, אודות משחק ברידג', גולף, פוליטיקה, ועניבות, והמבוגרים היו שבעי רצון מאד על כי פגשו אדם פיקח כמותי.
פרק שני: תאונת מטוס ופגישה מוזרה בלב המדבר
כך חייתי בבדידות, בלי שתהיה לי נפש אחת לשוחח עמה מלב אל לב, עד שלפני שש שנים קרתה לי תאונה במדבר סהרה. משהו נשבר במנוע המטוס שלי, ומאחר שלא היו עמי על המטוס לא מכונאי, ולא נוסעים, התכוננתי לתקן את התקלה המסובכת בעצמי. היתה זו שאלה של חיים ומוות עבורי: המים שברשותי היו מספיקים לשמונה ימים בלבד.
בלילה הראשון ישנתי על החול, מרוחק אלפי מילין מכל יישוב של בני אדם. הייתי בודד יותר ממלח שספינתו נטרפה והוא שט על גבי רפסודה בלב האוקיאנוס, לכן תוכלו לשוות בדמיונכם את תמהוני, כאשר עם עלות היום העיר אותי קול קטן ומשונה, ואמר:
"בבקשה, צייר לי כבשה!"
"הא?"
"צייר לי כבשה!"
קפצתי על רגלי כאילו ברק היכה אותי. מצמצתי בחוזקה בעיני, אימצתי את מבטי, וראיתי איש קטן, מוזר למראה, עומד מולי ובוחן אותי ברצינות גדולה.
הנה לפניכם הדיוקן הטוב ביותר שלו אשר הצלחתי מאוחר יותר לצייר. הציור שלי לאין ערוך פחות שובהלב מן המקור, אך זו איננה אשמתי. המבוגרים ריפו את ידי מלעסוק בציור כשהייתי בן שש, ומעולם לא למדתי לצייר דבר, פרט לנחשי בואה מבחוץ ומבפנים.

הבטתי בהופעה הפתאומית הזאת, כשעיני כמעט יוצאות מחוריהן בהשתאות. זיכרו, מטוסי התרסק במדבר, אלפי מילין מכל מקום מיושב, ובכל זאת, לא נראה שהאיש הקטן הזה תועה בחולות. גם לא נראה שהוא רעב, או צמא, או מפוחד. לא היה בו דבר שיעיד עליו שהלך לאיבוד באמצע המדבר, הרחק מיישוב בניאדם.
כשלבסוף אזרתי בי די כוח לדבר, אמרתי לו:
"אבל... מה אתה עושה פה?"
בתשובה הוא חזר על דבריו לאט, כאילו הנושא הוא בעל חשיבות עליונה:
"בבקשה, צייר לי כבשה..."
כאשר ההפתעה היא כה מוחלטת, אנחנו נוטים לציית. מופרך ככל שזה נראה לי, אלפי פרסה מיישוב אנושי, הוצאתי מכיסי פיסת נייר ועטנובע. אבל אז נזכרתי שלימודי התרכזו בגיאוגרפיה, היסטוריה, חשבון ודקדוק, ואמרתי לבחור הקטן (קצת בטרוניה) שאינני יודע לצייר.
הוא ענה:
"לא חשוב. צייר לי כבשה..."
ברם אנוכי מעולם לא ציירתי כבשה, לכן ציירתי עבורו אחד משני הציורים אשר ידעתי לצייר. היה זה הציור של נחש בריח מבחוץ, ונדהמתי לשמוע את הברנש הקטן אומר:
"לא, לא! אינני רוצה פיל בתוך נחש בריח. נחש בריח הוא יצור מסוכן מאד, ופיל הוא מגושם. במקום בו אני גר הכל קטן מאד. נחוצה לי כבשה. צייר לי כבשה."
אזי, ציירתי ציור.

הוא התבונן בו בקפידה, ואמר:
"לא. כבשה זו חולה. צייר לי אחרת."
ציירתי תמונה נוספת.

חברי הקטן חייך ואמר לי בסלחנות:
"אתה רואה בעצמך", הוא אמר, "זו איננה כבשה כלל. זה כבש. יש לו קרניים."
ציירתי ציור נוסף, וגם הוא נדחה, כמו האחרים.

"זו זקנה מדי. אני רוצה כבשה שתחיה שנים רבות".
לאחר זאת פגה סבלנותי, והיה עלי לשוב בדחיפות לפירוק המנוע. שרבטתי את הציור הזה, והסברתי לו: "זו תיבה. הכבשה אשר ביקשת נמצאת בתוכה."

להפתעתי אורו פניו של שופטי הצעיר:
"זה בדיוק מה שרציתי! אתה חושב שהכבשה הזאת תזדקק להרבה עשב?"
"למה?"
"כי במקום בו אני גר הכל מאד קטן..."
"לבטח יהיה שם די עשב בשבילה", אמרתי, "נתתי לך כבשה מאד קטנה."
הוא רכן על הציור: "לא כל כך קטנה... תראה, היא הלכה לישון..."
וכך התוודעתי אל הנסיך הקטן.
פרק שלישי: מאין בא הנסיך הקטן?
זמן רב נדרש לי כדי להבין מאין הגיע. הנסיך הקטן, אשר הציג בפני שאלות כה רבות, כאילו לעולם לא שמע את אשר שאילתיו אני. הפרטים התחוורו לי רק ממלים בודדות שנאמרו מפעם לפעם. כך למשל, בפעם הראשונה שראה את המטוס שלי (לא אצייר את המטוס, זהו ציור מסובך מדי עבורי), הוא שאל אותי:

"מה החפץ הזה?"
"זה לא חפץ. זה טס. זה מטוס. המטוס שלי", אמרתי, והסברתי לו שאני יכול לטוס.
ואז קרא: "מה! נפלת מהשמיים?"
"כן," השבתי בענווה.
"או, זה מצחיק!"
והנסיך הקטן פרץ בצחוק נחמד, שהכעיס אותי מאד. אני מצפה שרוע גורלי יילקח ברצינות. והוא הוסיף:
"אם כך גם אתה באת מן השמים! איזו היא הפלנטה שלך?"
כך התבהרה לי פיסה קטנה מן המסתורין של הוויתו.
מיהרתי לשאול אותו: "אתה בא מפלנטה אחרת?"
אבל הוא לא השיב. הוא הניד בראשו לאט, בלי להתיק מבטו מן המטוס: "לבטח לא באת ממקום מאד מרוחק..."
לאחר זאת נעטף הרהורים שנמשכו זמן רב.
הוא נטל את הכבשה שלי מכיסו והשקיע עצמו בבחינה של הנכס שלו.
נקל לשער את הסקרנות שהתעוררה בי בגלל גילוי זה אודות "פלנטה אחרת". ניסיתי לחשוף פרטים נוספים .
"אישי הקטן, מנין אתה בא? מהו אותו 'מקום בו אני גר' שעליו אתה מדבר? היכן בכוונתך לשמור את הכבשה?"
אחרי שקט מהורהר, הוא ענה:
"מה שטוב בקופסה שנתת לי הוא, שבלילות היא יכולה לשמש בית לכבשה."
"כך הדבר. ואם תהיה טוב, אתן לך גם חבל, כדי שתוכל לקשור את הכבשה במשך היום. ואף עמוד, שתוכל לקשור אותה אליו."
הנסיך הקטן נחרד מן ההצעה:
"לקשור אותה! איזה רעיון משונה!"
"אבל אם לא תקשור אותה", אמרתי, "היא תתעה להיכן שהוא ותלך לאיבוד."
חברי פרץ שוב בצחוק מתגלגל.
"אבל לאן אתה חושב שהיא תלך?"
"לכל מקום. ישר קדימה."
אז ענה הנסיך הקטן בכובד ראש:
"זה לא חשוב. במקום בו אני גר, הכל מאד קטן!"

וקצת בעצב, הוסיף:
"ישר קדימה אי אפשר להגיע מאד רחוק..."
פרק רביעי: המבגרים מתעלמים מדברים חשובים
כך גיליתי עובדה שניה רבת חשיבות: הפלנטה ממנה הגיע הנסיך הקטן, ממדיה אינם גדולים משל בית!
זה לא הפתיע אותי. ידוע ידעתי שבנוסף לכוכבי הלכת הגדולים כגון ארץ, צדק, מאדים, וונוס, אשר ניתנו להן שמות, יש מאות פלנטות, אחדות מהן כה קטנות שקשה לראותן בטלסקופ.
כאשר אסטרונום מגלה פלנטה אחת מאלה, הוא אינו מעניק לה שם, אלא מספר. הוא עשוי לקרוא לה למשל "אסטרואיד 3251".

יש לי נימוקים כבדימשקל להאמין שהפלנטה ממנה הגיע הנסיך הקטן היא אסטרואיד שכינויו B-612
אסטרואיד זה נצפה רק פעם אחת דרך הטלסקופ. היה זה בשנת 1909, על ידי תוכן תורכי.
לאחר שגילה את תגליתו, הציג אותה האסטרונום התורכי בפני הקונגרס האסטרונומי הבינלאומי, בתצוגה מרשימה, אבל איש לא האזין לדבריו, משום שהיה לבוש בתלבושת תורכית. כאלה הם המבוגרים.

למזלו של אסטרואיד B-612, חוקק השליט התורכי חוק המחייב את נתיניו, ייהרג ובל יעבור, ללבוש בגדים אירופאים.
ב-1920 שב התוכן התורכי והציג את תגליתו. זאת הפעם היה לבוש בסגנון אלגנטי, והכל קיבלו את חוות דעתו.

סיפרתי לכם פרטים אלה אודות אסטרואיד B-612, ואף ציינתי את מספרו, בגלל המבוגרים. מבוגרים אוהבים ספרות.
כאשר אתה מספר להם שיש לך חבר חדש, לעולם לא ישאלו אותך אודות דברים שבמהות. הם לא ישאלו: "מה צליל קולו? איזה משחקים אהובים עליו ביותר? האם הוא אוסף פרפרים?"
תחת זאת, ישאלו: "בן כמה הוא? כמה אחים לו? מה משקלו? כמה כסף משתכר אביו?" רק כך הם חשים שהם מכירים אותו.
אם תאמרו למבוגרים:
"ראיתי בית יפה בנוי מלבנים חכליליות, ולו פרחי גרניום בחלונות, ויונים על הגג", לא יוכלו לשוות בעיניהם את הבית כלל. יש לומר להם: "ראיתי בית שמחירו מאה מיליון פרנק", ואז יתפעלו: "או, איזה יופי!"
כך, אם תאמרו להם: "ההוכחה שהנסיך הקטן ה י ה היא, שהוא היה שובהלב, שצחק, ושרצה כבשה. אם מישהו רוצה כבשה, זו הוכחה לכך שהוא קיים", הם ימשכו בכתפיהם, וינהגו בכם כבילדים קטנים. אבל אם תאמרו: "הפלנטה אשר ממנה בא היא אסטרואיד B-612", אזי ישתכנעו, ויניחו לכם משאלותיהם. כאלה הם. זו אינה אשמתם, ועל הילדים לנהוג בהם באורךרוח.
אבל אנו, אנו שמבינים את החיים, אין אנו מייחסים חשיבות למספרים. הייתי חפץ להתחיל את סיפורי באופן שמתחילים לספר אגדה. הייתי רוצה לכתוב: "היה היה פעם נסיך קטן, שחי על פלנטה, שהיתה רק קצת גדולה ממנו עצמו, והיה לו צורך בכבשה.." עבור אלה שמבינים את החיים זה היה מעניק נופך של אמינות לסיפור.
כי אינני רוצה שמישהו יקרא את ספרי כלאחריד. הזכרונות האלה העציבו אותי מאד בעת שכתבתי אותם. שש שנים חלפו מאז הלך ממני ידידי עם כבשתו. אני מנסה לתאר אותו כאן, כדי שלא אשכחנו. עצוב לשכוח חבר. לא לכל אחד יש חבר, ואם אשכח אותו, אני עלול להיות ככל המבוגרים אשר אינם מתעניינים אלה במספרים.
לצורך זה, קניתי שוב קופסה של צבעים ועפרונות. קשה לחזור ולצייר בגילי, לאחר שמאז גיל שש, לא ציירתי אלא תמונות של נחש בואה מבחוץ, ונחש בואה מבפנים. אשתדל ככל שאוכל שהדיוקנאות יהיו קרובים למציאות, אבל אין בי בטחון שמלאכתי תצלח. ציור אחד עולה יפה, ומשנהו אין בו שום דמיון לנושא המצוייר. אני גם שוגה רבות באשר לגובהו של הנסיך הקטן: בכמה מקומות הוא גבוה מדי, ובמקומות אחרים נמוך מדי. ויש לי ספקות לגבי הצבעים של תלבושתו.
כלומר, אני מגשש בדרכי ככל יכולתי, לפעמים טוב, לפעמים רע. ודאי גם אשגה בפרטים מסוימים בעלי חשיבות, אבל אין זו אשמתי - ידידי מעולם לא הסביר לי דבר. אולי חשב שאני כמוהו, אבל לרוע המזל אינני יכול לראות כבשים מבעד לדפנות קופסה. אולי דמיתי קצת למבוגרים. הייתי אנוס לגדול.
פרק חמישי: ילדים, הזהרו מעצי באובב!
בכל יום למדתי פרט נוסף על הפלנטה של הנסיך הקטן, על לכתו ממנה, על המסע שלו. המידע הזה הגיע באיטיות, כאשר נשר במקרה מבין הגיגיו. כך שמעתי ביום השלישי אודות הקטסטרופה של עצי הבאובב.
גם הפעם עלי להודות על כך לכבשה, משום שהנסיך הקטן שאל אותי לפתע, כאילו ספק חמור חלחל בו פתאום:
"האם נכון שכבשים אוכלות שיחים קטנים?"
"כן, זה נכון."
"אה! אני שמח!"
לא הבנתי מה חשיבות בכך שכבשים יאכלו שיחים קטנים, אבל הנסיך הקטן הוסיף: "אם כך, הם יאכלו עצי באובב"?
ציינתי בפני הנסיך הקטן שעצי באובב אינם שיחים קטנים, אלא ההפך מזה: אלה עצים גדולים כמו כנסיות, אשר גם אם ייקח איתו עדר של פילים, העדר כולו לא יאכל עד תום אפילו עץ באובב אחד.
הרעיון של עדר פילים הצחיק את הנסיך הקטן. "יהיה עלינו לערום אותם איש על רעהו", הוא אמר.

ואז העיר הערה נבונה: "לפני שהם נעשים כל כך גדולים, עצי הבאובב מתחילים את דרכם כשהם קטנים".
"זו אמת לאמיתה", אמרתי. "אבל למה נחוץ לך שהכבשה תאכל עצי באובב קטנים?"
הוא ענה: "או באמת!", כאילו שוחחנו על דבר שהוא מובן מאליו. ואילו אני נדרשתי למאמץ מחשבתי גדול כדי לפתור חידה זו ללא עזרתו.
למדתי שבפלנטה של הנסיך הקטן, כמו בכל הפלנטות, יש צמחים טובים וצמחים רעים. עקב כך, יש זרעים טובים שמקורם בצמחים טובים, וזרעים רעים, אשר מקורם בצמחים רעים.
אבל הזרעים הם בלתי נראים לעין. הם ישנים עמוק בתוך האדמה, עד אשר אוחז באחד מהם רצון להתעורר. אז הזרע הקטן מתמתח ומתחיל בהססנות לשלוח זלזל קטן לעבר החמה. אם זה נבט של צנונית או שיחורד, יש להניח לו לגדול כאוות נפשו. אבל אם זהו צמח רע, יש לעקור אותו מוקדם ככל האפשר, מיד ברגע שמזהים אותו.
היו כמה זרעים נוראיים בפלנטה שהיא ביתו של הנסיך הקטן - היו אלה זרעי באובב. קרקע הפלנטה היתה מלאה בהם. אם מאחרים לטפל בעצי הבאובב, לנצח אי אפשר עוד להיפטר מהם. הם מתפשטים בכל רחבי הכוכב, שורשיהם חודרים את מעבה האדמה, ואם הפלנטה קטנה מדי ועצי הבאובב רבים מדי, הפלנטה מתבקעת לבסוף לרסיסים.
"זה ענין של משמעת", הסביר לי הנסיך הקטן אחר כך. "לאחר שמסיימים את רחצת הבוקר, יש לדאוג בקפדנות לנקיון הפלנטה. יש לעקור באדיקות את כל שתילי הבאובב, ברגע שאפשר להבדיל בינם לבין שיחי ורד, שנראים דומים להם כשהם צעירים. זו מלאכה משעממת", אמר הנסיך הקטן, "אבל גם מאד קלה".

ויום אחד הוא אמר לי: "עליך לצייר תמונה יפה, כדי שהילדים במקום בו אתה גר יראו בדיוק איך כל זה. אם ייצאו פעם למסע, זה יהיה להם לעזר. לפעמים," הוא הוסיף, "לפעמים אין נזק גדול בדחיה של מלאכה ליום המחרת, אבל בכל הנוגע לעצי הבאובב, פירוש הדבר אסון. הכרתי פלנטה שגר עליה בטלן אחד. הוא הזניח שלושה שיחים קטנים..."
לכן ציירתי את הפלנטה הזאת, כפי שהנסיך הקטן תיאר אותה באוזני. אינני אוהב להטיף מוסר, אבל הסכנה הטמונה בעצי באובב איננה ידועה די הצורך, והסכנה האורבת לכל מי שילך פעם לאיבוד על אסטרואיד היא כה גדולה, שאחרוג ממנהגי, ואומר: "ילדים! היזהרו מעצי באובב!"

ידידי ואנוכי התחמקנו מסכנה זו במשך זמן רב, בלי לדעת דבר אודותיה, לכן טרחתי כל כך כדי לייצר את התמונה הזאת עבורם. המסר שאני מעביר להם באופן זה ראוי לכל מאמץ מצדי.
אולי תשאלו אותי: "מדוע אין בספר שלך ציורים נוספים שהם כה מרשימים כמו הציור של עצי הבאובב?"
התשובה פשוטה - ניסיתי, אבל בציורים האחרים הצלחתי היתה פחותה. כאשר ציירתי את עצי הבאובב נוצקו בי תעצומות נפש, בגלל חשיבות הענין ודחיפותו.
פרק ששי: יפה שקיעת השמש ללב עצוב
הו נסיך קטן! מעט מעט למדתי את סוד חייך הקטנים והעצובים. במשך זמן רב תענוגך היחיד היה ההנאה השקטה שבהתבוננות בשקיעת השמש. למדתי פרט חדש זה בבוקרו של היום הרביעי, כאשר אמרת לי:

"אני מאד אוהב שקיעות. בוא, נלך עכשיו להתבונן בשקיעה."
"אבל עלינו להמתין...", אמרתי.
"להמתין למה?"
"להמתין עד למועד השקיעה."
תחילה נראית מופתע, ואז צחקת על טעותך, ואמרת לי:
"תמיד נדמה לי שאני בבית!"
ואמנם, הכל יודעים, שכאשר השעה היא שעת הצהרים בארצות-הברית, השמש שוקעת מעל צרפת. אם תוכלו לנסוע לצרפת בתוך דקה אחת, תגיעו היישר לזמן שקיעת החמה. לרוע המזל צרפת רחוקה מדי.
אבל על כוכב הלכת הזעיר שלך, כל שהיה עליך לעשות הוא להתיק את כסאך צעדים ספורים. יכולת לחזות ברדת הלילה בכל עת שתחפוץ...
"יום אחד", אמרת לי, "ראיתי את השקיעה ארבעים ושלוש פעמים!"
ואחר-כך הוספת:
"אתה יודע...כאשר מישהו מאד עצוב...הוא אוהב את השקיעות..."
"היית עצוב, אם כך", שאלתי, "ביום של ארבעים ושלוש השקיעות?"
אבל הנסיך הקטן לא ענה.
פרק שביעי: אשרי האוהב פרח אחד ויחיד
ביום החמישי, שוב, כמו תמיד, היה זה הודות לכבשה, שסוד זה בחייו של הנסיך הקטן נגלה לי.
לפתע פתאום, בלי שדבר יוביל לכך, כאילו השאלה נולדה מתוך הגיה ממושכת אודות בעיה, הוא שאל:
"כבשה, אם היא אוכלת שיחים קטנים, האם היא אוכלת גם פרחים?"
"כבשה", עניתי, "אוכלת כל מה שנקרה בדרכה".
"גם פרחים שיש עליהם קוצים?"
"כן, גם פרחים שיש עליהם קוצים."
"אם כך, הקוצים, מה תועלת בהם?"
לא ידעתי. באותו רגע הייתי עסוק בנסיון לשחרר בורג שנתקע בתוך המנוע שלי. הייתי מודאג, כי התברר לי שהתקלה במטוסי חמורה ביותר. נותרו איתי רק מעט מי שתיה, וחששתי מן הגרוע מכל.
"הקוצים - מה תועלת בהם?"
הנסיך הקטן לעולם לא הניח לשאלה, אחרי ששאל אותה. באשר לי, הייתי מוטרד מן הבורג ההוא, ועניתי לו בתשובה הראשונה שעלתה במוחי:
"הקוצים אין בהם תועלת. לפרחים יש קוצים כדי להכעיס!"
"אוה!"
השתררה שתיקה. ואז התפרץ כלפי בזעם ועלבון:
"אינני מאמין לך! פרחים הם יצורים חלשים. הם תמימים. הם מגינים על עצמם ככל יכולתם. הם מדמים בנפשם שהקוצים שלהם מפחידים..."

לא עניתי. באותו רגע אמרתי לעצמי: "אם הבורג הזה לא יסתובב, אכה אותו החוצה בפטיש."
שוב הפריע הנסיך הקטן למחשבותי:
"ואתה באמת מאמין שפרחים..."
"או, לא!" צעקתי. "אני לא מאמין בכלום! עניתי לך בדבר הראשון שעלה במוחי. אני עסוק עכשיו בדברים חשובים!"
עיניו ננעצו בי בהשתוממות. "דברים חשובים!"
הוא התבונן בי שם, הפטיש בידי, אצבעותי שחורות משמן מנועים, רכון על גבי חפץ שנראה לו מכוער עד מאד.
"אתה מדבר כמו מבוגרים!"
נכלמתי, אבל הוא המשיך ללא רחמים:
"אתה מבלבל הכל...אתה מערבב הכל..."
הוא היה אחוז חימה, והטיח את תלתליו הזהובים ברוח.
"אני מכיר פלנטה אחת שגר בה איש אחד אדום פנים. הוא מעולם לא הריח פרח. מעולם לא התבונן בכוכב. מעולם לא אהב אף אחד. מעולם לא עשה משהו בחייו, מלבד לחבר מספרים. וכל היום הוא חזר ואמר בדיוק כמוך: 'אני עסוק בדברים חשובים!' זה גרם לו להתנפח מרוב גאווה, אבל הוא לא אדם - הוא פטריה!"
"הוא מה?"
"פטריה!"
פניו של הנסיך הקטן הלבינו מזעם, "הפרחים גידלו קוצים במשך מיליוני שנים, ובמשך מיליוני שנים הכבשים אכלו אותם בכל זאת. האם אין זה חשוב להבין מדוע הפרחים טורחים כל כך לגדל קוצים שלעולם אינם מסייעים להם? האם המלחמה בין הפרחים לכבשים איננה חשובה? האין זה רציני וחשוב יותר מסיכומיו של האיש השמן בעל הפנים האדומות?
ואם אני מכיר פרח אחד אשר הוא יחיד ומיוחד בעולם, ואיננו גדל בשום מקום אחר אלא על הפלנטה שלי, וכבשה קטנה עלולה לקטום אותו בנגיסה אחת באיזה בוקר בלי להבין את אשר היא עושה, זה איננו חשוב?"
פניו שבו והאדימו.
"אם מישהו אוהב פרח, שיש רק אחד כמוהו בין כל מיליון-מיליוני הכוכבים, די לו להביט בכוכבים כדי להיות מאושר. הוא אומר לעצמו: 'אי-שם הפרח שלי נמצא...' אבל אם כבשה תאכל את הפרח, יהיה זה עבורו כאילו כל כוכבי השמים חשכו באחת! וזה לא חשוב בעיניך!"
יותר לא יכול היה לומר כי פרץ בבכי.
הלילה ירד. שמטתי מידי את כלי העבודה.
מה חשיבות יש לפטיש, לבורג, או לצמא, או למוות? על כוכב אחד, על פלנטה אחת, על הפלנטה שלי - ארץ, יש נסיך קטן שצריך לנחמו. נטלתי אותו בזרועותי ונענעתי אותו.
"הפרח שאתה אוהב איננו בסכנה... אני אצייר לכבשה שלך זמם... אצייר גדר להגן על הפרח שלך. אני..."
הייתי נבוך והחשתי.
לא נמצאו לי המלים לחדור אל ליבו, לחלוק את כאבו…
מקום כה סודי היא ארץ הדמעות.
פרק שמיני: הנסיך הקטן והשושנה המפנקת
בתוך זמן קצר הכרתי טוב יותר את הפרח הזה.
על הפלנטה של הנסיך הקטן היו תמיד פרחים פשוטים, אשר להם רק שורה אחת של עלי כותרת, שלא תפסו מקום רב ולא הטרידו איש. בוקר אחד צצו בדשא, ועם רדת ערב קמלו.
אבל יום אחד הופיע צמח חדש, שנבט מזרע אשר אין יודע מאין הגיע. הנסיך הקטן בחן בענין את השתיל הקטן הזה, שהיה שונה מכל השתילים הקטנים האחרים שעל הפלנטה שלו.
אתם מבינים, זה היה עלול להיות סוג חדש של באובב.
אך השיח הקטן עצר מגדילתו, והחל לייצר פרח. הנסיך הקטן התבונן בניצן הגדול שהחל ללבלב על הצמח, וחש שמשהו קסום עומד להתרחש.
אבל השושנה, חבויה בתאה הירוק, לא נחפזה להשלים את הכנות היופי שלה. היא בחרה בקפדנות את צבעיה, ועטתה את תלבושתה לאטה, מתאימה את עלי הכותרת אחד לאחד.
היא לא תופיע מקומטת כמו פרחי הפרג, היא תיכנס אל העולם במלוא תפארתה! או כן, היא היתה גנדרנית, והתייפותה המסתורית ארכה ימים רבים.

ואז בוקר אחד, בתום כל אותן הכנות ממושכות, עם הנץ החמה פיהקה ואמרה:
"אה! זה עתה התעוררתי... סלח לי... אני עוד קצת פרועה..."
הנסיך הקטן שלא יכול היה לאצור את התפעלותו, קרא:
"את כל כך יפה!"
"הלא כן?" ענתה השושנה במתק. "ונולדתי בדיוק עם השמש..."
כך למד הנסיך הקטן להכיר שהשושנה איננה צנועה כלל ועיקר. אבל כל כך מרגשת !
"נדמה לי שזה זמן לארוחת בוקר." אמרה, "אם תהיה כה אדיב ותדאג לצרכי..."
והנסיך הקטן, מבולבל, הלך להביא משפך עם מים טריים.

במהרה החלה גאוותנותה לייסר אותו. יום אחד, למשל, בעת ששחה אודות ארבעת קוציה, אמרה לנסיך הקטן:
"שיבואו הנמרים על טפריהם!"
"אין נמרים על הפלנטה שלי", ציין הנסיך הקטן, "ובכל מקרה, נמרים אינם אוכלים עשב".
"אינני עשב," הסבירה השושנה במתק.
"סלחי לי..."

"אינני פוחדת מנמרים", היא המשיכה, "אבל אני יראה מרוחות פרצים. אני מניחה שאין לך פרגוד עבורי?"
"יראה מרוחות, זה מזל ביש עבור צמח", חשב בליבו הנסיך הקטן, "הפרח הזה הוא יצור מסובך מאד...".

"בלילות רצוני שתכסה אותי בכיפת זכוכית. קר אצלך מאד, המקום אינו בנוי כהלכה. במקום ממנו באתי..."
אבל כאן עצרה. היא הגיעה לכאן בדמות זרע. לא יתכן שידעה דבר אודות עולמות אחרים. נבוכה מכך שכמעט נחשפה בשקר ברור, השתעלה שלוש או ארבע פעמים, כדי לטעת רגשי אשמה בנסיך הקטן: "הפרגוד?"
"עמדתי לחפש פרגוד בשבילך, בעת שדיברת אלי".
היא הגבירה מעט את שיעולה, כדי שבכל זאת יסבול יסורי מצפון.
כך, הנסיך הקטן, למרות אהבתו הנאמנה לשושנה שלו, החל לפקפק באהבתה אליו. הוא לקח אל ליבו מלים נטולות חשיבות, והיה אומלל עד מאד.
"אסור היה לי להקשיב לה", התוודה יום אחד בפני. "אף פעם אסור להקשיב לפרחים. צריך רק להתבונן בהם ולשאוף את ניחוחם. השושנה שלי בישמה הפלנטה שלי, ואני לא ידעתי ליהנות מכך. נמלאתי צער בגלל הסיפור ההוא אודות טפרים, בעוד שהיה עלי להתמלא רכות."

והוא המשיך בוידוי:
"בעצם לא הבנתי כלום! היה עלי לשפוט את המעשים ולא את המלים. היא הרעיפה עלי את ניחוחה וזוהרה. אסור היה לברוח ממנה! היה עלי להבחין בחיבה שמאחורי תחבולותיה. פרחים הם מלאי סתירות!
אבל אני הייתי צעיר מכדי לדעת לאהוב אותה."
פרק תשיעי: הנסיך הקטן יוצא למסעותיו
אני סבור שלצורך מסעו נעזר הנסיך הקטן בלהקה של ציפורי בר נודדות.
בבוקר קודם עזיבתו, השליט סדר מופתי בפלנטה שלו.
הוא ניקה בקפדנות את הרי הגעש הפעילים. היו לו שני הרי געש פעילים, אשר שימשו אותו לחימום ארוחת הבוקר. היה לו גם הר געש אחד כבוי, אבל, כפי שאמר, "לעולם אין לדעת!" לכן ניקה גם את הר הגעש הכבוי.
כאשר הרי געש נקיים למשעי, הם בוערים מתונות, ללא התפרצויות. התפרצות הר געש היא כמו אש המתפרצת בארובה.
מובן מאליו שעל הארץ שלנו, אנחנו קטנים מכדי לנקות את הרי הגעש, וזו הסיבה שהם מביאים עלינו כל כך הרבה צרות.
הנסיך הקטן עקר, קצת בעצב, את הנבטים האחרונים של באובב. הוא חשב שלעולם לא ישוב.
באותו בוקר בהיר, כל המטלות המוכרות היו לפתע יקרות ללבו עד מאד, וכאשר השקה את הפרח שלו בפעם האחרונה, והתכונן לכסותו בכיפת הזכוכית, נוכח לדעת שהוא קרוב לדמעות.

"שלום", הוא אמר לפרח.
אבל היא לא ענתה.
"שלום" הוא חזר.
השושנה השתעלה, אבל לא כי היתה מצוננת.
"הייתי טפשה." אמרה לבסוף, "אני מבקשת את סליחתך. נסה להיות מאושר..."
הנסיך הקטן הופתע מכך שאיננה נוזפת בו, והוא ניצב מבולבל, כיפת הזכוכית בידו, אינו מבין מה פשר הרכות השקטה של הפרח.
"כמובן, אני אוהבת אותך", אמרה השושנה. "אתה לא ידעת זאת, בגללי. זה לא חשוב. אבל גם אתה היית טיפש, בדיוק כמוני. נסה להיות מאושר... הנח לכיפת הזכוכית. אינני רוצה בה עוד."
"אבל הרוח..."
"לא קר לי עד כדי כך... אוויר הלילה הקריר מיטיב אתי. אני פרח."
"אבל החיות..."
"יתכן שיהיה עלי לשאת את נוכחותם של שניים או שלושה זחלים אם רצוני להתוודע לפרפרים. נראה לי שהם יפים עד מאד, וזולתם מי עוד יבוא לבקרני? אתה תהיה כל כך רחוק. ובאשר לחיות הגדולות, אינני חוששת מהן. יש לי קוצים."
ובתמימות הצביעה על ארבעת קוציה.
ואז הוסיפה:
"אל תתמהמה עכשיו, זה גורם לי צער. החלטת ללכת, עכשיו לך!"
כי לא רצתה שיראה אותה בוכה. היא היתה פרח כל כך גאוותן...
פרק עשירי: כוכבו של המלך הבודד
הנסיך הקטן נקרה במסעו לאיזור האסטרואידים 325, 326, 327, 328, 329, ו-330, לכן התחיל בביקור באסטרואידים אלה, כדי שיהיה לו ענין לעסוק בו, וכדי להעשיר את ידיעותיו.
הראשון בהם היה משכנו של מלך.
עוטה גלימה של ארגמן ופרוות סמור, ישב המלך על כס המלכות שלו, אשר היה פשוט, ורב-הוד, בעת ובעונה אחת.

"אה! הנה נתין!", קרא המלך כאשר הבחין בנסיך הקטן. והנסיך שאל בלבו: "היאך יתכן שהוא מכיר אותי, הרי מעולם לא פגש בי קודם?"
הוא לא ידע שעבור המלכים, העולם הוא מקום פשוט - בעיניהם כל בני האדם הם נתינים.
"קרב הלום, כדי שאיטיב לראותך", אמר לו המלך, אשר שש להיות מלך על מישהו.
הנסיך הקטן תר סביבו אחרי מקום לשבת בו, אבל שולי גלימת הפרווה הנהדרת של המלך מילאו את פני הכוכב. לכן נשאר על עומדו, ומכיוון שהיה עייף, פיהק.
"פיהוק בנוכחות המלך הוא בניגוד לכללי הטקס," אמר המלך, "אני אוסר זאת."
"איני יכול להימנע מכך", נבוך הנסיך הקטן, "עברתי דרך ארוכה במסעי, ולא ישנתי כלל."
"אם כן", אמר המלך, "אני מצווה עליך לפהק! מזה שנים רבות לא ראיתי מישהו מפהק. פיהוקים הם דבר רבענין בשבילי. קדימה! פהק שוב. זו פקודה!"
"זה הפחיד אותי...אינני יכול שוב..." הסמיק הנסיך הקטן.
"הם, הם," ענה המלך, "אם כך אני...אני מצווה עליך מדי פעם לפהק ומדי פעם ל..." ואז גמגם משהו, ונראה מרוגז.
כי המלך דרש בתוקף שסמכותו תכובד. הוא לא התיר שום התרופפות במשמעת. הוא היה שליט אבסולוטי. אבל מכיוון שהיה גם אדם טוב, הוראתיו היו מתקבלות על הדעת.
הוא נהג לומר: "אילו הייתי מצווה על גנרל להפוך לציפורים, והגנרל היה ממרה את פי, לא היתה זו אשמת הגנרל, אלא אשמתי אני."
"מותר לי לשבת?", נשמעה שאלה מהוססת מפי הנסיך הקטן.
"אני מצווה עליך לשבת!" אמר המלך, ובתנועה מלכותית אסף את שולי גלימת הפאר שלו.
אבל הנסיך הקטן תהה בלבו. הפלנטה היתה זעירה. על מה מלך המלך ?
"אדוני", הוא אמר לבסוף, "מחל לי על שאני פונה אליך בשאלה..."
"אני מצווה עליך להפנות אלי שאלה", דחק בו המלך.
"אדוני, על מה אתה מולך?"
"על הכל." ענה המלך בפשטות מלכותית.
"על הכל?"
המלך החווה בידו על הפלנטה שלו, ועל הפלנטות האחרות, ועל כל כוכבי השמים.
"על כל זה?" שאל הנסיך הקטן.
"על כל זה." אמר המלך. משום שלא היה רק מלך אבסולוטי, אלא גם מלך אוניברסלי.
"והכוכבים נשמעים לציווייך?"
"וודאי." אמר המלך," הם מצייתים לי מיד. אינני מתיר התרופפות במשמעת."
עוצמה כגון זו מילאה את הנסיך השתאות. אילו היה הוא בעל סמכות שכזאת, היה יכול לצפות בשקיעה לא ארבעים וארבע פעמים ביום, אלא שבעים ושתיים, או מאה, או מאתיים פעמים ביום אחד, בלי להעתיק כלל את כסאו.
ובגלל שנזכר בפלנטה הקטנה שלו אשר נטש, הרגיש עצוב, ואזר אומץ לבקש דברמה מן המלך:
"הייתי רוצה לראות את השקיעה...אנא...צווה על השמש לשקוע..."
"אילו הייתי מצווה על גנרל לעופף מפרח לפרח כמו פרפר, או לכתוב טרגדיה, או להפוך לציפור ימית, והגנרל היה ממרה את פי, במי מאיתנו האשמה?" שאל המלך, "בגנרל, או בי עצמי?"
"בך", ענה הנסיך הקטן נחרצות.
"מדוייק. יש לדרוש מכל אחד רק הדברים שביכולתו לבצע.", המשיך המלך, "סמכות טמונה קודם כל בהגיון. אילו הייתי מצווה על אנשים להשליך עצמם למי הים, הם יתמרדו נגדי. יש בכוחי לתבוע צייתנות משום שפקודותי מתקבלות על הדעת."
"אז, השקיעה שלי?" הזכיר לו הנסיך הקטן, משום שלעולם לא הניח לשאלה אחרי ששאל אותה.
"אתה תקבל את השקיעה שלך. כך אצווה. אבל בהתאם לתורת השלטון שלי, אמתין עד אשר יבשילו לכך התנאים."
"מתי זה יהיה?" שאל הנסיך הקטן.
"הם, הם" אמר המלך, ונועץ באלמנך עב-כרס. "הם, הם. יהיה זה בערך ב..., זה יהיה הערב לקראת השעה עשרים דקות לפני שמונה. ואתה תיווכח לראות שהכל מצייתים לי."
הנסיך הקטן פיהק. הוא הצטער על שהחמיץ את השקיעה, ועתה גם החל להתייגע.
"אין לי דבר יותר לעשות כאן", הוא אמר למלך, "לכן אצא לדרכי".
"אל תלך", אמר המלך, אשר שמח שיש לו נתין. "אל תלך. אמנה אותך לשר!"
"איזה שר?"
"שר ה...שר המשפטים!"
"אבל אין כאן איש כדי לשפוט!"
"אין לדעת.", אמר המלך, "טרם ערכתי סיור מקיף בתחומי ממשלתי. אני זקן מאד. אין כאן מקום לכרכרה, וההליכה מעייפת אותי."
"או, אבל אני כבר ראיתי", אמר הנסיך הקטן, מסב את ראשו כדי להעיף שוב מבט בצידה השני של הפלנטה, "גם בצד השני, אין נפש חיה..."
"אם כך, תשפוט את עצמך!", אמר המלך. "זהו השיפוט הקשה מכל. הרבה יותר קשה לדון את עצמך מאשר לדון אחרים. אם תצליח בכך, אזי באמת ובתמים איש חכם אתה".
"אני יכול לדון את עצמי בכל מקום, אינני צריך לגור כאן".
"הם הם" אמר המלך. "סיבותי עמי להאמין שבמקום כלשהו על פני הפלנטה שלי שוכן עכברוש זקן. בלילות אני שומע אותו. תוכל לשפוט את העכברוש. מעת לעת תדון אותו למוות, וכך חייו יהיו תלויים במשפטך. אבל גם תחון אותו בכל פעם, כדי לנהוג בחסכנות, כי הוא הנתין היחיד שבנמצא".
"אני", ענה הנסיך הקטן", אינני אוהב לדון למוות. ועכשיו בדעתי לצאת לדרך".
"לא", אמר המלך.
הנסיך הקטן, שהשלים את ההכנות ליציאה, לא רצה לצער עוד את המונרך הזקן.
"אם רצון הוד מלכותו שיצייתו לו בלי להשתהות", הוא אמר, "עליו לצוות עלי ציוויים מתקבלים על הדעת. עליו לצוות עלי, למשל, לצאת לדרכי בזה הרגע. נראה לי שהתנאים בשלו לכך..."
המלך שתק. הנסיך הקטן היסס לכן עוד רגע, ואז נאנח, ויצא לדרכו.
"מיניתי אותך לשגריר!", קרא אחריו המלך.
היתה בקולו סמכות מעורר כבוד.
"המבוגרים באמת משונים", שח הנסיך הקטן בלבו, בעת ששוב יצא למסעו.
פרק אחד-עשר: כוכבו של הרברבן
בפלנטה השניה גר אדם רברבן.
"אה! הנה מעריץ בא לשחר פני!" הכריז הרברבן מרחוק, כאשר ראה את הנסיך הקטן מתקרב. כי בעיני רברבן, כל האחרים הם מעריצים.

"בוקר טוב!" אמר הנסיך הקטן. "יש לך כובע משונה".
"זה כובע להגבהה. זה להגבהה לאות הוקרה, כאשר אנשים מריעים לי. לרוע המזל איש לא עובר כאן."
"אה, כן?" אמר הנסיך הקטן, שלא הבין על מה הוא שח.
"מחא כפיים", אמר לו האיש הרברבן.
הנסיך הקטן מחא כפיו, והאיש היהיר הגביה את כובעו בענוותנות, לאות הוקרה.
"זה יותר משעשע מאשר הביקור אצל המלך," אמר בליבו הנסיך הקטן. הוא שב ומחא כפיו, והרברבן שוב הגביה את כובעו.
בחלוף חמש דקות של תרגול, הנסיך הקטן התייגע מן המשחק החד-גוני. "ומה צריך לעשות כדי שהכובע יונמך?" הוא שאל.
אבל הרברבן לא ענה. רברבנים לא שומעים כלום מחוץ למחמאות.
"האם באמת אתה מעריץ אותי מאד?" חקר את הנסיך הקטן.
"מה פרוש 'מעריץ' "?
"להעריץ פירושו להכיר בכך שאני האדם הנאה ביותר, הלבוש בצורה ההדורה ביותר, העשיר ביותר והפיקח ביותר על פני הפלנטה."
"אבל אתה לבדך בפלנטה זו!"
רצה אותי בבקשה, הערץ אותי בכל זאת."
"אני מעריץ אותך," אמר הנסיך הקטן, מושך בכתפיו, "אבל למה זה חשוב לך?"
והוא פנה לדרכו.
"מבוגרים הם ללא צל של ספק מוזרים", חשב, שעה שהמשיך במסעו.
EOT;
}
